import React from "react";
import { StyleSheet, View, Text, ScrollView } from "react-native";
import PagerView from "react-native-pager-view";

const MyPager = () => {
  return (
    <View style={{ flex: 1 }}>
      <PagerView style={styles.viewPager} initialPage={0}>
        <View style={styles.page} key="1">
          <ScrollView>
            <Text style={styles.textalign}> Page 1 </Text>
            <Text style={styles.textalign}>
             *ಶ್ರೀವೀರಭದ್ರ ಸಹಸ್ರನಾಮ ಸ್ತೋತ್ರಂ*
  {"\n"}{"\n"}
ಓಂ ಶ್ರೀಗಣೇಶಾಯ ನಮಃ ।
ಶ್ರೀಉಮಾಮಹೇಶ್ವರಾಭ್ಯಾಂ ನಮಃ ।
ಶ್ರೀವೀರಭದ್ರಾಯ ನಮಃ ।
ಶ್ರೀಭದ್ರಕಾಲ್ಯೈ ನಮಃ ।

 
॥ ಶ್ರೀವೀರಭದ್ರಸಹಸ್ರನಾಮಸ್ತೋತ್ರಮ್ ॥

ಪೂರ್ವಭಾಗಮ್ ।

ಓಂ ಅಸ್ಯ ಶ್ರೀವೀರಭದ್ರಸಹಸ್ರನಾಮಸ್ತೋತ್ರಮಹಾಮನ್ತ್ರಸ್ಯ
ನಾರಾಯಣಋಷಿಃ । ಅನುಷ್ಟುಪ್ಛನ್ದಃ । ಶ್ರೀವೀರಭದ್ರೋದೇವತಾ ।
ಶ್ರೀಂ ಬೀಜಮ್ । ವೀಂ ಶಕ್ತಿಃ । ರಂ ಕೀಲಕಮ್ ॥

 
ಮಮೋಪಾತ್ತ ಸಮಸ್ತದುರಿತಕ್ಷಯಾರ್ಥಂ ಚಿನ್ತಿತಫಲಾವಾಪ್ತ್ಯರ್ಥಂ
ಧರ್ಮಾರ್ಥಕಾಮಮೋಕ್ಷ ಚತುರ್ವಿಧಫಲಪುರುಷಾರ್ಥಸಿದ್ಧ್ಯರ್ಥಂ
ಶ್ರೀವೀರಭದ್ರಸಹಸ್ರನಾಮಸ್ತೋತ್ರಪಾಠೇ ವಿನಿಯೋಗಃ ॥

ಅಥ ಧ್ಯಾನಮ್ ।
ರೌದ್ರಂ ರುದ್ರಾವತಾರಂ ಹುತವಹನಯನಂ ಚೋರ್ಧ್ವಕೇಶಂ ಸುದಂಷ್ಟ್ರಂ
ಭೀಮಾಂಗಂ ಭೀಮರೂಪಂ ಕಿಣಿಕಿಣಿರಭಸಂ ಜ್ವಾಲಮಾಲಾಽಽವೃತಾಂಗಮ್ ।
ಭೂತಪ್ರೇತಾದಿನಾಥಂ ಕರಕಮಲಮಹಾಖಡ್ಗಪಾತ್ರೇ ವಹನ್ತಂ
ವನ್ದೇ ಲೋಕೈಕವೀರಂ ತ್ರಿಭುವನನಮಿತಂ ಶ್ಯಾಮಲಂ ವೀರಭದ್ರಮ್ ॥

ಅಥ ಸಹಸ್ರನಾಮಸ್ತೋತ್ರಮ್ ।
ಶಮ್ಭುಃ ಶಿವೋ ಮಹಾದೇವೋ ಶಿತಿಕಂಠೋ ವೃಷಧ್ವಜಃ ।
ದಕ್ಷಾಧ್ವರಕರೋ ದಕ್ಷಃ ಕ್ರೂರದಾನವಭಂಜನಃ ॥ 1 ॥

 
ಕಪರ್ದೀ ಕಾಲವಿಧ್ವಂಸೀ ಕಪಾಲೀ ಕರುಣಾರ್ಣವಃ ।
ಶರಣಾಗತರಕ್ಷೈಕನಿಪುಣೋ ನೀಲಲೋಹಿತಃ ॥ 2 ॥

ನಿರೀಶೋ ನಿರ್ಭಯೋ ನಿತ್ಯೋ ನಿತ್ಯತೃಪ್ತೋ ನಿರಾಮಯಃ ।
ಗಮ್ಭೀರನಿನದೋ ಭೀಮೋ ಭಯಂಕರಸ್ವರೂಪಧೃತ್ ॥ 3 ॥

ಪುರನ್ದರಾದಿ ಗೀರ್ವಾಣವನ್ದ್ಯಮಾನಪದಾಮ್ಬುಜಃ ।
ಸಂಸಾರವೈದ್ಯಃ ಸರ್ವಜ್ಞಃ ಸರ್ವಭೇಷಜಭೇಷಜಃ ॥ 4 ॥

 
ಮೃತ್ಯುಂಜಯಃ ಕೃತ್ತಿವಾಸಸ್ತ್ರ್ಯಮ್ಬಕಸ್ತ್ರಿಪುರಾನ್ತಕಃ ।
ವೃನ್ದಾರವೃನ್ದಮನ್ದಾರೋ ಮನ್ದಾರಾಚಲಮಂಡನಃ ॥ 5 ॥

ಕುನ್ದೇನ್ದುಹಾರನೀಹಾರಹಾರಗೌರಸಮಪ್ರಭಃ ।
ರಾಜರಾಜಸಖಃ ಶ್ರೀಮಾನ್ ರಾಜೀವಾಯತಲೋಚನಃ ॥ 6 ॥

ಮಹಾನಟೋ ಮಹಾಕಾಲೋ ಮಹಾಸತ್ಯೋ ಮಹೇಶ್ವರಃ ।
ಉತ್ಪತ್ತಿಸ್ಥಿತಿಸಂಹಾರಕಾರಣಾನನ್ದಕರ್ಮಕಃ ॥ 7 ॥

ಸಾರಃ ಶೂರೋ ಮಹಾಧೀರೋ ವಾರಿಜಾಸನಪೂಜಿತಃ ।
ವೀರಸಿಂಹಾಸನಾರೂಢೋ ವೀರಮೌಲಿಶಿಖಾಮಣಿಃ ॥ 8 ॥

ವೀರಪ್ರಿಯೋ ವೀರರಸೋ ವೀರಭಾಷಣತತ್ಪರಃ ।
ವೀರಸಂಗ್ರಾಮವಿಜಯೀ ವೀರಾರಾಧನತೋಷಿತಃ ॥ 9 ॥

ವೀರವ್ರತೋ ವಿರಾಡ್ರೂಪೋ ವಿಶ್ವಚೈತನ್ಯರಕ್ಷಕಃ ।
ವೀರಖಡ್ಗೋ ಭಾರಶರೋ ಮೇರುಕೋದಂಡಮಂಡಿತಃ ॥ 10 ॥

ವೀರೋತ್ತಮಾಂಗಃ ಶೃಂಗಾರಫಲಕೋ ವಿವಿಧಾಯುಧಃ ।
ನಾನಾಸನೋ ನತಾರಾತಿಮಂಡಲೋ ನಾಗಭೂಷಣಃ ॥ 11 ॥

ನಾರದಸ್ತುತಿಸನ್ತುಷ್ಟೋ ನಾಗಲೋಕಪಿತಾಮಹಃ ।
ಸುದರ್ಶನಃ ಸುಧಾಕಾಯೋ ಸುರಾರಾತಿವಿಮರ್ದನಃ ॥ 12 ॥

ಅಸಹಾಯಃ ಪರಃ ಸರ್ವಸಹಾಯಃ ಸಾಮ್ಪ್ರದಾಯಕಃ ।
ಕಾಮದೋ ವಿಷಭುಗ್ಯೋಗೀ ಭೋಗೀನ್ದ್ರಾಂಚಿತಕುಂಡಲಃ ॥ 13 ॥

ಉಪಾಧ್ಯಾಯೋ ದಕ್ಷರಿಪುಃ ಕೈವಲ್ಯನಿಧಿರಚ್ಯುತಃ ।
ಸತ್ತ್ವಂ ರಜಸ್ತಮಃ ಸ್ಥೂಲಃ ಸೂಕ್ಷ್ಮೋಽನ್ತರ್ಬಹಿರವ್ಯಯಃ ॥ 14 ॥

ಭೂರಾಪೋ ಜ್ವಲನೋ ವಾಯುರ್ಗಗನಂ ತ್ರಿಜಗದ್ಗುರುಃ ।
ನಿರಾಧಾರೋ ನಿರಾಲಮ್ಬಃ ಸರ್ವಾಧಾರಃ ಸದಾಶಿವಃ ॥ 15 ॥

ಭಾಸ್ವರೋ ಭಗವಾನ್ ಭಾಲನೇತ್ರೋ ಭಾವಜಸಂಹರಃ ।
ವ್ಯಾಲಬದ್ಧಜಟಾಜೂಟೋ ಬಾಲಚನ್ದ್ರಶಿಖಾಮಣಿಃ ॥ 16 ॥

ಅಕ್ಷಯ್ಯೈಕಾಕ್ಷರೋ ದುಷ್ಟಶಿಕ್ಷಕಃ ಶಿಷ್ಟರಕ್ಷಿತಃ ।
ದಕ್ಷಪಕ್ಷೇಷುಬಾಹುಲ್ಯವನಲೀಲಾಗಜೋ ಋಜುಃ ॥ 17 ॥

ಯಜ್ಞಾಂಗೋ ಯಜ್ಞಭುಗ್ಯಜ್ಞೋ ಯಜ್ಞೇಶೋ ಯಜನೇಶ್ವರಃ ।
ಮಹಾಯಜ್ಞಧರೋ ದಕ್ಷಸಮ್ಪೂರ್ಣಾಹೂತಿಕೌಶಲಃ ॥ 18 ॥

ಮಾಯಾಮಯೋ ಮಹಾಕಾಯೋ ಮಾಯಾತೀತೋ ಮನೋಹರಃ ।
ಮಾರದರ್ಪಹರೋ ಮಂಜುರ್ಮಹೀಸುತದಿನಪ್ರಿಯಃ ॥ 19 ॥

ಸೌಮ್ಯಃ ಸಮೋಽಸಮೋಽನನ್ತಃ ಸಮಾನರಹಿತೋ ಹರಃ ।
ಸೋಮೋಽನೇಕಕಲಾಧಾಮಾ ವ್ಯೋಮಕೇಶೋ ನಿರಂಜನಃ ॥ 20 ॥

ಗುರುಃ ಸುರಗುರುರ್ಗೂಢೋ ಗುಹಾರಾಧನತೋಷಿತಃ ।
ಗುರುಮನ್ತ್ರಾಕ್ಷರಗುರುಃ ಪರಃ ಪರಮಕಾರಣಮ್ ॥ 21 ॥

ಕಲಿಃ ಕಲಾಢ್ಯೋ ನೀತಿಜ್ಞಃ ಕರಾಲಾಸುರಸೇವಿತಃ ।
ಕಮನೀಯರವಿಚ್ಛಾಯೋ ನನ್ದನಾನನ್ದವರ್ಧನಃ ॥ 22 ॥

ಸ್ವಭಕ್ತಪಕ್ಷಃ ಪ್ರಬಲಃ ಸ್ವಭಕ್ತಬಲವರ್ಧನಃ ।
ಸ್ವಭಕ್ತಪ್ರತಿವಾದೀನ್ದ್ರಮುಖಚನ್ದ್ರವಿತುನ್ತುದಃ ॥ 23 ॥

ಶೇಷಭೂಷೋ ವಿಶೇಷಜ್ಞಸ್ತೋಷಿತಃ ಸುಮನಾಃ ಸುಧೀಃ ।
ದೂಷಕಾಭಿಜನೋದ್ಧೂತಧೂಮಕೇತುಸ್ಸನಾತನಃ ॥ 24 ॥

ದೂರೀಕೃತಾಘಪಟಲಶ್ಚೋರೀಕೃತಸುಖಪ್ರಜಃ ।
ಪೂರೀಕೃತೇಷುಕೋದಂಡೋ ನಿರ್ವೈರೀಕೃತಸಂಗರಃ ॥ 25 ॥

ಬ್ರಹ್ಮವಿದ್ಬ್ರಾಹ್ಮಣೋ ಬ್ರಹ್ಮ ಬ್ರಹ್ಮಚಾರೀ ಜಗತ್ಪತಿಃ ।
ಬ್ರಹ್ಮೇಶ್ವರೋ ಬ್ರಹ್ಮಮಯಃ ಪರಬ್ರಹ್ಮಾತ್ಮಕಃ ಪ್ರಭುಃ ॥ 26 ॥

ನಾದಪ್ರಿಯೋ ನಾದಮಯೋ ನಾದಬಿನ್ದುರ್ನಗೇಶ್ವರಃ ।
ಆದಿಮಧ್ಯಾನ್ತರಹಿತೋ ವಾದೋ ವಾದವಿದಾಂ ವರಃ ॥ 27 ॥

ಇಷ್ಟೋ ವಿಶಿಷ್ಟಸ್ತುಷ್ಟಘ್ನಃ ಪುಷ್ಟಿದಃ ಪುಷ್ಟಿವರ್ಧನಃ ।
ಕಷ್ಟದಾರಿದ್ರ್ಯನಿರ್ನಾಶೋ ದುಷ್ಟವ್ಯಾಧಿಹರೋ ಹರಃ ॥ 28 ॥

ಪದ್ಮಾಸನಃ ಪದ್ಮಕರೋ ನವಪದ್ಮಾಸನಾರ್ಚಿತಃ ।
ನೀಲಾಮ್ಬುಜದಲಶ್ಯಾಮೋ ನಿರ್ಮಲೋ ಭಕ್ತವತ್ಸಲಃ ॥ 29 ॥

ನೀಲಜೀಮೂತಸಂಕಾಶಃ ಕಾಲಕನ್ಧರಬನ್ಧುರಃ ।
ಜಪಾಕುಸುಮಸನ್ತುಷ್ಟೋ ಜಪಹೋಮಾರ್ಚ್ಚನಪ್ರಿಯಃ ॥ 30 ॥

ಜಗದಾದಿರನಾದೀಶೋಽಜಗವನ್ಧರಕೌತುಕಃ ।
ಪುರನ್ದರಸ್ತುತಾನನ್ದಃ ಪುಲಿನ್ದಃ ಪುಣ್ಯಪಂಜರಃ ॥ 31 ॥

ಪೌಲಸ್ತ್ಯಚಲಿತೋಲ್ಲೋಲಪರ್ವತಃ ಪ್ರಮದಾಕರಃ ।
ಕರಣಂ ಕಾರಣಂ ಕರ್ಮ ಕರಣೀಯಾಗ್ರಣೀರ್ದೃಢಃ ॥ 32 ॥

ಕರಿದೈತ್ಯೇನ್ದ್ರವಸನಃ ಕರುಣಾಪೂರವಾರಿಧಿಃ ।
ಕೋಲಾಹಲಪ್ರಿಯಃ ಪ್ರೀತಃ ಶೂಲೀ ವ್ಯಾಲಕಪಾಲಭೃತ್ ॥ 33 ॥

ಕಾಲಕೂಟಗಲಃ ಕ್ರೀಡಾಲೀಲಾಕೃತಜಗತ್ತ್ರಯಃ ।
ದಿಗಮ್ಬರೋ ದಿನೇಶೇಶೋ ಧೀಮಾನ್ಧೀರೋ ಧುರನ್ಧರಃ ॥ 34 ॥

ದಿಕ್ಕಾಲಾದ್ಯನವಚ್ಛಿನ್ನೋ ಧೂರ್ಜಟಿರ್ಧೂತದುರ್ಗತಿಃ ।
ಕಮನೀಯಃ ಕರಾಲಾಸ್ಯಃ ಕಲಿಕಲ್ಮಷಸೂದನಃ ॥ 35 ॥

ಕರವೀರೋಽರುಣಾಮ್ಭೋಜಕಲ್ಹಾರಕುಸುಮಾರ್ಪಿತಃ ।
ಖರೋ ಮಂಡಿತದೋರ್ದಂಡಃ ಖರೂಪಃ ಕಾಲಭಂಜನಃ ॥ 36 ॥

ಖರಾಂಶುಮಂಡಲಮುಖಃ ಖಂಡಿತಾರಾಮತಿಂಡಲಃ ।
ಗಣೇಶಗಣಿತೋಽಗಣ್ಯಃ ಪುಣ್ಯರಾಶೀ ಸುಖೋದಯಃ ॥ 37 ॥

ಗಣಾಧಿಪಕುಮಾರಾದಿಗಣಕೈರವಬಾನ್ಧವಃ ।
ಘನಘೋಷಬೃಹನ್ನಾದಘನೀಕೃತಸುನೂಪುರಃ ॥ 38 ॥

ಘನಚರ್ಚಿತಸಿನ್ದೂರೋ ಘಂಟಾಭೀಷಣಭೈರವಃ ।
ಪರಾಪರೋ ಬಲೋಽನನ್ತಶ್ಚತುರಶ್ಚಕ್ರಬನ್ಧಕಃ ॥ 39 ॥

ಚತುರ್ಮುಖಮುಖಾಮ್ಭೋಜಚತುರಸ್ತುತಿತೋಷಣಃ ।
ಛಲವಾದೀ ಛಲಶ್ಶಾನ್ತಶ್ಛಾನ್ದಸಶ್ಛಾನ್ದಸಪ್ರಿಯಃ ॥ 40 ॥

ಛಿನ್ನಚ್ಛಲಾದಿದುರ್ವಾದಚ್ಛಿನ್ನಷಟ್ತನ್ತ್ರತಾನ್ತ್ರಿಕಃ ।
ಜಡೀಕೃತಮಹಾವಜ್ರಜಮ್ಭಾರಾತಿರ್ನತೋನ್ನತಃ ॥ 41 ॥

ಜಗದಾಧಾರಭೂತೇಶೋ ಜಗದನ್ತೋ ನಿರಂಜನಃ ।
ಝರ್ಝರಧ್ವನಿಸಮ್ಯುಕ್ತೋ ಝಂಕಾರರವಭೂಷಣಃ ॥ 42 ॥

ಝಟೀವಿಪಕ್ಷವೃಕ್ಷೌಘಝಂಝಾಮಾರುತಸನ್ನಿಭಃ ।
ಪ್ರವರ್ಣಾಂಚಿತಪತ್ರಾಂಕಃ ಪ್ರವರ್ಣಾದ್ಯಕ್ಷರವ್ರಜಃ ॥ 43 ॥

ಟ ವರ್ಣಬಿನ್ದುಸಮ್ಯುಕ್ತಷ್ಟಂಕಾರಹೃತದಿಗ್ಗಜಃ ।
ಠ ವರ್ಣಪೂರದ್ವಿದಳಷ್ಟವರ್ಣಾಗ್ರದಳಾಕ್ಷರಃ ॥ 44 ॥

ಠ ವರ್ಣಯುತಸದ್ಯನ್ತ್ರಷ್ಠ ಜ ಚಾಕ್ಷರಪೂರಕಃ ।
ಡಮರುಧ್ವನಿಸಮ್ರಕ್ತೋ ಡಮ್ಬರಾನನ್ದತಾಂಡವಃ ॥ 45 ॥

ಡಂಡಂಢಘೋಷಪ್ರಮದಾಽಽಡಮ್ಬರೋ ಗಣತಾಂಡವಃ ।
ಢಕ್ಕಾಪಟಹಸುಪ್ರೀತೋ ಢಕ್ಕಾರವವಶಾನುಗಃ ॥ 46 ॥

ಢಕ್ಕಾದಿತಾಳಸನ್ತುಷ್ಟೋ ಟೋಡಿಬದ್ಧಸ್ತುತಿಪ್ರಿಯಃ ।
ತಪಸ್ವಿರೂಪಸ್ತಪನಸ್ತಪ್ತಕಾಂಚನಸನ್ನಿಭಃ ॥ 47 ॥

ತಪಸ್ವಿವದನಾಮ್ಭೋಜಕಾರುಣ್ಯಸ್ತರಣಿದ್ಯುತಿಃ ।
ಢಗಾದಿವಾದಸೌಹಾರ್ದಸ್ಥಿತಃ ಸಮ್ಯಮಿನಾಂ ವರಃ ॥ 48 ॥

ಸ್ಥಾಣುಸ್ತಂಡುನುತಿಪ್ರೀತಃ ಸ್ಥಿತಿಸ್ಥಾವರಜಂಗಮಃ ।
ದರಹಾಸಾನನಾಮ್ಭೋಜದನ್ತಹೀರಾವಳಿದ್ಯುತಿಃ ॥ 49 ॥

ದರ್ವೀಕರಾಂಗತಭುಜೋ ದುರ್ವಾರೋ ದುಃಖದುರ್ಗಹಾ ।
ಧನಾಧಿಪಸಖೋ ಧೀರೋ ಧರ್ಮಾಧರ್ಮಪರಾಯಣಃ ॥ 50 ॥

ಧರ್ಮಧ್ವಜೋ ದಾನಶೌಂಡೋ ಧರ್ಮಕರ್ಮಫಲಪ್ರದಃ ।
ಪಶುಪಾಶಹಾರಃ ಶರ್ವಃ ಪರಮಾತ್ಮಾ ಸದಾಶಿವಃ ॥ 51 ॥

ಪರಾಪರಃ ಪರಶುಧೃತ್ ಪವಿತ್ರಃ ಸರ್ವಪಾವನಃ ।
ಫಲ್ಗುನಸ್ತುತಿಸನ್ತುಷ್ಟಃ ಫಲ್ಗುನಾಗ್ರಜವತ್ಸಲಃ ॥ 52 ॥

ಫಲ್ಗುನಾರ್ಜಿತಸಂಗ್ರಾಮಫಲಪಾಶುಪತಪ್ರದಃ ।
ಬಲೋ ಬಹುವಿಲಾಸಾಂಗೋ ಬಹುಲೀಲಾಧರೋ ಬಹುಃ ॥ 53 ॥

ಬರ್ಹಿರ್ಮುಖೋ ಸುರಾರಾಧ್ಯೋ ಬಲಿಬನ್ಧನಬಾನ್ಧವಃ ।
ಭಯಂಕರೋ ಭವಹರೋ ಭರ್ಗೋ ಭಯಹರೋ ಭವಃ ॥ 54 ॥

ಭಾಲಾನಲೋ ಬಹುಭುಜೋ ಭಾಸ್ವಾನ್ ಸದ್ಭಕ್ತವತ್ಸಲಃ ।
ಮನ್ತ್ರೋ ಮನ್ತ್ರಗಣೋ ಮನ್ತ್ರೀ ಮನ್ತ್ರಾರಾಧನತೋಷಿತಃ ॥ 55 ॥

ಮನ್ತ್ರಯಜ್ಞೋ ಮನ್ತ್ರವಾದೀ ಮನ್ತ್ರಬೀಜೋ ಮಹಾನ್ಮಹಃ ।
ಯನ್ತ್ರೋ ಯನ್ತ್ರಮಯೋ ಯನ್ತ್ರೀ ಯನ್ತ್ರಜ್ಞೋ ಯನ್ತ್ರವತ್ಸಲಃ ॥ 56 ॥

ಯನ್ತ್ರಪಾಲೋ ಯನ್ತ್ರಹರಸ್ತ್ರಿಜಗದ್ಯನ್ತ್ರವಾಹಕಃ ।
ರಜತಾದ್ರಿಸದಾವಾಸೋ ರವೀನ್ದುಶಿಖಿಲೋಚನಃ ॥ 57 ॥

ರತಿಶ್ರಾನ್ತೋ ಜಿತಶ್ರಾನ್ತೋ ರಜನೀಕರಶೇಖರಃ ।
ಲಲಿತೋ ಲಾಸ್ಯಸನ್ತುಷ್ಟೋ ಲಬ್ಧೋಗ್ರೋ ಲಘುಸಾಹಸಃ ॥ 58 ॥

ಲಕ್ಷ್ಮೀನಿಜಕರೋ ಲಕ್ಷ್ಯಲಕ್ಷಣಜ್ಞೋ ಲಸನ್ಮತಿಃ ।
ವರಿಷ್ಠೋ ವರದೋ ವನ್ದ್ಯೋ ವರದಾನಪರೋ ವಶೀ ॥ 59 ॥

ವೈಶ್ವಾನರಾಂಚಿತಭುಜೋ ವರೇಣ್ಯೋ ವಿಶ್ವತೋಮುಖಃ ।
ಶರಣಾರ್ತಿಹರಃ ಶಾನ್ತಃ ಶಂಕರಃ ಶಶಿಶೇಖರಃ ॥ 60 ॥

ಶರಭಃ ಶಮ್ಬರಾರಾತಿರ್ಭಸ್ಮೋದ್ಧೂಳಿತವಿಗ್ರಹಃ ।
ಷಟ್ತ್ರಿಂಶತ್ತತ್ತ್ವವಿದ್ರೂಪಃ ಷಣ್ಮುಖಸ್ತುತಿತೋಷಣಃ ॥ 61 ॥

ಷಡಕ್ಷರಃ ಶಕ್ತಿಯುತಃ ಷಟ್ಪದಾದ್ಯರ್ಥಕೋವಿದಃ ।
ಸರ್ವಜ್ಞಃ ಸರ್ವಸರ್ವೇಶಃ ಸರ್ವದಾಽಽನನ್ದಕಾರಕಃ ॥ 62 ॥

ಸರ್ವವಿತ್ಸರ್ವಕೃತ್ಸರ್ವಃ ಸರ್ವದಃ ಸರ್ವತೋಮುಖಃ ।
ಹರಃ ಪರಮಕಲ್ಯಾಣೋ ಹರಿಚರ್ಮಧರಃ ಪರಃ ॥ 63 ॥

ಹರಿಣಾರ್ಧಕರೋ ಹಂಸೋ ಹರಿಕೋಟಿಸಮಪ್ರಭಃ ।
ದೇವದೇವೋ ಜಗನ್ನಾಥೋ ದೇವೇಶೋ ದೇವವಲ್ಲಭಃ ॥ 64 ॥

ದೇವಮೌಲಿಶಿಖಾರತ್ನಂ ದೇವಾಸುರಸುತೋಷಿತಃ ।
ಸುರೂಪಃ ಸುವ್ರತಃ ಶುದ್ಧಸ್ಸುಕರ್ಮಾ ಸುಸ್ಥಿರಃ ಸುಧೀಃ ॥ 65 ॥

ಸುರೋತ್ತಮಃ ಸುಫಲದಃ ಸುರಚಿನ್ತಾಮಣಿಃ ಶುಭಃ ।
ಕುಶಲೀ ವಿಕ್ರಮಸ್ತರ್ಕ್ಕಃ ಕುಂಡಲೀಕೃತಕುಂಡಲೀ ॥ 66 ॥

ಖಂಡೇನ್ದುಕಾರಕಜಟಾಜೂಟಃ ಕಾಲಾನಲದ್ಯುತಿಃ ।
ವ್ಯಾಘ್ರಚರ್ಮಾಮ್ಬರಧರೋ ವ್ಯಾಘ್ರೋಗ್ರಬಹುಸಾಹಸಃ ॥ 67 ॥

ವ್ಯಾಳೋಪವೀತೀ ವಿಲಸಚ್ಛೋಣತಾಮರಸಾಮ್ಬಕಃ ।
ದ್ಯುಮಣಿಸ್ತರಣಿರ್ವಾಯುಃ ಸಲಿಲಂ ವ್ಯೋಮ ಪಾವಕಃ ॥ 68 ॥

ಸುಧಾಕರೋ ಯಜ್ಞಪತಿರಷ್ಟಮೂರ್ತಿಃ ಕೃಪಾನಿಧಿಃ ।
ಚಿದ್ರೂಪಶ್ಚಿದ್ಘನಾನನ್ದಕನ್ದಶ್ಚಿನ್ಮಯನಿಷ್ಕಲಃ ॥ 69 ॥

ನಿರ್ದ್ವನ್ದ್ವೋ ನಿಷ್ಪ್ರಭೋ ನಿತ್ಯೋ ನಿರ್ಗುಣೋ ನಿರ್ಗತಾಮಯಃ ।
ವ್ಯೋಮಕೇಶೋ ವಿರೂಪಾಕ್ಷೋ ವಾಮದೇವೋ ನಿರಂಜನಃ ॥ 70 ॥

ನಾಮರೂಪಃ ಶಮಧುರಃ ಕಾಮಚಾರೀ ಕಲಾಧರಃ ।
ಜಾಮ್ಬೂನದಪ್ರಭೋ ಜಾಗ್ರಜ್ಜನ್ಮಾದಿರಹಿತೋಜ್ಜ್ವಲಃ ॥ 71 ॥

ಜನಕಃ ಸರ್ವಜನ್ತೂನಾಂ ಜನ್ಮದುಃಖಾಪನೋದನಃ ।
ಪಿನಾಕಪಾಣಿರಕ್ರೋಧಃ ಪಿಂಗಲಾಯತಲೋಚನಃ ॥ 72 ॥

ಪರಮಾತ್ಮಾ ಪಶೂಪತಿಃ ಪಾವನಃ ಪ್ರಮಥಾಧಿಪಃ ।
ಪ್ರಣವಃ ಕಾಮದಃ ಕಾನ್ತಃ ಶ್ರೀಪ್ರದೋ ದಿವ್ಯಲೋಚನಃ ॥ 73 ॥

ಪ್ರಣತಾರ್ತಿಹರಃ ಪ್ರಾಣಃ ಪರಂಜ್ಯೋತಿಃ ಪರಾತ್ಪರಃ ।
ತುಷ್ಟಸ್ತುಹಿನಶೈಲಾಧಿವಾಸಃ ಸ್ತೋತೃವರಪ್ರದಃ ॥ 74 ॥

ಇಷ್ಟಕಾಮ್ಯಾರ್ಥಫಲದಃ ಸೃಷ್ಟಿಕರ್ತಾ ಮರುತ್ಪತಿಃ ।
ಭೃಗ್ವತ್ರಿಕಣ್ವಜಾಬಾಲಿ ಹೃತ್ಪದ್ಮಾಹಿಮದೀಧಿತಿಃ ॥ 75 ॥

ಕ್ರತುಧ್ವಂಸೀ ಕ್ರತುಮುಖಃ ಕ್ರತುಕೋಟಿಫಲಪ್ರದಃ ।
ಕ್ರತುಃ ಕ್ರತುಮಯಃ ಕ್ರೂರದರ್ಪಘ್ನೋ ವಿಕ್ರಮೋ ವಿಭುಃ ॥ 76 ॥

ದಧೀಚಿಹೃದಯಾನನ್ದೋ ದಧೀಚ್ಯಾದಿಸುಪಾಲಕಃ ।
ದಧೀಚಿವಾಂಛಿತಸಖೋ ದಧೀಚಿವರದೋಽನಘಃ ॥ 77 ॥

ಸತ್ಪಥಕ್ರಮವಿನ್ಯಾಸೋ ಜಟಾಮಂಡಲಮಂಡಿತಃ ।
ಸಾಕ್ಷಿತ್ರಯೀಮಯಶ್ಚಾರುಕಲಾಧರಕಪರ್ದಭೃತ್ ॥ 78 ॥

ಮಾರ್ಕಂಡೇಯಮುನಿಪ್ರೀತೋ ಮೃಡೋ ಜಿತಪರೇತರಾಟ್ ।
ಮಹೀರಥೋ ವೇದಹಯಃ ಕಮಲಾಸನಸಾರಥಿಃ ॥ 79 ॥

ಕೌಂಡಿನ್ಯವತ್ಸವಾತ್ಸಲ್ಯಃ ಕಾಶ್ಯಪೋದಯದರ್ಪಣಃ ।
ಕಣ್ವಕೌಶಿಕದುರ್ವಾಸಾಹೃದ್ಗುಹಾನ್ತರ್ನಿಧಿರ್ನಿಜಃ ॥ 80 ॥

ಕಪಿಲಾರಾಧನಪ್ರೀತಃ ಕರ್ಪೂರಧವಲದ್ಯುತಿಃ ।
ಕರುಣಾವರುಣಃ ಕಾಳೀನಯನೋತ್ಸವಸಂಗರಃ ॥ 81 ॥

ಘೃಣೈಕನಿಲಯೋ ಗೂಢತನುರ್ಮುರಹರಪ್ರಿಯಃ ।
ಗಣಾಧಿಪೋ ಗುಣನಿಧಿರ್ಗಮ್ಭೀರಾಂಚಿತ ವಾಕ್ಪತಿಃ ॥ 82 ॥

ವಿಘ್ನನಾಶೋ ವಿಶಾಲಾಕ್ಷೋ ವಿಘ್ನರಾಜೋ ವಿಶೇಷವಿತ್ ।
ಸಪ್ತಯಜ್ಞಯಜಃ ಸಪ್ತಜಿಹ್ವಾ ಜಿಹ್ವಾತಿಸಂವರಃ ॥ 83 ॥

ಅಸ್ಥಿಮಾಲಾಽಽವಿಲಶಿರೋ ವಿಸ್ತಾರಿತಜಗದ್ಭುಜಃ ।
ನ್ಯಸ್ತಾಖಿಲಸ್ರಜಸ್ತೋಕವಿಭವಃ ಪ್ರಭುರೀಶ್ವರಃ ॥ 84 ॥

ಭೂತೇಶೋ ಭುವನಾಧಾರೋ ಭೂತಿದೋ ಭೂತಿಭೂಷಣಃ ।
ಭೂತಾತ್ಮಕಾತ್ಮಕೋ ಭೂರ್ಭುವಾದಿ ಕ್ಷೇಮಕರಃ ಶಿವಃ ॥ 85 ॥

ಅಣೋರಣೀಯಾನ್ಮಹತೋ ಮಹೀಯಾನ್ ವಾಗಗೋಚರಃ ।
ಅನೇಕವೇದವೇದಾನ್ತತತ್ತ್ವಬೀಜಸ್ತಪೋನಿಧಿಃ ॥ 86 ॥

ಮಹಾವನವಿಲಾಸೋಽತಿಪುಣ್ಯನಾಮಾ ಸದಾಶುಚಿಃ ।
ಮಹಿಷಾಸುರಮರ್ದಿನ್ಯಾ ನಯನೋತ್ಸವಸಂಗರಃ ॥ 87 ॥

ಶಿತಿಕಂಠಃ ಶಿಲಾದಾದಿ ಮಹರ್ಷಿನತಿಭಾಜನಃ ।
ಗಿರಿಶೋ ಗೀಷ್ಪತಿರ್ಗೀತವಾದ್ಯನೃತ್ಯಸ್ತುತಿಪ್ರಿಯಃ ॥ 88 ॥

ಅಂಗೀಕೃತಃ ಸುಕೃತಿಭಿಃ ಶೃಂಗಾರರಸಜನ್ಮಭೂಃ ।
ಭೃಂಗೀತಾಂಡವಸನ್ತುಷ್ಠೋ ಮಂಗಲೋ ಮಂಗಲಪ್ರದಃ ॥ 89 ॥

ಮುಕ್ತೇನ್ದ್ರನೀಲತಾಟಂಕೋ ಮುಕ್ತಾಹಾರವಿಭೂಷಿತಃ ।
ಸಕ್ತಸಜ್ಜನಸದ್ಭಾವೋ ಭುಕ್ತಿಮುಕ್ತಿಫಲಪ್ರದಃ ॥ 90 ॥

ಸುರೂಪಃ ಸುನ್ದರಃ ಶುಕ್ಲಧರ್ಮಃ ಸುಕೃತವಿಗ್ರಹಃ ।
ಜಿತಾಮರದ್ರುಮಃ ಸರ್ವದೇವರಾಡಸಮೇಕ್ಷಣಃ ॥ 91 ॥

ದಿವಸ್ಪತಿಸಹಸ್ರಾಕ್ಷವೀಕ್ಷಣಾವಳಿತೋಷಕಃ ।
ದಿವ್ಯನಾಮಾಮೃತರಸೋ ದಿವಾಕರಪತಿಃ ಪ್ರಭುಃ ॥ 92 ॥

ಪಾವಕಪ್ರಾಣಸನ್ಮಿತ್ರಂ ಪ್ರಖ್ಯಾತೋರ್ಧ್ವಜ್ವಲನ್ಮಹಃ ।
ಪ್ರಕೃಷ್ಟಭಾನುಃ ಪುರುಷಃ ಪುರೋಡಾಶಭುಗೀಶ್ವರಃ ॥ 93 ॥

ಸಮವರ್ತೀ ಪಿತೃಪತಿರ್ಧರ್ಮರಾಟ್ಶಮನೋ ಯಮೀ ।
ಪಿತೃಕಾನನಸನ್ತುಷ್ಟೋ ಭೂತನಾಯಕನಾಯಕಃ ॥ 94 ॥

ನಯಾನ್ವಿತಃ ಸುರಪತಿರ್ನಾನಾಪುಣ್ಯಜನಾಶ್ರಯಃ ।
ನೈರೃತ್ಯಾದಿ ಮಹಾರಾಕ್ಷಸೇನ್ದ್ರಸ್ತುತಯಶೋಽಮ್ಬುಧಿಃ ॥ 95 ॥

ಪ್ರಚೇತಾಜೀವನಪತಿರ್ಧೃತಪಾಶೋ ದಿಗೀಶ್ವರಃ ।
ಧೀರೋದಾರಗುಣಾಮ್ಭೋಧಿಕೌಸ್ತುಭೋ ಭುವನೇಶ್ವರಃ ॥ 96 ॥

ಸದಾನುಭೋಗಸಮ್ಪೂರ್ಣಸೌಹಾರ್ದಃ ಸುಮನೋಜ್ಜ್ವಲಃ ।
ಸದಾಗತಿಃ ಸಾರರಸಃ ಸಜಗತ್ಪ್ರಾಣಜೀವನಃ ॥ 97 ॥

ರಾಜರಾಜಃ ಕಿನ್ನರೇಶಃ ಕೈಲಾಸಸ್ಥೋ ಧನಪ್ರದಃ ।
ಯಕ್ಷೇಶ್ವರಸಖಃ ಕುಕ್ಷಿನಿಕ್ಷಿಪ್ತಾನೇಕವಿಸ್ಮಯಃ ॥ 98 ॥

ಈಶಾನಃ ಸರ್ವವಿದ್ಯಾನಾಮೀಶ್ವರೋ ವೃಷಲಾಂಛನಃ ।
ಇನ್ದ್ರಾದಿದೇವವಿಲಸನ್ಮೌಲಿರಮ್ಯಪದಾಮ್ಬುಜಃ ॥ 99 ॥

ವಿಶ್ವಕರ್ಮಾಽಽಶ್ರಯೋ ವಿಶ್ವತೋಬಾಹುರ್ವಿಶ್ವತೋಮುಖಃ ।
ವಿಶ್ವತಃ ಪ್ರಮದೋ ವಿಶ್ವನೇತ್ರೋ ವಿಶ್ವೇಶ್ವರೋ ವಿಭುಃ ॥ 100 ॥

ಸಿದ್ಧಾನ್ತಃ ಸಿದ್ಧಸಂಕಲ್ಪಃ ಸಿದ್ಧಗನ್ಧರ್ವಸೇವಿತಃ ।
ಸಿದ್ಧಿತಃ ಶುದ್ಧಹೃದಯಃ ಸದ್ಯೋಜಾತಾನನಶ್ಶಿವಃ ॥ 101 ॥

ಶ್ರೀಮಯಃ ಶ್ರೀಕಟಾಕ್ಷಾಂಗಃ ಶ್ರಿನಾಮಾ ಶ್ರೀಗಣೇಶ್ವರಃ ।
ಶ್ರೀದಃ ಶ್ರೀವಾಮದೇವಾಸ್ಯಃ ಶ್ರೀಕಂಠಃ ಶ್ರೀಪ್ರಿಯಂಕರಃ ॥ 102 ॥

ಘೋರಾಘಧ್ವಾನ್ತಮಾರ್ತಾಂಡೋ ಘೋರೇತರಫಲಪ್ರದಃ ।
ಘೋರಘೋರಮಹಾಯನ್ತ್ರರಾಜೋ ಘೋರಮುಖಾಮ್ಬುಜಃ ॥ 103 ॥

ತತಃ ಸುಷಿರ ಸುಪ್ರೀತ ತತ್ತ್ವಾದ್ಯಾಗಮಜನ್ಮಭೂಃ ।
ತತ್ತ್ವಮಸ್ಯಾದಿ ವಾಕ್ಯಾರ್ಥಸ್ತತ್ಪೂರ್ವಮುಖಮಂಡಿತಃ ॥ 104 ॥

ಆಶಾಪಾಶವಿನಿರ್ಮುಕ್ತಃ ಶೇಷಭೂಷಣಭೂಷಿತಃ ।
ದೋಷಾಕರಲಸನ್ಮೌಲಿರೀಶಾನಮುಖನಿರ್ಮಲಃ ॥ 105 ॥

ಪಂಚವಕ್ತ್ರೋ ದಶಭುಜಃ ಪಂಚಾಶದ್ವರ್ಣನಾಯಕಃ ।
ಪಂಚಾಕ್ಷರಯುತಃ ಪಂಚಃ ಪಂಚ ಪಂಚ ಸುಲೋಚನಃ ॥ 106 ॥

ವರ್ಣಾಶ್ರಮಗುರುಃ ಸರ್ವವರ್ಣಾಧಾರಃ ಪ್ರಿಯಂಕರಃ ।
ಕರ್ಣಿಕಾರಾರ್ಕ ದುತ್ತೂರ ಪೂರ್ಣಪೂಜಾಫಲಪ್ರದಃ ॥ 107 ॥

ಯೋಗೀನ್ದ್ರಹೃದಯಾನನ್ದೋ ಯೋಗೀ ಯೋಗವಿದಾಂ ವರಃ ।
ಯೋಗಧ್ಯಾನಾದಿಸನ್ತುಷ್ಟೋ ರಾಗಾದಿರಹಿತೋ ರಮಃ ॥ 108 ॥

ಭವಾಮ್ಭೋಧಿಪ್ಲವೋ ಬನ್ಧಮೋಚಕೋ ಭದ್ರದಾಯಕಃ ।
ಭಕ್ತಾನುರಕ್ತೋ ಭವ್ಯಃ ಸದ್ಭಕ್ತಿದೋ ಭಕ್ತಿಭಾವನಃ ॥ 109 ॥

ಅನಾದಿನಿಧನೋಽಭೀಷ್ಟೋ ಭೀಮಕಾನ್ತೋಽರ್ಜುನೋ ಬಲಃ ।
ಅನಿರುದ್ಧಃ ಸತ್ಯವಾದೀ ಸದಾನನ್ದಾಶ್ರಯೋಽನಘಃ ॥ 110 ॥

ಆಲಯಃ ಸರ್ವವಿದ್ಯಾನಾಮಾಧಾರಃ ಸರ್ವಕರ್ಮಣಾಮ್ ।
ಆಲೋಕಃ ಸರ್ವಲೋಕಾನಾಮಾವಿರ್ಭಾವೋ ಮಹಾತ್ಮನಾಮ್ ॥ 111 ॥

ಇಜ್ಯಾಪೂರ್ತೇಷ್ಟಫಲದಃ ಇಚ್ಛಾಶಕ್ತ್ಯಾದಿ ಸಂಶ್ರಯಃ ।
ಇನಃ ಸರ್ವಾಮರಾರಾಧ್ಯ ಈಶ್ವರೋ ಜಗದೀಶ್ವರಃ ॥ 112 ॥

ರುಂಡಪಿಂಗಲಮಧ್ಯಸ್ಥೋ ರುದ್ರಾಕ್ಷಾಂಚಿತಕನ್ಧರಃ ।
ರುಂಡಿತಾಧಾರಭಕ್ತ್ಯಾದಿರೀಡಿತಃ ಸವನಾಶನಃ ॥ 113 ॥

ಉರುವಿಕ್ರಮಬಾಹುಲ್ಯ ಉರ್ವ್ಯಾಧಾರೋ ಧುರನ್ಧರಃ ।
ಉತ್ತರೋತ್ತರಕಲ್ಯಾಣ ಉತ್ತಮೋತ್ತಮನಾಯಕಃ ॥ 114 ॥

ಊರುಜಾನುತಡಿದ್ವೃನ್ದ ಊರ್ಧ್ವರೇತಾ ಮನೋಹರಃ ।
ಊಹಿತಾನೇಕವಿಭವ ಊಹಿತಾಮ್ನಾಯಮಂಡಲಃ ॥ 115 ॥

ಋಷೀಶ್ವರಸ್ತುತಿಪ್ರೀತೋ ಋಷಿವಾಕ್ಯಪ್ರತಿಷ್ಠಿತಃ ।
ೠಗಾದಿ ನಿಗಮಾಧಾರೋ ಋಜುಕರ್ಮಾ ಮನೋಜವಃ ॥ 116 ॥

ರೂಪಾದಿ ವಿಷಯಾಧಾರೋ ರೂಪಾತೀತೋ ಋಷೀಶ್ವರಃ ।
ರೂಪಲಾವಣ್ಯಸಮ್ಯುಕ್ತೋ ರೂಪಾನನ್ದಸ್ವರೂಪಧೃತ್ ॥ 117 ॥

ಲುಲಿತಾನೇಕಸಂಗ್ರಾಮೋ ಲುಪ್ಯಮಾನರಿಪುವ್ರಜಃ ।
ಲುಪ್ತಕ್ರೂರಾನ್ಧಕೋ ವಾರೋ ಲೂಕಾರಾಂಚಿತಯನ್ತ್ರಧೃತ್ ॥ 118 ॥

ಲೂಕಾರಾದಿ ವ್ಯಾಧಿಹರೋ ಲೂಸ್ವರಾಂಚಿತಯನ್ತ್ರಯುಕ್ ।
ಲೂಶಾದಿ ಗಿರಿಶಃ ಪಕ್ಷಃ ಖಲವಾಚಾಮಗೋಚರಃ ॥ 119 ॥

ಏಷ್ಯಮಾಣೋ ನತಜನ ಏಕಚ್ಚಿತೋ ದೃಢವ್ರತಃ ।
ಏಕಾಕ್ಷರಮಹಾಬೀಜ ಏಕರುದ್ರೋಽದ್ವಿತೀಯಕಃ ॥ 120 ॥

ಐಶ್ವರ್ಯವರ್ಣನಾಮಾಂಗ ಐಶ್ವರ್ಯಪ್ರಕರೋಜ್ಜ್ವಲಃ ।
ಐರಾವಣಾದಿ ಲಕ್ಷ್ಮೀಶ ಐಹಿಕಾಮುಷ್ಮಿಕಪ್ರದಃ ॥ 121 ॥

ಓಷಧೀಶಶಿಖಾರತ್ನ ಓಂಕಾರಾಕ್ಷರಸಮ್ಯುತಃ ।
ಓಕಃ ಸಕಲದೇವಾನಾಮೋಜೋರಾಶಿರಜಾದ್ಯಜಃ ॥ 122 ॥

ಔದಾರ್ಯಜೀವನಪರ ಔಚಿತ್ಯಮಣಿಜನ್ಮಭೂಃ ।
ಉದಾಸೀನೈಕಗಿರಿಶ ಉತ್ಸವೋತ್ಸವಕಾರಣೌ ॥ 123 ॥

ಅಂಗೀಕೃತಷಡಂಗಾಂಗ ಅಂಗಹಾರಮಹಾನಟಃ ।
ಅಂಗಜಾಂಗಜಭಸ್ಮಾಂಗೋ ಮಂಗಲಾಯತವಿಗ್ರಹಃ ॥ 124 ॥

ಕಃ ಕಿಂ ತ್ವದನು ದೇವೇಶಃ ಕಃ ಕಿನ್ನು ವರದಪ್ರದಃ ।
ಕಃ ಕಿನ್ನು ಭಕ್ತಸನ್ತಾಪಹರಃ ಕಾರುಣ್ಯಸಾಗರಃ ॥ 125 ॥

ಸ್ತೋತವ್ಯಃ ಸ್ತೋತುಮಿಚ್ಛೂನಾಂ ಮನ್ತವ್ಯಃ ಶರಣಾರ್ಥಿನಾಮ್ ।
ಧ್ಯೇಯೋ ಧ್ಯಾನೈಕನಿಷ್ಠಾನಾಂ ಧಾಮ್ನಃ ಪರಮಪೂರಕಃ ॥ 126 ॥

ಭಗನೇತ್ರಹರಃ ಪೂತಃ ಸಾಧುದೂಷಕಭೂಷಣಃ ।
ಭದ್ರಕಾಳಿಮನೋರಾಜೋ ಹಂಸಃ ಸತ್ಕರ್ಮಸಾರಥಿಃ ॥ 127 ॥

ಸಭ್ಯಃ ಸಾಧುಃ ಸಭಾರತ್ನಂ ಸೌನ್ದರ್ಯಗಿರಿಶೇಖರಃ ।
ಸುಕುಮಾರಃ ಸೌಖ್ಯಕರಃ ಸಹಿಷ್ಣುಃ ಸಾಧ್ಯಸಾಧನಮ್ ॥ 128 ॥

ನಿರ್ಮತ್ಸರೋ ನಿಷ್ಪ್ರಪಂಚೋ ನಿರ್ಲೋಭೋ ನಿರ್ಗುಣೋ ನಯಃ ।
ವೀತಾಭಿಮಾನೋ ನಿರ್ಜಾತೋ ನಿರಾತಂಕೋ ನಿರಂಜನಃ ॥ 129 ॥

ಕಾಲತ್ರಯಃ ಕಲಿಹರೋ ನೇತ್ರತ್ರಯವಿರಾಜಿತಃ ।
ಅಗ್ನಿತ್ರಯನಿಭಾಂಗಶ್ಚ ಭಸ್ಮೀಕೃತಪುರತ್ರಯಃ ॥ 130 ॥

ಕೃತಕಾರ್ಯೋ ವ್ರತಧರೋ ವ್ರತನಾಶಃ ಪ್ರತಾಪವಾನ್ ।
ನಿರಸ್ತದುರ್ವಿಧಿರ್ನಿರ್ಗತಾಶೋ ನಿರ್ವಾಣನೀರಧಿಃ ॥ 131 ॥

ನಿಧಾನಂ ಸರ್ವಹೇತೂನಾಂ ನಿಶ್ಚಿತಾರ್ಥೇಶ್ವರೇಶ್ವರಃ ।
ಅದ್ವೈತಶಾಮ್ಭವಮಹೋ ಸನಿರ್ವ್ಯಾಜೋರ್ಧ್ವಲೋಚನಃ ॥ 132 ॥

ಅಪೂರ್ವಪೂರ್ವಃ ಪರಮಃ ಸಪೂರ್ವಃ ಪೂರ್ವಪೂರ್ವದಿಕ್ ।
ಅತೀನ್ದ್ರಿಯಃ ಸತ್ಯನಿಧಿರಖಂಡಾನನ್ದವಿಗ್ರಹಃ ॥ 133 ॥

ಆದಿದೇವಃ ಪ್ರಸನ್ನಾತ್ಮಾ ಆರಾಧಕಜನೇಷ್ಟದಃ ।
ಸರ್ವದೇವಮಯಃ ಸರ್ವಃ ಜಗದ್ವ್ಯಾಸಃ ಸುಲಕ್ಷಣಃ ॥ 134 ॥

ಸರ್ವಾನ್ತರಾತ್ಮಾ ಸದೃಶಃ ಸರ್ವಲೋಕೈಕಪೂಜಿತಃ ।
ಪುರಾಣಪುರುಷಃ ಪುಣ್ಯಃ ಪುಣ್ಯಶ್ಲೋಕಃ ಸುಧಾಮಯಃ ॥ 135 ॥

ಪೂರ್ವಾಪರಜ್ಞಃ ಪುರಜಿತ್ ಪೂರ್ವದೇವಾಮರಾರ್ಚಿತಃ ।
ಪ್ರಸನ್ನದರ್ಶಿತಮುಖಃ ಪನ್ನಗಾವಳಿಭೂಷಣಃ ॥ 136 ॥

ಪ್ರಸಿದ್ಧಃ ಪ್ರಣತಾಧಾರಃ ಪ್ರಲಯೋದ್ಭೂತಕಾರಣಮ್ ।
ಜ್ಯೋತಿರ್ಮಯೋ ಜ್ವಲದ್ದಂಷ್ಟ್ರೋ ಜ್ಯೋತಿರ್ಮಾಲಾವಳೀವೃತಃ ॥ 137 ॥

ಜಾಜ್ಜ್ವಲ್ಯಮಾನೋ ಜ್ವಲನನೇತ್ರೋ ಜಲಧರದ್ಯುತಿಃ ।
ಕೃಪಾಮ್ಭೋರಾಶೀರಮ್ಲಾನೋ ವಾಕ್ಯಪುಷ್ಟೋಽಪರಾಜಿತಃ ॥ 138 ॥

ಕ್ಷಪಾಕರಾರ್ಕಕೋಟಿಪ್ರಭಾಕರಃ ಕರುಣಾಕರಃ ।
ಏಕಮೂರ್ತಿಸ್ತ್ರಿಧಾಮೂರ್ತಿರ್ದಿವ್ಯಮೂರ್ತಿರನಾಕುಲಃ ॥ 139 ॥

ಅನನ್ತಮೂರ್ತಿರಕ್ಷೋಭ್ಯಃ ಕೃಪಾಮೂರ್ತಿಃ ಸುಕೀರ್ತಿಧೃತ್ ।
ಅಕಲ್ಪಿತಾಮರತರುರಕಾಮಿತಸುಕಾಮಧುಕ್ ॥ 140 ॥

ಅಚಿನ್ತಿತಮಹಾಚಿನ್ತಾಮಣಿರ್ದೇವಶಿಖಾಮಣಿಃ ।
ಅತೀನ್ದ್ರಿಯೋಽಜಿತಃ ಪ್ರಾಂಶುರ್ಬ್ರಹ್ಮವಿಷ್ಣ್ವಾದಿವನ್ದಿತಃ ॥ 141 ॥

ಹಂಸೋ ಮರೀಚಿರ್ಭೀಮಶ್ಚ ರತ್ನಸಾನುಶರಾಸನಃ ।
ಸಮ್ಭವೋಽತೀನ್ದ್ರಿಯೋ ವೈದ್ಯೋ ವಿಶ್ವರೂಪೀ ನಿರಂಜನಃ ॥ 142 ॥

ವಸುದಃ ಸುಭುಜೋ ನೈಕಮಾಯೋಽವ್ಯಯಃ ಪ್ರಮಾದನಃ ।
ಅಗದೋ ರೋಗಹರ್ತಾ ಚ ಶರಾಸನವಿಶಾರದಃ ॥ 143 ॥

ಮಾಯಾವಿಶ್ವಾದನೋ ವ್ಯಾಪೀ ಪಿನಾಕಕರಸಮ್ಭವಃ ।
ಮನೋವೇಗೋ ಮನೋರುಪೀ ಪೂರ್ಣಃ ಪುರುಷಪುಂಗವಃ ॥ 144 ॥

ಶಬ್ದಾದಿಗೋ ಗಭೀರಾತ್ಮಾ ಕೋಮಲಾಂಗಃ ಪ್ರಜಾಗರಃ ।
ತ್ರಿಕಾಲಜ್ಞೋ ಮುನಿಃ ಸಾಕ್ಷೀ ಪಾಪಾರಿಃ ಸೇವಕಪ್ರಿಯಃ ॥ 145 ॥

ಉತ್ತಮಃ ಸಾತ್ತ್ವಿಕಃ ಸತ್ಯಃ ಸತ್ಯಸನ್ಧೋ ನಿರಾಕುಲಃ ।
ರಸೋ ರಸಜ್ಞೋ ಸಾರಜ್ಞೋ ಲೋಕಸಾರೋ ರಸಾತ್ಮಕಃ ॥ 146 ॥

ಪೂಷಾದನ್ತಭಿದವ್ಯಗ್ರೋ ದಕ್ಷಯಜ್ಞನಿಷೂದನಃ ।
ದೇವಾಗ್ರಣೀಃ ಶಿವಧ್ಯಾನತತ್ಪರಃ ಪರಮಃ ಶುಭಃ ॥ 147 ॥

ಜಯೋ ಜಯಾದಿಃ ಸರ್ವಾಘಶಮನೋ ಭವಭಂಜನಃ ।
ಅಲಂಕರಿಷ್ಣುರಚಲೋ ರೋಚಿಷ್ಣುರ್ವಿಕ್ರಮೋತ್ತಮಃ ॥ 148 ॥

ಶಬ್ದಗಃ ಪ್ರಣವೋ ವಾಯುರಂಶುಮಾನನಿಲತಾಪಹೃತ್ । ವಾಯುರಂಶುಮಾನನಲ
ನಿರೀಶೋ ನಿರ್ವಿಕಲ್ಪಶ್ಚ ಚಿದ್ರೂಪೋ ಜಿತಸಾಧ್ವಸಃ ॥ 149 ॥

ಉತ್ತಾರಣೋ ದುಷ್ಕೃತಿಹಾ ದುರ್ಧರ್ಷೋ ದುಸ್ಸಹೋಽಭಯಃ ।
ನಕ್ಷತ್ರಮಾಲೀ ನಾಕೇಶಃ ಸ್ವಾಧಿಷ್ಠಾನಷಡಾಶ್ರಯಃ ॥ 150 ॥

ಅಕಾಯೋ ಭಕ್ತಕಾಯಸ್ಥಃ ಕಾಲಜ್ಞಾನೀ ಮಹಾನಟಃ ।
ಅಂಶುಃ ಶಬ್ದಪತಿರ್ಯೋಗೀ ಪವನಃ ಶಿಖಿಸಾರಥಿಃ ॥ 151 ॥

ವಸನ್ತೋ ಮಾಧವೋ ಗ್ರೀಷ್ಮಃ ಪವನಃ ಪಾವನೋಽಮಲಃ ।
ವಾರುರ್ವಿಶಲ್ಯಚತುರಃ ಶಿವಚತ್ವರಸಂಸ್ಥಿತಃ ॥ 152 ॥

ಆತ್ಮಯೋಗಃ ಸಮಾಮ್ನಾಯತೀರ್ಥದೇಹಃ ಶಿವಾಲಯಃ ।
ಮುಂಡೋ ವಿರೂಪೋ ವಿಕೃತಿರ್ದಂಡೋ ದಾನ್ತೋ ಗುಣೋತ್ತಮಃ ॥ 153 ॥

ದೇವಾಸುರಗುರುರ್ದೇವೋ ದೇವಾಸುರನಮಸ್ಕೃತಃ ।
ದೇವಾಸುರಮಹಾಮನ್ತ್ರೋ ದೇವಾಸುರಮಹಾಶ್ರಯಃ ॥ 154 ॥

ದಿವೋಽಚಿನ್ತ್ಯೋ ದೇವತಾಽಽತ್ಮಾ ಈಶೋಽನೀಶೋ ನಗಾಗ್ರಗಃ ।
ನನ್ದೀಶ್ವರೋ ನನ್ದಿಸಖೋ ನನ್ದಿಸ್ತುತಪರಾಕ್ರಮಃ ॥ 155 ॥

ನಗ್ನೋ ನಗವ್ರತಧರಃ ಪ್ರಲಯಾಕಾರರೂಪಧೃತ್ ।
ಸೇಶ್ವರಃ ಸ್ವರ್ಗದಃ ಸ್ವರ್ಗಃ ಸ್ವರಃ ಸರ್ವಮಯಃ ಸ್ವನಃ ॥ 156 ॥

ಬೀಜಾಧ್ಯಕ್ಷೋ ಬೀಜಕರ್ತಾ ಧರ್ಮಕೃದ್ಧರ್ಮವರ್ಧನಃ ।
ದಕ್ಷಯಜ್ಞಮಹಾದ್ವೇಷೀ ವಿಷ್ಣುಕನ್ಧರಪಾತನಃ ॥ 157 ॥

ಧೂರ್ಜಟಿಃ ಖಂಡಪರಶುಃ ಸಕಲೋ ನಿಷ್ಕಲೋಽಸಮಃ ।
ಮೃಡೋ ನಟಃ ಪೂರಯಿತಾ ಪುಣ್ಯಕ್ರೂರೋ ಮನೋಜವಃ ॥ 158 ॥

ಸದ್ಭೂತಃ ಸತ್ಕೃತಃ ಶಾನ್ತಃ ಕಾಲಕೂಟೋ ಮಹಾನಘಃ ।
ಅರ್ಥಾನರ್ಥೋ ಮಹಾಕಾಯೋ ನೈಕಕರ್ಮಸಮಂಜಸಃ ॥ 159 ॥

ಭೂಶಯೋ ಭೂಷಣೋ ಭೂತಿರ್ಭೂಷಣೋ ಭೂತವಾಹನಃ ।
ಶಿಖಂಡೀ ಕವಚೀ ಶೂಲೀ ಜಟೀ ಮುಂಡೀ ಚ ಕುಂಡಲೀ ॥ 160 ॥

ಮೇಖಲೀ ಮುಸಲೀ ಖಡ್ಗೀ ಕಂಕಣೀಕೃತವಾಸುಕಿಃ ॥ 161 ॥

ಉತ್ತರಭಾಗಮ್ ।
ಏತತ್ಸಹಸ್ರನಾಮಾಂಕಂ ವೀರಭದ್ರಸ್ಯ ಕೀರ್ತನಮ್ ।
ಏಕೈಕಾಕ್ಷರಮಾಹಾತ್ಮ್ಯಂ ಮಹಾಪಾತಕನಾಶನಮ್ ॥ 162 ॥

ಮಹಾವ್ಯಾಧಿಹರಂ ಮೃತ್ಯುದಾರಿದ್ರ್ಯತಿಮಿರಾಂಜನಮ್ ।
ಮಹಾಸಂಸಾರಜಲಧಿಮಗ್ನೋತ್ತಾರಣನಾವಿಕಃ ॥ 163
ಧರ್ಮಾರ್ಥಕಾಮಮೋಕ್ಷಾಣಾಂ ನಿಜಗೇಹಂ ನಿರರ್ಗಲಮ್ ।
ಕರ್ಮಭಕ್ತಿಚಿದಾನನ್ದಂ ಕನ್ದಕಾರಣಕನ್ದಕಮ್ ॥ 164 ॥

ರಸಂ ರಸಾಯನಂ ದಿವ್ಯಂ ನಾಮಾಮೃತರಸಂ ನರಃ ।
ಶೃಣುಯಾದ್ಯಃ ಸ್ಮರನ್ಯೋಽಪಿ ಸರ್ವಪಾಪೈಃ ಪ್ರಮುಚ್ಯತೇ ॥ 165 ॥

ಅಗ್ನಿಷ್ಟೋಮಸ್ಯ ಯಜ್ಞಸ್ಯ ವಾಜಪೇಯಶತಸ್ಯ ಚ ।
ಕನ್ಯಾದಾನಸಹಸ್ರಸ್ಯ ಯತ್ಫಲಂ ಲಭತೇ ನರಃ ॥ 166 ॥

ತತ್ಫಲಂಕೋಟಿಗುಣಿತಂ ನಾಮೈಕಸ್ಯ ಸಕೃಜ್ಜಪಾತ್ ।
ಆಯುರಾರೋಗ್ಯಸೌಭಾಗ್ಯಂ ಪುತ್ರಪೌತ್ರಪ್ರವರ್ಧನಮ್ ॥ 167 ॥

ಐಹಿಕಾಮುಷ್ಮಿಕಭಯಚ್ಛೇದನಂ ಸುಖಸಾಧನಮ್ ।
ಕುಷ್ಠಾಪಸ್ಮಾರಪೈಶಾಚಚೇಷ್ಟಾದಿರುಜನಾಶಕಮ್ ॥ 168 ॥

ಅಶ್ಮರೀಂ ವಾತಶೀತೋಷ್ಣಂ ಜ್ವರಂ ಮಾಹೇಶ್ವರೀಜ್ವರಮ್ ।
ತ್ರಿದೋಷಜಂ ಸನ್ನಿಪಾತಂ ಕುಕ್ಷಿನೇತ್ರಶಿರೋವ್ಯಥಾಮ್ ॥ 169 ॥

ಮೃತ್ಯುದಾರಿದ್ರ್ಯಜನ್ಮಾದಿ ತೀವ್ರದುಃಖನಿವಾರಣಮ್ ।
ಮಾರಣಂ ಮೋಹನಂ ಚೈವ ಸ್ತಮ್ಭನೋಚ್ಚಾಟನಂ ತಥಾ ॥ 170 ॥

ವಿದ್ವೇಷಣಂ ಕರ್ಷಣಂ ಚ ಕುಟಿಲಂ ವೈರಿಚೇಷ್ಟಿತಮ್ ।
ವಿಷಶಸ್ತ್ರೋರಗವ್ಯಾಘ್ರಭಯಂ ಚೋರಾಗ್ನಿಶತ್ರುಜಮ್ ॥ 171 ॥

ಭೂತವೇತಾಲಯಕ್ಷಾದಿ ಬ್ರಹ್ಮರಾಕ್ಷಸಜಂ ಭಯಮ್ ।
ಶಾಕಿನ್ಯಾದಿ ಭಯಂ ಭೈರವೋದ್ಭವಂ ಬಹುದ್ವಿಟ್ಭಯಮ್ ॥ 172 ॥

ತ್ಯಜನ್ತ್ಯೇವ ಸಕೃತ್ ಸ್ತೋತ್ರಂ ಯಃ ಸ್ಮರೇದ್ಭೀತಮಾನಸಃ ।
ಯಃ ಸ್ಮರೇತ್ ವೀರಭದ್ರೇತಿ ಲಭೇತ್ ಸತ್ಯಂ ಶ್ರಿಯಂ ಜಯಮ್ ॥ 173 ॥

ವೀರಭದ್ರಸ್ಯ ನಾಮ್ನಾಂ ಯತ್ ಸಹಸ್ರಂ ಸರ್ವಸಿದ್ಧಿದಮ್ ।
ವಜ್ರಪಂಜರಮಿತ್ಯುಕ್ತಂ ವಿಷ್ಣುನಾ ಪ್ರಭವಿಷ್ಣುನಾ ॥ 174 ॥

ಕರಚಿನ್ತಾಮಣಿನಿಭಂ ಸ್ವೈರಕಾಮದಗೋಸಮಮ್ ।
ಸ್ವಾಂಗಣಸ್ಥಾಮರತರುಸಮಾನಮಸಮೋಪಮಮ್ ॥ 175 ॥

ಏಕಕಾಲಂ ದ್ವಿಕಾಲಂ ವಾ ತ್ರಿಕಾಲಂ ನಿತ್ಯಮೇವ ವಾ ।
ಯಃ ಪಠೇದ್ವೀರಭದ್ರಸ್ಯ ಸ್ತೋತ್ರಂ ಮನ್ತ್ರಮಿದಂ ನರಃ ॥ 176 ॥

ಇಹ ಭುಕ್ತ್ವಾಖಿಲಾನ್ಭೋಗಾನನ್ತೇ ಶಿವಪದಂ ವ್ರಜೇತ್ ॥ 177 ॥

ಇತಿ ಶ್ರೀಮತ್ಪದ್ಮಪುರಾಣೇ ಉಪರಿಭಾಗೇ ದಕ್ಷಾಧ್ವರೇ ಶ್ರೀಮಹಾಶರಭ-
ನೃಸಿಂಹಯುದ್ಧೇ ನರಹರಿರೂಪನಾರಾಯಣಪ್ರೋಕ್ತಂ ಶ್ರೀವೀರಭದ್ರ-
ಸಹಸ್ರನಾಮಸ್ತೋತ್ರಂ ಸಮ್ಪೂರ್ಣಮ್ ॥

            </Text>
          </ScrollView>
        </View>
        <View style={styles.page} key="2">
          <ScrollView>
            <Text style={styles.textalign}> Page 2 </Text>
            <Text style={styles.textalign}>
             *ಅಥ ಶ್ರೀವೀರಭದ್ರಸಹಸ್ರನಾಮಾವಲಿಃ*
{"\n"}{"\n"}
ಓಂ ಶಮ್ಭವೇ ನಮಃ ।
ಓಂ ಶಿವಾಯ ನಮಃ ।
ಓಂ ಮಹಾದೇವಾಯ ನಮಃ ।
ಓಂ ಶಿತಿಕಂಠಾಯ ನಮಃ ।
ಓಂ ವೃಷಧ್ವಜಾಯ ನಮಃ ।
ಓಂ ದಕ್ಷಾಧ್ವರಹರಾಯ ನಮಃ ।
ಓಂ ದಕ್ಷಾಯ ನಮಃ ।
ಓಂ ಕ್ರೂರದಾನವಭಂಜನಾಯ ನಮಃ ।
ಓಂ ಕಪರ್ದಿನೇ ನಮಃ ।
ಓಂ ಕಾಲವಿಧ್ವಂಸಿನೇ ನಮಃ । 10 ।

ಓಂ ಕಪಾಲಿನೇ ನಮಃ ।
ಓಂ ಕರುಣಾರ್ಣವಾಯ ನಮಃ ।
ಓಂ ಶರಣಾಗತರಕ್ಷೈಕನಿಪುಣಾಯ ನಮಃ ।
ಓಂ ನೀಲಲೋಹಿತಾಯ ನಮಃ ।
ಓಂ ನಿರೀಶಾಯ ನಮಃ ।
ಓಂ ನಿರ್ಭಯಾಯ ನಮಃ ।
ಓಂ ನಿತ್ಯಾಯ ನಮಃ ।
ಓಂ ನಿತ್ಯತೃಪ್ತಾಯ ನಮಃ ।
ಓಂ ನಿರಾಮಯಾಯ ನಮಃ ।
ಓಂ ಗಮ್ಭೀರನಿನದಾಯ ನಮಃ । 20 ।

ಓಂ ಭೀಮಾಯ ನಮಃ ।
ಓಂ ಭಯಂಕರಸ್ವರೂಪಧೃತೇ ನಮಃ ।
ಓಂ ಪುರನ್ದರಾದಿ ಗೀರ್ವಾಣವನ್ದ್ಯಮಾನಪದಾಮ್ಬುಜಾಯ ನಮಃ ।
ಓಂ ಸಂಸಾರವೈದ್ಯಾಯ ನಮಃ ।
ಓಂ ಸರ್ವಜ್ಞಾಯ ನಮಃ ।
ಓಂ ಸರ್ವಭೇಷಜಭೇಷಜಾಯ ನಮಃ ।
ಓಂ ಮೃತ್ಯುಂಜಯಾಯ ನಮಃ ।
ಓಂ ಕೃತ್ತಿವಾಸಸೇ ನಮಃ ।
ಓಂ ತ್ರ್ಯಮ್ಬಕಾಯ ನಮಃ ।
ಓಂ ತ್ರಿಪುರಾನ್ತಕಾಯ ನಮಃ । 30 ।

ಓಂ ವೃನ್ದಾರವೃನ್ದಮನ್ದಾರಾಯ ನಮಃ ।
ಓಂ ಮನ್ದಾರಾಚಲಮಂಡನಾಯ ನಮಃ ।
ಓಂ ಕುನ್ದೇನ್ದುಹಾರನೀಹಾರಹಾರಗೌರಸಮಪ್ರಭಾಯ ನಮಃ ।
ಓಂ ರಾಜರಾಜಸಖಾಯ ನಮಃ ।
ಓಂ ಶ್ರೀಮತೇ ನಮಃ ।
ಓಂ ರಾಜೀವಾಯತಲೋಚನಾಯ ನಮಃ ।
ಓಂ ಮಹಾನಟಾಯ ನಮಃ ।
ಓಂ ಮಹಾಕಾಲಾಯ ನಮಃ ।
ಓಂ ಮಹಾಸತ್ಯಾಯ ನಮಃ ।
ಓಂ ಮಹೇಶ್ವರಾಯ ನಮಃ । 40 ।

ಓಂ ಉತ್ಪತ್ತಿಸ್ಥಿತಿಸಂಹಾರಕಾರಣಾಯ ನಮಃ ।
ಓಂ ಆನನ್ದಕರ್ಮಕಾಯ ನಮಃ ।
ಓಂ ಸಾರಾಯ ನಮಃ ।
ಓಂ ಶೂರಾಯ ನಮಃ ।
ಓಂ ಮಹಾಧೀರಾಯ ನಮಃ ।
ಓಂ ವಾರಿಜಾಸನಪೂಜಿತಾಯ ನಮಃ ।
ಓಂ ವೀರಸಿಂಹಾಸನಾರೂಢಾಯ ನಮಃ ।
ಓಂ ವೀರಮೌಲಿಶಿಖಾಮಣಯೇ ನಮಃ ।
ಓಂ ವೀರಪ್ರಿಯಾಯ ನಮಃ ।
ಓಂ ವೀರರಸಾಯ ನಮಃ । 50 ।

ಓಂ ವೀರಭಾಷಣತತ್ಪರಾಯ ನಮಃ ।
ಓಂ ವೀರಸಂಗ್ರಾಮವಿಜಯಿನೇ ನಮಃ ।
ಓಂ ವೀರಾರಾಧನತೋಷಿತಾಯ ನಮಃ ।
ಓಂ ವೀರವ್ರತಾಯ ನಮಃ ।
ಓಂ ವಿರಾಡ್ರೂಪಾಯ ನಮಃ ।
ಓಂ ವಿಶ್ವಚೈತನ್ಯರಕ್ಷಕಾಯ ನಮಃ ।
ಓಂ ವೀರಖಡ್ಗಾಯ ನಮಃ ।
ಓಂ ಭಾರಶರಾಯ ನಮಃ ।
ಓಂ ಮೇರುಕೋದಂಡಮಂಡಿತಾಯ ನಮಃ ।
ಓಂ ವೀರೋತ್ತಮಾಂಗಾಯ ನಮಃ । 60 ।

ಓಂ ಶೃಂಗಾರಫಲಕಾಯ ನಮಃ ।
ಓಂ ವಿವಿಧಾಯುಧಾಯ ನಮಃ ।
ಓಂ ನಾನಾಸನಾಯ ನಮಃ ।
ಓಂ ನತಾರಾತಿಮಂಡಲಾಯ ನಮಃ ।
ಓಂ ನಾಗಭೂಷಣಾಯ ನಮಃ ।
ಓಂ ನಾರದಸ್ತುತಿಸನ್ತುಷ್ಟಾಯ ನಮಃ ।
ಓಂ ನಾಗಲೋಕಪಿತಾಮಹಾಯ ನಮಃ ।
ಓಂ ಸುದರ್ಶನಾಯ ನಮಃ ।
ಓಂ ಸುಧಾಕಾಯಾಯ ನಮಃ ।
ಓಂ ಸುರಾರಾತಿವಿಮರ್ದನಾಯ ನಮಃ । 70 ।

ಓಂ ಅಸಹಾಯಾಯ ನಮಃ ।
ಓಂ ಪರಸ್ಮೈ ನಮಃ ।
ಓಂ ಸರ್ವಸಹಾಯಾಯ ನಮಃ ।
ಓಂ ಸಾಮ್ಪ್ರದಾಯಕಾಯ ನಮಃ ।
ಓಂ ಕಾಮದಾಯ ನಮಃ ।
ಓಂ ವಿಷಭುಜೇ ನಮಃ ।
ಓಂ ಯೋಗಿನೇ ನಮಃ ।
ಓಂ ಭೋಗೀನ್ದ್ರಾಂಚಿತಕುಂಡಲಾಯ ನಮಃ ।
ಓಂ ಉಪಾಧ್ಯಾಯಾಯ ನಮಃ ।
ಓಂ ದಕ್ಷರಿಪವೇ ನಮಃ । (ದಕ್ಷವಟವೇ) 80 ।

ಓಂ ಕೈವಲ್ಯನಿಧಯೇ ನಮಃ ।
ಓಂ ಅಚ್ಯುತಾಯ ನಮಃ ।
ಓಂ ಸತ್ತ್ವಾಯ ನಮಃ ।
ಓಂ ರಜಸೇ ನಮಃ ।
ಓಂ ತಮಸೇ ನಮಃ ।
ಓಂ ಸ್ಥೂಲಾಯ ನಮಃ ।
ಓಂ ಸೂಕ್ಷ್ಮಾಯ ನಮಃ ।
ಓಂ ಅನ್ತರ್ಬಹಿರವ್ಯಯಾಯ ನಮಃ ।
ಓಂ ಭುವೇ ನಮಃ ।
ಓಂ ಅದ್ಭ್ಯಃ ನಮಃ । 90 ।

ಓಂ ಜ್ವಲನಾಯ ನಮಃ ।
ಓಂ ವಾಯವೇ ನಮಃ । (ವಾಯುದೇವಾಯ)
ಓಂ ಗಗನಾಯ ನಮಃ ।
ಓಂ ತ್ರಿಜಗದ್ಗುರವೇ ನಮಃ ।
ಓಂ ನಿರಾಧಾರಾಯ ನಮಃ ।
ಓಂ ನಿರಾಲಮ್ಬಾಯ ನಮಃ ।
ಓಂ ಸರ್ವಾಧಾರಾಯ ನಮಃ ।
ಓಂ ಸದಾಶಿವಾಯ ನಮಃ ।
ಓಂ ಭಾಸ್ವರಾಯ ನಮಃ ।
ಓಂ ಭಗವತೇ ನಮಃ । 100 ।

ಓಂ ಭಾಲನೇತ್ರಾಯ ನಮಃ ।
ಓಂ ಭಾವಜಸಂಹರಾಯ ನಮಃ ।
ಓಂ ವ್ಯಾಲಬದ್ಧಜಟಾಜೂಟಾಯ ನಮಃ ।
ಓಂ ಬಾಲಚನ್ದ್ರಶಿಖಾಮಣಯೇ ನಮಃ ।
ಓಂ ಅಕ್ಷಯ್ಯಾಯ ನಮಃ । (ಅಕ್ಷಯೈಕಾಕ್ಷರಾಯ)
ಓಂ ಏಕಾಕ್ಷರಾಯ ನಮಃ ।
ಓಂ ದುಷ್ಟಶಿಕ್ಷಕಾಯ ನಮಃ ।
ಓಂ ಶಿಷ್ಟರಕ್ಷಿತಾಯ ನಮಃ । (ಶಿಷ್ಟರಕ್ಷಕಾಯ)
ಓಂ ದಕ್ಷಪಕ್ಷೇಷುಬಾಹುಲ್ಯವನಲೀಲಾಗಜಾಯ ನಮಃ । (ಪಕ್ಷ)
ಓಂ ಋಜವೇ ನಮಃ । 110 ।

ಓಂ ಯಜ್ಞಾಂಗಾಯ ನಮಃ ।
ಓಂ ಯಜ್ಞಭುಜೇ ನಮಃ ।
ಓಂ ಯಜ್ಞಾಯ ನಮಃ ।
ಓಂ ಯಜ್ಞೇಶಾಯ ನಮಃ ।
ಓಂ ಯಜನೇಶ್ವರಾಯ ನಮಃ ।
ಓಂ ಮಹಾಯಜ್ಞಧರಾಯ ನಮಃ ।
ಓಂ ದಕ್ಷಸಮ್ಪೂರ್ಣಾಹೂತಿಕೌಶಲಾಯ ನಮಃ ।
ಓಂ ಮಾಯಾಮಯಾಯ ನಮಃ ।
ಓಂ ಮಹಾಕಾಯಾಯ ನಮಃ ।
ಓಂ ಮಾಯಾತೀತಾಯ ನಮಃ । 120 ।

ಓಂ ಮನೋಹರಾಯ ನಮಃ ।
ಓಂ ಮಾರದರ್ಪಹರಾಯ ನಮಃ ।
ಓಂ ಮಂಜವೇ ನಮಃ ।
ಓಂ ಮಹೀಸುತದಿನಪ್ರಿಯಾಯ ನಮಃ ।
ಓಂ ಸೌಮ್ಯಾಯ ನಮಃ । (ಕಾಮ್ಯಾಯಃ)
ಓಂ ಸಮಾಯ ನಮಃ ।
ಓಂ ಅಸಮಾಯ ನಮಃ । (ಅನಘಾಯ)
ಓಂ ಅನನ್ತಾಯ ನಮಃ ।
ಓಂ ಸಮಾನರಹಿತಾಯ ನಮಃ ।
ಓಂ ಹರಾಯ ನಮಃ । 130 ।

ಓಂ ಸೋಮಾಯ ನಮಃ ।
ಓಂ ಅನೇಕಕಲಾಧಾಮ್ನೇ ನಮಃ ।
ಓಂ ವ್ಯೋಮಕೇಶಾಯ ನಮಃ ।
ಓಂ ನಿರಂಜನಾಯ ನಮಃ ।
ಓಂ ಗುರವೇ ನಮಃ ।
ಓಂ ಸುರಗುರವೇ ನಮಃ ।
ಓಂ ಗೂಢಾಯ ನಮಃ ।
ಓಂ ಗುಹಾರಾಧನತೋಷಿತಾಯ ನಮಃ ।
ಓಂ ಗುರುಮನ್ತ್ರಾಕ್ಷರಾಯ ನಮಃ ।
ಓಂ ಗುರವೇ ನಮಃ । 140 ।

ಓಂ ಪರಾಯ ನಮಃ ।
ಓಂ ಪರಮಕಾರಣಾಯ ನಮಃ ।
ಓಂ ಕಲಯೇ ನಮಃ ।
ಓಂ ಕಲಾಢ್ಯಾಯ ನಮಃ ।
ಓಂ ನೀತಿಜ್ಞಾಯ ನಮಃ ।
ಓಂ ಕರಾಲಾಸುರಸೇವಿತಾಯ ನಮಃ ।
ಓಂ ಕಮನೀಯರವಿಚ್ಛಾಯಾಯ ನಮಃ । (ಕಮನೀಯರವಿಚ್ಛಾಯಾನನ್ದನಾಯ)
ಓಂ ನನ್ದನಾನನ್ದವರ್ಧನಾಯ ನಮಃ । ನಮಃ । (ನನ್ದವರ್ಧನಾಯ)
ಓಂ ಸ್ವಭಕ್ತಪಕ್ಷಾಯ ನಮಃ ।
ಓಂ ಪ್ರಬಲಾಯ ನಮಃ । 150 ।

ಓಂ ಸ್ವಭಕ್ತಬಲವರ್ಧನಾಯ ನಮಃ ।
ಓಂ ಸ್ವಭಕ್ತಪ್ರತಿವಾದಿನೇ ನಮಃ ।
ಓಂ ಇನ್ದ್ರಮುಖಚನ್ದ್ರವಿತುನ್ತುದಾಯ ನಮಃ ।
ಓಂ ಶೇಷಭೂಷಾಯ ನಮಃ ।
ಓಂ ವಿಶೇಷಜ್ಞಾಯ ನಮಃ ।
ಓಂ ತೋಷಿತಾಯ ನಮಃ ।
ಓಂ ಸುಮನಸೇ ನಮಃ ।
ಓಂ ಸುಧಿಯೇ ನಮಃ ।
ಓಂ ದೂಷಕಾಭಿಜನೋದ್ಧೂತಧೂಮಕೇತವೇ ನಮಃ ।
ಓಂ ಸನಾತನಾಯ ನಮಃ । 160 ।

ಓಂ ದೂರೀಕೃತಾಘಪಟಲಾಯ ನಮಃ ।
ಓಂ ಚೋರೀಕೃತಾಯ ನಮಃ । (ಊರೀಕೃತಸುಖವ್ರಜಾಯ)
ಓಂ ಸುಖಪ್ರಜಾಯ ನಮಃ ।
ಓಂ ಪೂರೀಕೃತೇಷುಕೋದಂಡಾಯ ನಮಃ ।
ಓಂ ನಿರ್ವೈರೀಕೃತಸಂಗರಾಯ ನಮಃ ।
ಓಂ ಬ್ರಹ್ಮವಿದೇ ನಮಃ ।
ಓಂ ಬ್ರಾಹ್ಮಣಾಯ ನಮಃ ।
ಓಂ ಬ್ರಹ್ಮಣೇ ನಮಃ ।
ಓಂ ಬ್ರಹ್ಮಚಾರಿಣೇ ನಮಃ ।
ಓಂ ಜಗತ್ಪತಯೇ ನಮಃ । 170 ।

ಓಂ ಬ್ರಹ್ಮೇಶ್ವರಾಯ ನಮಃ ।
ಓಂ ಬ್ರಹ್ಮಮಯಾಯ ನಮಃ ।
ಓಂ ಪರಬ್ರಹ್ಮಾತ್ಮಕಾಯ ನಮಃ ।
ಓಂ ಪ್ರಭವೇ ನಮಃ ।
ಓಂ ನಾದಪ್ರಿಯಾಯ ನಮಃ ।
ಓಂ ನಾದಮಯಾಯ ನಮಃ ।
ಓಂ ನಾದಬಿನ್ದವೇ ನಮಃ ।
ಓಂ ನಗೇಶ್ವರಾಯ ನಮಃ ।
ಓಂ ಆದಿಮಧ್ಯಾನ್ತರಹಿತಾಯ ನಮಃ ।
ಓಂ ವೇದಾಯ ನಮಃ । 180 ।

ಓಂ ವೇದವಿದಾಂ ವರಾಯ ನಮಃ ।
ಓಂ ಇಷ್ಟಾಯ ನಮಃ ।
ಓಂ ವಿಶಿಷ್ಟಾಯ ನಮಃ ।
ಓಂ ತುಷ್ಟಘ್ನಾಯ ನಮಃ ।
ಓಂ ಪುಷ್ಟಿದಾಯ ನಮಃ ।
ಓಂ ಪುಷ್ಟಿವರ್ಧನಾಯ ನಮಃ ।
ಓಂ ಕಷ್ಟದಾರಿದ್ರ್ಯನಿರ್ನಾಶಾಯ ನಮಃ ।
ಓಂ ದುಷ್ಟವ್ಯಾಧಿಹರಾಯ ನಮಃ ।
ಓಂ ಹರಾಯ ನಮಃ ।
ಓಂ ಪದ್ಮಾಸನಾಯ ನಮಃ । 190 ।

ಓಂ ಪದ್ಮಕರಾಯ ನಮಃ ।
ಓಂ ನವಪದ್ಮಾಸನಾರ್ಚಿತಾಯ ನಮಃ ।
ಓಂ ನೀಲಾಮ್ಬುಜದಲಶ್ಯಾಮಾಯ ನಮಃ ।
ಓಂ ನಿರ್ಮಲಾಯ ನಮಃ ।
ಓಂ ಭಕ್ತವತ್ಸಲಾಯ ನಮಃ ।
ಓಂ ನೀಲಜೀಮೂತಸಂಕಾಶಾಯ ನಮಃ ।
ಓಂ ಕಾಲಕನ್ಧರಬನ್ಧುರಾಯ ನಮಃ ।
ಓಂ ಜಪಾಕುಸುಮಸನ್ತುಷ್ಟಾಯ ನಮಃ ।
ಓಂ ಜಪಹೋಮಾರ್ಚ್ಚನಪ್ರಿಯಾಯ ನಮಃ । (ಜನಪ್ರಿಯಾಯ, ಹೋಮಪ್ರಿಯಾಯ, ಅರ್ಚನಾಪ್ರಿಯಾಯ)
ಓಂ ಜಗದಾದಯೇ ನಮಃ । 200 ।

ಓಂ ಅನಾದೀಶಾಯ ನಮಃ । (ಆನನ್ದೇಶಾಯ)
ಓಂ ಅಜಗವನ್ಧರಕೌತುಕಾಯ ನಮಃ ।
ಓಂ ಪುರನ್ದರಸ್ತುತಾನನ್ದಾಯ ನಮಃ ।
ಓಂ ಪುಲಿನ್ದಾಯ ನಮಃ ।
ಓಂ ಪುಣ್ಯಪಂಜರಾಯ ನಮಃ ।
ಓಂ ಪೌಲಸ್ತ್ಯಚಲಿತೋಲ್ಲೋಲಪರ್ವತಾಯ ನಮಃ ।
ಓಂ ಪ್ರಮದಾಕರಾಯ ನಮಃ ।
ಓಂ ಕರಣಾಯ ನಮಃ ।
ಓಂ ಕಾರಣಾಯ ನಮಃ ।
ಓಂ ಕರ್ಮಕರಣೀಯಾಗ್ರಣ್ಯೈ ನಮಃ । (ಕರ್ತ್ರೇ, ಕರಣಿಯಾಯ, ಅಗ್ರಣ್ಯೈ) 210 ।

ಓಂ ದೃಢಾಯ ನಮಃ ।
ಓಂ ಕರಿದೈತ್ಯೇನ್ದ್ರವಸನಾಯ ನಮಃ ।
ಓಂ ಕರುಣಾಪೂರವಾರಿಧಯೇ ನಮಃ ।
ಓಂ ಕೋಲಾಹಲಪ್ರಿಯಾಯ ನಮಃ । (ಕೋಲಾಹಲಾಯ)
ಓಂ ಪ್ರೀತಾಯ ನಮಃ । (ಪ್ರೇಯಸೇ)
ಓಂ ಶೂಲಿನೇ ನಮಃ ।
ಓಂ ವ್ಯಾಲಕಪಾಲಭೃತೇ ನಮಃ ।
ಓಂ ಕಾಲಕೂಟಗಲಾಯ ನಮಃ ।
ಓಂ ಕ್ರೀಡಾಲೀಲಾಕೃತಜಗತ್ತ್ರಯಾಯ ನಮಃ ।
ಓಂ ದಿಗಮ್ಬರಾಯ ನಮಃ । 220 ।

ಓಂ ದಿನೇಶೇಶಾಯ ನಮಃ ।
ಓಂ ಧೀಮತೇ ನಮಃ ।
ಓಂ ಧೀರಾಯ ನಮಃ ।
ಓಂ ಧುರನ್ಧರಾಯ ನಮಃ ।
ಓಂ ದಿಕ್ಕಾಲಾದ್ಯನವಚ್ಛಿನ್ನಾಯ ನಮಃ ।
ಓಂ ಧೂರ್ಜಟಯೇ ನಮಃ ।
ಓಂ ಧೂತದುರ್ಗತಯೇ ನಮಃ । (ಧೂತದುರ್ವೃತ್ತಯೇ)
ಓಂ ಕಮನೀಯಾಯ ನಮಃ ।
ಓಂ ಕರಾಲಾಸ್ಯಾಯ ನಮಃ ।
ಓಂ ಕಲಿಕಲ್ಮಷಸೂದನಾಯ ನಮಃ । 230 ।

ಓಂ ಕರವೀರಾರುಣಾಮ್ಭೋಜಕಲ್ಹಾರಕುಸುಮಾರ್ಪಿತಾಯ ನಮಃ ।
ಓಂ ಖರಾಯ ನಮಃ ।
ಓಂ ಮಂಡಿತದೋರ್ದಂಡಾಯ ನಮಃ ।
ಓಂ ಖರೂಪಾಯ ನಮಃ ।
ಓಂ ಕಾಲಭಂಜನಾಯ ನಮಃ ।
ಓಂ ಖರಾಂಶುಮಂಡಲಮುಖಾಯ ನಮಃ ।
ಓಂ ಖಂಡಿತಾರಾತಿಮಂಡಲಾಯ ನಮಃ ।
ಓಂ ಗಣೇಶಗಣಿತಾಯ ನಮಃ ।
ಓಂ ಅಗಣ್ಯಾಯ ನಮಃ ।
ಓಂ ಪುಣ್ಯರಾಶಯೇ ನಮಃ । 240 ।

ಓಂ ಸುಖೋದಯಾಯ ನಮಃ ।
ಓಂ ಗಣಾಧಿಪಕುಮಾರಾದಿಗಣಕೈರವಬಾನ್ಧವಾಯ ನಮಃ ।
ಓಂ ಘನಘೋಷಬೃಹನ್ನಾದಘನೀಕೃತಸುನೂಪುರಾಯ ನಮಃ ।
ಓಂ ಘನಚರ್ಚಿತಸಿನ್ದೂರಾಯ ನಮಃ । (ಘನಚರ್ಚಿತಸಿನ್ಧುರಾಯ)
ಓಂ ಘಂಟಾಭೀಷಣಭೈರವಾಯ ನಮಃ ।
ಓಂ ಪರಾಪರಾಯ ನಮಃ । (ಚರಾಚರಾಯ)
ಓಂ ಬಲಾಯ ನಮಃ । (ಅಚಲಾಯ)
ಓಂ ಅನನ್ತಾಯ ನಮಃ ।
ಓಂ ಚತುರಾಯ ನಮಃ ।
ಓಂ ಚಕ್ರಬನ್ಧಕಾಯ ನಮಃ । 250 ।

ಓಂ ಚತುರ್ಮುಖಮುಖಾಮ್ಭೋಜಚತುರಸ್ತುತಿತೋಷಣಾಯ ನಮಃ ।
ಓಂ ಛಲವಾದಿನೇ ನಮಃ ।
ಓಂ ಛಲಾಯ ನಮಃ ।
ಓಂ ಶಾನ್ತಾಯ ನಮಃ ।
ಓಂ ಛಾನ್ದಸಾಯ ನಮಃ ।
ಓಂ ಛಾನ್ದಸಪ್ರಿಯಾಯ ನಮಃ ।
ಓಂ ಛಿನ್ನಚ್ಛಲಾದಿದುರ್ವಾದಚ್ಛಿನ್ನಷಟ್ತನ್ತ್ರತಾನ್ತ್ರಿಕಾಯ ನಮಃ ।
(ಘನಚ್ಛಲಾದಿದುರ್ವಾದಭಿನ್ನಷಟ್ತನ್ತ್ರತಾನ್ತ್ರಿಕಾಯ)
ಓಂ ಜಡೀಕೃತಮಹಾವಜ್ರಾಯ ನಮಃ ।
ಓಂ ಜಮ್ಭಾರಾತಯೇ ನಮಃ ।
ಓಂ ನತೋನ್ನತಾಯ ನಮಃ । 260 ।

ಓಂ ಜಗದಾಧಾರಾಯ ನಮಃ । (ಜಗದಾಧಾರಭುವೇ)
ಓಂ ಭೂತೇಶಾಯ ನಮಃ ।
ಓಂ ಜಗದನ್ತಾಯ ನಮಃ ।
ಓಂ ನಿರಂಜನಾಯ ನಮಃ ।
ಓಂ ಝರ್ಝರಧ್ವನಿಸಮ್ಯುಕ್ತಝಂಕಾರರವಭೂಷಣಾಯ ನಮಃ ।
ಓಂ ಝಟಿನೇ ನಮಃ ।
ಓಂ ವಿಪಕ್ಷವೃಕ್ಷೌಘಝಂಝಾಮಾರುತಸನ್ನಿಭಾಯ ನಮಃ ।
ಓಂ ಪ್ರವರ್ಣಾಂಚಿತಪತ್ರಾಂಕಾಯ ನಮಃ ।
ಓಂ ಪ್ರವರ್ಣಾದ್ಯಕ್ಷರವ್ರಜಾಯ ನಮಃ ।
ಓಂ ಟ-ವರ್ಣಬಿನ್ದುಸಮ್ಯುಕ್ತಾಯ ನಮಃ । 270 ।

ಓಂ ಟಂಕಾರಹೃತದಿಗ್ಗಜಾಯ ನಮಃ ।
ಓಂ ಠ-ವರ್ಣಪೂರದ್ವಿದಳಾಯ ನಮಃ ।
ಓಂ ಠ-ವರ್ಣಾಗ್ರದಳಾಕ್ಷರಾಯ ನಮಃ ।
ಓಂ ಠ-ವರ್ಣಯುತಸದ್ಯನ್ತ್ರಾಯ ನಮಃ ।
ಓಂ ಠಜ-ಜಾಕ್ಷರಪೂರಕಾಯ ನಮಃ ।
ಓಂ ಡಮರುಧ್ವನಿಸಮ್ರಕ್ತಾಯ ನಮಃ । (ಡಮರುಧ್ವನಿಸುರಕ್ತಾಯ)
ಓಂ ಡಮ್ಬರಾನನ್ದತಾಂಡವಾಯ ನಮಃ ।
ಓಂ ಡಂಡಂಢಘೋಷಪ್ರಮೋದಾಡಮ್ಬರಾಯ ನಮಃ ।
ಓಂ ಗಣತಾಂಡವಾಯ ನಮಃ ।
ಓಂ ಢಕ್ಕಾಪಟಹಸುಪ್ರೀತಾಯ ನಮಃ । 280 ।

ಓಂ ಢಕ್ಕಾರವವಶಾನುಗಾಯ ನಮಃ ।
ಓಂ ಢಕ್ಕಾದಿತಾಳಸನ್ತುಷ್ಟಾಯ ನಮಃ ।
ಓಂ ತೋಡಿಬದ್ಧಸ್ತುತಿಪ್ರಿಯಾಯ ನಮಃ ।
ಓಂ ತಪಸ್ವಿರೂಪಾಯ ನಮಃ ।
ಓಂ ತಪನಾಯ ನಮಃ । (ತಾಪಸಾಯ)
ಓಂ ತಪ್ತಕಾಂಚನಸನ್ನಿಭಾಯ ನಮಃ ।
ಓಂ ತಪಸ್ವಿವದನಾಮ್ಭೋಜಕಾರುಣ್ಯತರಣಿದ್ಯುತಯೇ ನಮಃ ।
ಓಂ ಢಗಾದಿವಾದಸೌಹಾರ್ದಸ್ಥಿತಾಯ ನಮಃ ।
ಓಂ ಸಮ್ಯಮಿನಾಂ ವರಾಯ ನಮಃ ।
ಓಂ ಸ್ಥಾಣವೇ ನಮಃ । 290 ।

ಓಂ ತಂಡುನುತಿಪ್ರೀತಾಯ ನಮಃ ।
ಓಂ ಸ್ಥಿತಯೇ ನಮಃ ।
ಓಂ ಸ್ಥಾವರಾಯ ನಮಃ ।
ಓಂ ಜಂಗಮಾಯ ನಮಃ ।
ಓಂ ದರಹಾಸಾನನಾಮ್ಭೋಜದನ್ತಹೀರಾವಳಿದ್ಯುತಯೇ ನಮಃ ।
ಓಂ ದರ್ವೀಕರಾಂಗತಭುಜಾಯ ನಮಃ ।
ಓಂ ದುರ್ವಾರಾಯ ನಮಃ ।
ಓಂ ದುಃಖದುರ್ಗಘ್ನೇ ನಮಃ । (ದುಃಖದುರ್ಗಹರ್ತ್ರೇ)
ಓಂ ಧನಾಧಿಪಸಖ್ಯೇ ನಮಃ ।
ಓಂ ಧೀರಾಯ ನಮಃ । (ಧೈರ್ಯಾಯ) (ಧರ್ಮಾಯ) 300 ।

ಓಂ ಧರ್ಮಾಧರ್ಮಪರಾಯಣಾಯ ನಮಃ । –
ಓಂ ಧರ್ಮಧ್ವಜಾಯ ನಮಃ ।
ಓಂ ದಾನಶೌಂಡಾಯ ನಮಃ । (ದಾನಭಾಂಡಾಯ)
ಓಂ ಧರ್ಮಕರ್ಮಫಲಪ್ರದಾಯ ನಮಃ ।
ಓಂ ಪಶುಪಾಶಹಾರಾಯ ನಮಃ । (ತಮೋಽಪಹಾರಾಯ)
ಓಂ ಶರ್ವಾಯ ನಮಃ ।
ಓಂ ಪರಮಾತ್ಮನೇ ನಮಃ ।
ಓಂ ಸದಾಶಿವಾಯ ನಮಃ ।
ಓಂ ಪರಾಪರಾಯ ನಮಃ ।
ಓಂ ಪರಶುಧೃತೇ ನಮಃ । 310 ।

ಓಂ ಪವಿತ್ರಾಯ ನಮಃ ।
ಓಂ ಸರ್ವಪಾವನಾಯ ನಮಃ ।
ಓಂ ಫಲ್ಗುನಸ್ತುತಿಸನ್ತುಷ್ಟಾಯ ನಮಃ ।
ಓಂ ಫಲ್ಗುನಾಗ್ರಜವತ್ಸಲಾಯ ನಮಃ ।
ಓಂ ಫಲ್ಗುನಾರ್ಜಿತಸಂಗ್ರಾಮಫಲಪಾಶುಪತಪ್ರದಾಯ ನಮಃ ।
ಓಂ ಬಲಾಯ ನಮಃ ।
ಓಂ ಬಹುವಿಲಾಸಾಂಗಾಯ ನಮಃ ।
ಓಂ ಬಹುಲೀಲಾಧರಾಯ ನಮಃ ।
ಓಂ ಬಹವೇ ನಮಃ ।
ಓಂ ಬರ್ಹಿರ್ಮುಖಾಯ ನಮಃ । 320 ।

ಓಂ ಸುರಾರಾಧ್ಯಾಯ ನಮಃ ।
ಓಂ ಬಲಿಬನ್ಧನಬಾನ್ಧವಾಯ ನಮಃ ।
ಓಂ ಭಯಂಕರಾಯ ನಮಃ ।
ಓಂ ಭವಹರಾಯ ನಮಃ ।
ಓಂ ಭರ್ಗಾಯ ನಮಃ ।
ಓಂ ಭಯಹರಾಯ ನಮಃ ।
ಓಂ ಭವಾಯ ನಮಃ ।
ಓಂ ಭಾಲಾನಲಾಯ ನಮಃ ।
ಓಂ ಬಹುಭುಜಾಯ ನಮಃ ।
ಓಂ ಭಾಸ್ವತೇ ನಮಃ । 330 ।

ಓಂ ಸದ್ಭಕ್ತವತ್ಸಲಾಯ ನಮಃ ।
ಓಂ ಮನ್ತ್ರಾಯ ನಮಃ ।
ಓಂ ಮನ್ತ್ರಗಣಾಯ ನಮಃ ।
ಓಂ ಮನ್ತ್ರಿಣೇ ನಮಃ ।
ಓಂ ಮನ್ತ್ರಾರಾಧನತೋಷಿತಾಯ ನಮಃ ।
ಓಂ ಮನ್ತ್ರಯಜ್ಞಾಯ ನಮಃ । (ಮನ್ತ್ರವಿಜ್ಞಾಯ ನಮಃ ।
ಓಂ ಮನ್ತ್ರವಾದಿನೇ ನಮಃ ।
ಓಂ ಮನ್ತ್ರಬೀಜಾಯ ನಮಃ ।
ಓಂ ಮಹನ್ಮಹಸೇ ನಮಃ । (ಮಹನ್ಮಾನಸೇ)
ಓಂ ಯನ್ತ್ರಾಯ ನಮಃ । 340 ।

ಓಂ ಯನ್ತ್ರಮಯಾಯ ನಮಃ ।
ಓಂ ಯನ್ತ್ರಿಣೇ ನಮಃ ।
ಓಂ ಯನ್ತ್ರಜ್ಞಾಯ ನಮಃ ।
ಓಂ ಯನ್ತ್ರವತ್ಸಲಾಯ ನಮಃ ।
ಓಂ ಯನ್ತ್ರಪಾಲಾಯ ನಮಃ ।
ಓಂ ಯನ್ತ್ರಹರಾಯ ನಮಃ ।
ಓಂ ತ್ರಿಜಗದ್ಯನ್ತ್ರವಾಹಕಾಯ ನಮಃ ।
ಓಂ ರಜತಾದ್ರಿಸದಾವಾಸಾಯ ನಮಃ ।
ಓಂ ರವೀನ್ದುಶಿಖಿಲೋಚನಾಯ ನಮಃ ।
ಓಂ ರತಿಶ್ರಾನ್ತಾಯ ನಮಃ । 350 ।

ಓಂ ಜಿತಶ್ರಾನ್ತಾಯ ನಮಃ ।
ಓಂ ರಜನೀಕರಶೇಖರಾಯ ನಮಃ ।
ಓಂ ಲಲಿತಾಯ ನಮಃ ।
ಓಂ ಲಾಸ್ಯಸನ್ತುಷ್ಟಾಯ ನಮಃ ।
ಓಂ ಲಬ್ಧೋಗ್ರಾಯ ನಮಃ ।
ಓಂ ಲಘುಸಾಹಸಾಯ ನಮಃ ।
ಓಂ ಲಕ್ಷ್ಮೀನಿಜಕರಾಯ ನಮಃ ।
ಓಂ ಲಕ್ಷ್ಯಲಕ್ಷಣಜ್ಞಾಯ ನಮಃ ।
ಓಂ ಲಸನ್ಮತಯೇ ನಮಃ ।
ಓಂ ವರಿಷ್ಠಾಯ ನಮಃ । 360 ।

ಓಂ ವರದಾಯ ನಮಃ ।
ಓಂ ವನ್ದ್ಯಾಯ ನಮಃ ।
ಓಂ ವರದಾನಪರಾಯ ನಮಃ । ನಮಃ । (ವರಪ್ರದಾಯ)
ಓಂ ವಶಿನೇ ನಮಃ ।
ಓಂ ವೈಶ್ವಾನರಾಂಚಿತಭುಜಾಯ ನಮಃ ।
ಓಂ ವರೇಣ್ಯಾಯ ನಮಃ ।
ಓಂ ವಿಶ್ವತೋಮುಖಾಯ ನಮಃ ।
ಓಂ ಶರಣಾರ್ತಿಹರಾಯ ನಮಃ ।
ಓಂ ಶಾನ್ತಾಯ ನಮಃ ।
ಓಂ ಶಂಕರಾಯ ನಮಃ । 370 ।

ಓಂ ಶಶಿಶೇಖರಾಯ ನಮಃ ।
ಓಂ ಶರಭಾಯ ನಮಃ ।
ಓಂ ಶಮ್ಬರಾರಾತಯೇ ನಮಃ ।
ಓಂ ಭಸ್ಮೋದ್ಧೂಳಿತವಿಗ್ರಹಾಯ ನಮಃ ।
ಓಂ ಷಟ್ತ್ರಿಂಶತ್ತತ್ತ್ವವಿದ್ರೂಪಾಯ ನಮಃ ।
ಓಂ ಷಣ್ಮುಖಸ್ತುತಿತೋಷಣಾಯ ನಮಃ ।
ಓಂ ಷಡಕ್ಷರಾಯ ನಮಃ ।
ಓಂ ಶಕ್ತಿಯುತಾಯ ನಮಃ ।
ಓಂ ಷಟ್ಪದಾದ್ಯರ್ಥಕೋವಿದಾಯ ನಮಃ । (ಷಟ್ಪದಾರ್ಧಾರ್ಥಕೋವಿದಾಯ)
ಓಂ ಸರ್ವಜ್ಞಾಯ ನಮಃ । 380 ।

ಓಂ ಸರ್ವಸರ್ವೇಶಾಯ ನಮಃ ।
ಓಂ ಸರ್ವದಾಽಽನನ್ದಕಾರಕಾಯ ನಮಃ ।
ಓಂ ಸರ್ವವಿದೇ ನಮಃ ।
ಓಂ ಸರ್ವಕೃತೇ ನಮಃ ।
ಓಂ ಸರ್ವಸ್ಮೈ ನಮಃ ।
ಓಂ ಸರ್ವದಾಯ ನಮಃ ।
ಓಂ ಸರ್ವತೋಮುಖಾಯ ನಮಃ ।
ಓಂ ಹರಾಯ ನಮಃ ।
ಓಂ ಪರಮಕಲ್ಯಾಣಾಯ ನಮಃ ।
ಓಂ ಹರಿಚರ್ಮಧರಾಯ ನಮಃ । 390 ।

ಓಂ ಪರಸ್ಮೈಯ ನಮಃ ।
ಓಂ ಹರಿಣಾರ್ಧಕರಾಯ ನಮಃ ।
ಓಂ ಹಂಸಾಯ ನಮಃ ।
ಓಂ ಹರಿಕೋಟಿಸಮಪ್ರಭಾಯ ನಮಃ ।
ಓಂ ದೇವದೇವಾಯ ನಮಃ ।
ಓಂ ಜಗನ್ನಾಥಾಯ ನಮಃ ।
ಓಂ ದೇವೇಶಾಯ ನಮಃ ।
ಓಂ ದೇವವಲ್ಲಭಾಯ ನಮಃ ।
ಓಂ ದೇವಮೌಲಿಶಿಖಾರತ್ನಾಯ ನಮಃ ।
ಓಂ ದೇವಾಸುರಸುತೋಷಿತಾಯ ನಮಃ । (ದೇವಾಸುರನುತಾಯ) (ಉನ್ನತಾಯ) 400 ।

ಓಂ ಸುರೂಪಾಯ ನಮಃ ।
ಓಂ ಸುವ್ರತಾಯ ನಮಃ ।
ಓಂ ಶುದ್ಧಾಯ ನಮಃ ।
ಓಂ ಸುಕರ್ಮಣೇ ನಮಃ । (ಸುಕರ್ಮಿಣೇ)
ಓಂ ಸುಸ್ಥಿರಾಯ ನಮಃ ।
ಓಂ ಸುಧಿಯೇ ನಮಃ ।
ಓಂ ಸುರೋತ್ತಮಾಯ ನಮಃ ।
ಓಂ ಸುಫಲದಾಯ ನಮಃ ।
ಓಂ ಸುರಚಿನ್ತಾಮಣಯೇ ನಮಃ ।
ಓಂ ಶುಭಾಯ ನಮಃ । 410 ।

ಓಂ ಕುಶಲಿನೇ ನಮಃ ।
ಓಂ ವಿಕ್ರಮಾಯ ನಮಃ ।
ಓಂ ತರ್ಕ್ಕಾಯ ನಮಃ ।
ಓಂ ಕುಂಡಲೀಕೃತಕುಂಡಲಿನೇ ನಮಃ ।
ಓಂ ಖಂಡೇನ್ದುಕಾರಕಾಯ ನಮಃ । (ಖಂಡೇನ್ದುಕೋರಕಾಯ)
ಓಂ ಜಟಾಜೂಟಾಯ ನಮಃ ।
ಓಂ ಕಾಲಾನಲದ್ಯುತಯೇ ನಮಃ ।
ಓಂ ವ್ಯಾಘ್ರಚರ್ಮಾಮ್ಬರಧರಾಯ ನಮಃ ।
ಓಂ ವ್ಯಾಘ್ರೋಗ್ರಬಹುಸಾಹಸಾಯ ನಮಃ ।
ಓಂ ವ್ಯಾಳೋಪವೀತಿನೇ ನಮಃ । (ವ್ಯಾಲೋಪವೀತವಿಲಸತೇ) 420 ।

ಓಂ ವಿಲಸಚ್ಛೋಣತಾಮರಸಾಮ್ಬಕಾಯ ನಮಃ ।
ಓಂ ದ್ಯುಮಣಯೇ ನಮಃ ।
ಓಂ ತರಣಯೇ ನಮಃ ।
ಓಂ ವಾಯವೇ ನಮಃ ।
ಓಂ ಸಲಿಲಾಯ ನಮಃ ।
ಓಂ ವ್ಯೋಮ್ನೇ ನಮಃ ।
ಓಂ ಪಾವಕಾಯ ನಮಃ ।
ಓಂ ಸುಧಾಕರಾಯ ನಮಃ ।
ಓಂ ಯಜ್ಞಪತಯೇ ನಮಃ ।
ಓಂ ಅಷ್ಟಮೂರ್ತಯೇ ನಮಃ । 430 ।

ಓಂ ಕೃಪಾನಿಧಯೇ ನಮಃ ।
ಓಂ ಚಿದ್ರೂಪಾಯ ನಮಃ ।
ಓಂ ಚಿದ್ಘನಾನನ್ದಕನ್ದಾಯ ನಮಃ ।
ಓಂ ಚಿನ್ಮಯಾಯ ನಮಃ ।
ಓಂ ನಿಷ್ಕಲಾಯ ನಮಃ ।
ಓಂ ನಿರ್ದ್ವನ್ದ್ವಾಯ ನಮಃ ।
ಓಂ ನಿಷ್ಪ್ರಭಾಯ ನಮಃ ।
ಓಂ ನಿತ್ಯಾಯ ನಮಃ ।
ಓಂ ನಿರ್ಗುಣಾಯ ನಮಃ ।
ಓಂ ನಿರ್ಗತಾಮಯಾಯ ನಮಃ । 440 ।

ಓಂ ವ್ಯೋಮಕೇಶಾಯ ನಮಃ ।
ಓಂ ವಿರೂಪಾಕ್ಷಾಯ ನಮಃ ।
ಓಂ ವಾಮದೇವಾಯ ನಮಃ ।
ಓಂ ನಿರಂಜನಾಯ ನಮಃ ।
ಓಂ ನಾಮರೂಪಾಯ ನಮಃ ।
ಓಂ ಶಮಧುರಾಯ ನಮಃ ।
ಓಂ ಕಾಮಚಾರಿಣೇ ನಮಃ ।(ಕಾಮಜಾರಯೇ)
ಓಂ ಕಲಾಧರಾಯ ನಮಃ ।
ಓಂ ಜಾಮ್ಬೂನದಪ್ರಭಾಯ ನಮಃ ।
ಓಂ ಜಾಗ್ರಜ್ಜನ್ಮಾದಿರಹಿತಾಯ ನಮಃ । (ಜಾಗ್ರತೇ, ಜನ್ಮಾದಿರಹಿತಾಯ) 450 ।

ಓಂ ಉಜ್ಜ್ವಲಾಯ ನಮಃ ।
ಓಂ ಸರ್ವಜನ್ತೂನಾಂ ಜನಕಾಯ ನಮಃ । (ಸರ್ವಜನ್ತುಜನಕಾಯ)
ಓಂ ಜನ್ಮದುಃಖಾಪನೋದನಾಯ ನಮಃ ।
ಓಂ ಪಿನಾಕಪಾಣಯೇ ನಮಃ ।
ಓಂ ಅಕ್ರೋಧಾಯ ನಮಃ ।
ಓಂ ಪಿಂಗಲಾಯತಲೋಚನಾಯ ನಮಃ ।
ಓಂ ಪರಮಾತ್ಮನೇ ನಮಃ ।
ಓಂ ಪಶುಪತಯೇ ನಮಃ ।
ಓಂ ಪಾವನಾಯ ನಮಃ । (ಪಾಪನಾಶಕಾಯ)
ಓಂ ಪ್ರಮಥಾಧಿಪಾಯ ನಮಃ । 460 ।

ಓಂ ಪ್ರಣವಾಯ ನಮಃ । (ಪ್ರಣುತಾಯ)
ಓಂ ಕಾಮದಾಯ ನಮಃ ।
ಓಂ ಕಾನ್ತಾಯ ನಮಃ ।
ಓಂ ಶ್ರೀಪ್ರದಾಯ ನಮಃ । (ಶ್ರೀದೇವೀದಿವ್ಯಲೋಚನಾಯ)
ಓಂ ದಿವ್ಯಲೋಚನಾಯ ನಮಃ ।
ಓಂ ಪ್ರಣತಾರ್ತಿಹರಾಯ ನಮಃ ।
ಓಂ ಪ್ರಾಣಾಯ ನಮಃ ।
ಓಂ ಪರಂಜ್ಯೋತಿಷೇ ನಮಃ ।
ಓಂ ಪರಾತ್ಪರಾಯ ನಮಃ ।
ಓಂ ತುಷ್ಟಾಯ ನಮಃ । 470 ।

ಓಂ ತುಹಿನಶೈಲಾಧಿವಾಸಾಯ ನಮಃ ।
ಓಂ ಸ್ತೋತೃವರಪ್ರದಾಯ ನಮಃ । (ಸ್ತೋತ್ರವರಪ್ರಿಯಾಯ)
ಓಂ ಇಷ್ಟಕಾಮ್ಯಾರ್ಥಫಲದಾಯ ನಮಃ ।
ಓಂ ಸೃಷ್ಟಿಕರ್ತ್ರೇ ನಮಃ ।
ಓಂ ಮರುತ್ಪತಯೇ ನಮಃ ।
ಓಂ ಭೃಗ್ವತ್ರಿಕಣ್ವಜಾಬಾಲಿಹೃತ್ಪದ್ಮಾಹಿಮದೀಧಿತಯೇ ನಮಃ ।
ಓಂ (ಭಾರ್ಗವಾಂಗೀರಸಾತ್ರೇಯನೇತ್ರಕುಮುದತುಹಿನದೀಧಿತಯೇ)
ಓಂ ಕ್ರತುಧ್ವಂಸಿನೇ ನಮಃ ।
ಓಂ ಕ್ರತುಮುಖಾಯ ನಮಃ ।
ಓಂ ಕ್ರತುಕೋಟಿಫಲಪ್ರದಾಯ ನಮಃ । 480 ।

ಓಂ ಕ್ರತವೇ ನಮಃ ।
ಓಂ ಕ್ರತುಮಯಾಯ ನಮಃ ।
ಓಂ ಕ್ರೂರದರ್ಪಘ್ನಾಯ ನಮಃ ।
ಓಂ ವಿಕ್ರಮಾಯ ನಮಃ ।
ಓಂ ವಿಭವೇ ನಮಃ ।
ಓಂ ದಧೀಚಿಹೃದಯಾನನ್ದಾಯ ನಮಃ ।
ಓಂ ದಧೀಚ್ಯಾದಿಸುಪಾಲಕಾಯ ನಮಃ । (ದಧೀಚಿಚ್ಛವಿಪಾಲಕಾಯ)
ಓಂ ದಧೀಚಿವಾಂಛಿತಸಖಾಯ ನಮಃ ।
ಓಂ ದಧೀಚಿವರದಾಯ ನಮಃ ।
ಓಂ ಅನಘಾಯ ನಮಃ । 490 ।

ಓಂ ಸತ್ಪಥಕ್ರಮವಿನ್ಯಾಸಾಯ ನಮಃ ।
ಓಂ ಜಟಾಮಂಡಲಮಂಡಿತಾಯ ನಮಃ ।
ಓಂ ಸಾಕ್ಷಿತ್ರಯೀಮಯಾಯ ನಮಃ । (ಸಾಕ್ಷತ್ರಯೀಮಯಾಯ)
ಓಂ ಚಾರುಕಲಾಧರಕಪರ್ದಭೃತೇ ನಮಃ ।
ಓಂ ಮಾರ್ಕಂಡೇಯಮುನಿಪ್ರೀತಾಯ ನಮಃ । (ಮಾರ್ಕಂಡೇಯಮುನಿಪ್ರಿಯಾಯ)
ಓಂ ಮೃಡಾಯ ನಮಃ ।
ಓಂ ಜಿತಪರೇತರಾಜೇ ನಮಃ ।
ಓಂ ಮಹೀರಥಾಯ ನಮಃ ।
ಓಂ ವೇದಹಯಾಯ ನಮಃ ।
ಓಂ ಕಮಲಾಸನಸಾರಥಯೇ ನಮಃ । 500 ।

ಓಂ ಕೌಂಡಿನ್ಯವತ್ಸವಾತ್ಸಲ್ಯಾಯ ನಮಃ ।
ಓಂ ಕಾಶ್ಯಪೋದಯದರ್ಪಣಾಯ ನಮಃ ।
ಓಂ ಕಣ್ವಕೌಶಿಕದುರ್ವಾಸಾಹೃದ್ಗುಹಾನ್ತರ್ನಿಧಯೇ ನಮಃ ।
ಓಂ ನಿಜಾಯ ನಮಃ ।
ಓಂ ಕಪಿಲಾರಾಧನಪ್ರೀತಾಯ ನಮಃ ।
ಓಂ ಕರ್ಪೂರಧವಲದ್ಯುತಯೇ ನಮಃ ।
ಓಂ ಕರುಣಾವರುಣಾಯ ನಮಃ ।
ಓಂ ಕಾಳೀನಯನೋತ್ಸವಸಂಗರಾಯ ನಮಃ ।
ಓಂ ಘೃಣೈಕನಿಲಯಾಯ ನಮಃ ।
ಓಂ ಗೂಢತನವೇ ನಮಃ । 510 ।

ಓಂ ಮುರಹರಪ್ರಿಯಾಯ ನಮಃ । (ಮಯಹರಿಪ್ರಿಯಾಯ)
ಓಂ ಗಣಾಧಿಪಾಯ ನಮಃ ।
ಓಂ ಗುಣನಿಧಯೇ ನಮಃ ।
ಓಂ ಗಮ್ಭೀರಾಂಚಿತವಾಕ್ಪತಯೇ ನಮಃ ।
ಓಂ ವಿಘ್ನನಾಶಾಯ ನಮಃ ।
ಓಂ ವಿಶಾಲಾಕ್ಷಾಯ ನಮಃ ।
ಓಂ ವಿಘ್ನರಾಜಾಯ ನಮಃ ।
ಓಂ ವಿಶೇಷವಿದೇ ನಮಃ ।
ಓಂ ಸಪ್ತಯಜ್ಞಯಜಾಯ ನಮಃ ।
ಓಂ ಸಪ್ತಜಿಹ್ವಾಯ ನಮಃ । (ಸಪ್ತಜಿಹ್ವರಸನಾಸಂಹಾರಾಯ) 520 ।

ಓಂ ಜಿಹ್ವಾತಿಸಂವರಾಯ ನಮಃ ।
ಓಂ ಅಸ್ಥಿಮಾಲಾಽಽವಿಲಶಿರಸೇ ನಮಃ ।
ಓಂ ವಿಸ್ತಾರಿತಜಗದ್ಭುಜಾಯ ನಮಃ ।
ಓಂ ನ್ಯಸ್ತಾಖಿಲಸ್ರಜಸ್ತೋಕವಿಭವಾಯ ನಮಃ । (ವ್ಯಸ್ತಾಖಿಲಸ್ರಜೇ ಅಸ್ತೋಕವಿಭವಾಯ)
ಓಂ ಪ್ರಭವೇ ನಮಃ ।
ಓಂ ಈಶ್ವರಾಯ ನಮಃ ।
ಓಂ ಭೂತೇಶಾಯ ನಮಃ ।
ಓಂ ಭುವನಾಧಾರಾಯ ನಮಃ ।
ಓಂ ಭೂತಿದಾಯ ನಮಃ ।
ಓಂ ಭೂತಿಭೂಷಣಾಯ ನಮಃ । 530 ।

ಓಂ ಭೂತಾತ್ಮಕಾತ್ಮಕಾಯ ನಮಃ । (ಭೂಸ್ಥಿತಜೀವಾತ್ಮಕಾಯ)
ಓಂ ಭೂರ್ಭುವಾದಿ ಕ್ಷೇಮಕರಾಯ ನಮಃ ।
ಓಂ ಶಿವಾಯ ನಮಃ ।
ಓಂ ಅಣೋರಣೀಯಸೇ ನಮಃ ।
ಓಂ ಮಹತೋ ಮಹೀಯಸೇ ನಮಃ ।
ಓಂ ವಾಗಗೋಚರಾಯ ನಮಃ ।
ಓಂ ಅನೇಕವೇದವೇದಾನ್ತತತ್ತ್ವಬೀಜಾಯ ನಮಃ ।
ಓಂ ತಪೋನಿಧಯೇ ನಮಃ ।
ಓಂ ಮಹಾವನವಿಲಾಸಾಯ ನಮಃ ।
ಓಂ ಅತಿಪುಣ್ಯನಾಮ್ನೇ ನಮಃ । 540 ।

ಓಂ ಸದಾಶುಚಯೇ ನಮಃ ।
ಓಂ ಮಹಿಷಾಸುರಮರ್ದಿನ್ಯಾಃ ನಯನೋತ್ಸವಸಂಗರಾಯ ನಮಃ ।
ಓಂ ಶಿತಿಕಂಠಾಯ ನಮಃ ।
ಓಂ ಶಿಲಾದಾದಿ ಮಹರ್ಷಿನತಿಭಾಜನಾಯ ನಮಃ । (ಶಿಲಾದಪ್ರಸನ್ನಹಸನ್ನತಭಾಜನಾಯ)
ಓಂ ಗಿರೀಶಾಯ ನಮಃ ।
ಓಂ ಗೀಷ್ಪತಯೇ ನಮಃ ।
ಓಂ ಗೀತವಾದ್ಯನೃತ್ಯಸ್ತುತಿಪ್ರಿಯಾಯ ನಮಃ । ನಮಃ । (ಸ್ತುತಿಗೀತವಾದ್ಯವೃತ್ತಪ್ರಿಯಾಯ)
ಓಂ ಸುಕೃತಿಭಿಃ ಅಂಗೀಕೃತಾಯ ನಮಃ । (ಅಂಗೀಕೃತಸುಕೃತಿನೇ)
ಓಂ ಶೃಂಗಾರರಸಜನ್ಮಭುವೇ ನಮಃ ।
ಓಂ ಭೃಂಗೀತಾಂಡವಸನ್ತುಷ್ಠಾಯ ನಮಃ । 550 ।

ಓಂ ಮಂಗಲಾಯ ನಮಃ ।
ಓಂ ಮಂಗಲಪ್ರದಾಯ ನಮಃ ।
ಓಂ ಮುಕ್ತೇನ್ದ್ರನೀಲತಾಟಂಕಾಯ ನಮಃ ।
ಓಂ ಮುಕ್ತಾಹಾರವಿಭೂಷಿತಾಯ ನಮಃ । (ಈಶ್ವರಾಯ)
ಓಂ ಸಕ್ತಸಜ್ಜನಸದ್ಭಾವಾಯ ನಮಃ ।
ಓಂ ಭುಕ್ತಿಮುಕ್ತಿಫಲಪ್ರದಾಯ ನಮಃ ।
ಓಂ ಸುರೂಪಾಯ ನಮಃ ।
ಓಂ ಸುನ್ದರಾಯ ನಮಃ ।
ಓಂ ಶುಕ್ಲಾಯ ನಮಃ ।
ಓಂ ಧರ್ಮಾಯ ನಮಃ । 560 ।

ಓಂ ಸುಕೃತವಿಗ್ರಹಾಯ ನಮಃ ।
ಓಂ ಜಿತಾಮರದ್ರುಮಾಯ ನಮಃ ।
ಓಂ ಸರ್ವದೇವರಾಜಾಯ ನಮಃ ।
ಓಂ ಅಸಮೇಕ್ಷಣಾಯ ನಮಃ ।
ಓಂ ದಿವಸ್ಪತಿಸಹಸ್ರಾಕ್ಷವೀಕ್ಷಣಾವಳಿತೋಷಕಾಯ ನಮಃ । (ವೀಕ್ಷಣಸ್ತುತಿತೋಷಣಾಯ)
ಓಂ ದಿವ್ಯನಾಮಾಮೃತರಸಾಯ ನಮಃ ।
ಓಂ ದಿವಾಕರಪತಯೇ ನಮಃ । (ದಿವೌಕಃಪತಯೇ)
ಓಂ ಪ್ರಭವೇ ನಮಃ ।
ಓಂ ಪಾವಕಪ್ರಾಣಸನ್ಮಿತ್ರಾಯ ನಮಃ ।
ಓಂ ಪ್ರಖ್ಯಾತೋರ್ಧ್ವಜ್ವಲನ್ಮಹಸೇ ನಮಃ । (ಪ್ರಖ್ಯಾತಾಯ, ಊರ್ಧ್ವಜ್ವಲನ್ಮಹಸೇ) 570 ।

ಓಂ ಪ್ರಕೃಷ್ಟಭಾನವೇ ನಮಃ ।
ಓಂ ಪುರುಷಾಯ ನಮಃ ।
ಓಂ ಪುರೋಡಾಶಭುಜೇ ಈಶ್ವರಾಯ ನಮಃ ।
ಓಂ ಸಮವರ್ತಿನೇ ನಮಃ ।
ಓಂ ಪಿತೃಪತಯೇ ನಮಃ ।
ಓಂ ಧರ್ಮರಾಟ್ಶಮನಾಯ ನಮಃ । (ಧರ್ಮರಾಜಾಯ, ದಮನಾಯ)
ಓಂ ಯಮಿನೇ ನಮಃ ।
ಓಂ ಪಿತೃಕಾನನಸನ್ತುಷ್ಟಾಯ ನಮಃ ।
ಓಂ ಭೂತನಾಯಕನಾಯಕಾಯ ನಮಃ ।
ಓಂ ನಯಾನ್ವಿತಾಯ ನಮಃ । (ನತಾನುಯಾಯಿನೇ) 580 ।

ಓಂ ಸುರಪತಯೇ ನಮಃ ।
ಓಂ ನಾನಾಪುಣ್ಯಜನಾಶ್ರಯಾಯ ನಮಃ ।
ಓಂ ನೈರೃತ್ಯಾದಿ ಮಹಾರಾಕ್ಷಸೇನ್ದ್ರಸ್ತುತಯಶೋಽಮ್ಬುಧಯೇ ನಮಃ ।
ಓಂ ಪ್ರಚೇತಸೇ ನಮಃ ।
ಓಂ ಜೀವನಪತಯೇ ನಮಃ ।
ಓಂ ಧೃತಪಾಶಾಯ ನಮಃ । (ಜಿತಪಾಶಾಯ)
ಓಂ ದಿಗೀಶ್ವರಾಯ ನಮಃ ।
ಓಂ ಧೀರೋದಾರಗುಣಾಮ್ಭೋಧಿಕೌಸ್ತುಭಾಯ ನಮಃ ।
ಓಂ ಭುವನೇಶ್ವರಾಯ ನಮಃ ।
ಓಂ ಸದಾನುಭೋಗಸಮ್ಪೂರ್ಣಸೌಹಾರ್ದಾಯ ನಮಃ । (ಸದಾನುಭೋಗಸಮ್ಪೂರ್ಣಸೌಹೃದಾಯ) 590 ।

ಓಂ ಸುಮನೋಜ್ಜ್ವಲಾಯ ನಮಃ ।
ಓಂ ಸದಾಗತಯೇ ನಮಃ ।
ಓಂ ಸಾರರಸಾಯ ನಮಃ ।
ಓಂ ಸಜಗತ್ಪ್ರಾಣಜೀವನಾಯ ನಮಃ ।
ಓಂ ರಾಜರಾಜಾಯ ನಮಃ ।
ಓಂ ಕಿನ್ನರೇಶಾಯ ನಮಃ ।
ಓಂ ಕೈಲಾಸಸ್ಥಾಯ ನಮಃ ।
ಓಂ ಧನಪ್ರದಾಯ ನಮಃ ।
ಓಂ ಯಕ್ಷೇಶ್ವರಸಖಾಯ ನಮಃ ।
ಓಂ ಕುಕ್ಷಿನಿಕ್ಷಿಪ್ತಾನೇಕವಿಸ್ಮಯಾಯ ನಮಃ । 600 ।

ಓಂ ಈಶಾನಾಯ ನಮಃ । (ಈಶ್ವರಾಯ)
ಓಂ ಸರ್ವವಿದ್ಯಾನಾಮೀಶ್ವರಾಯ ನಮಃ । (ಸರ್ವವಿದ್ಯೇಶಾಯ)
ಓಂ ವೃಷಲಾಂಛನಾಯ ನಮಃ ।
ಓಂ ಇನ್ದ್ರಾದಿದೇವವಿಲಸನ್ಮೌಲಿರಮ್ಯಪದಾಮ್ಬುಜಾಯ ನಮಃ ।
ಓಂ ವಿಶ್ವಕರ್ಮಾಽಽಶ್ರಯಾಯ ನಮಃ ।
ಓಂ ವಿಶ್ವತೋಬಾಹವೇ ನಮಃ ।
ಓಂ ವಿಶ್ವತೋಮುಖಾಯ ನಮಃ ।
ಓಂ ವಿಶ್ವತಃ ಪ್ರಮದಾಯ ನಮಃ ।
ಓಂ ವಿಶ್ವನೇತ್ರಾಯ ನಮಃ ।
ಓಂ ವಿಶ್ವೇಶ್ವರಾಯ ನಮಃ । 610 ।

ಓಂ ವಿಭವೇ ನಮಃ ।
ಓಂ ಸಿದ್ಧಾನ್ತಾಯ ನಮಃ ।
ಓಂ ಸಿದ್ಧಸಂಕಲ್ಪಾಯ ನಮಃ ।
ಓಂ ಸಿದ್ಧಗನ್ಧರ್ವಸೇವಿತಾಯ ನಮಃ ।
ಓಂ ಸಿದ್ಧಿದಾಯ ನಮಃ ।
ಓಂ ಶುದ್ಧಹೃದಯಾಯ ನಮಃ ।
ಓಂ ಸದ್ಯೋಜಾತಾನನಾಯ ನಮಃ ।
ಓಂ ಶಿವಾಯ ನಮಃ ।
ಓಂ ಶ್ರೀಮಯಾಯ ನಮಃ ।
ಓಂ ಶ್ರೀಕಟಾಕ್ಷಾಂಗಾಯ ನಮಃ । 620 ।

ಓಂ ಶ್ರೀನಾಮ್ನೇ ನಮಃ ।
ಓಂ ಶ್ರೀಗಣೇಶ್ವರಾಯ ನಮಃ ।
ಓಂ ಶ್ರೀದಾಯ ನಮಃ ।
ಓಂ ಶ್ರೀವಾಮದೇವಾಸ್ಯಾಯ ನಮಃ ।
ಓಂ ಶ್ರೀಕಂಠಾಯ ನಮಃ । (ಶ್ರಿಯೈ)
ಓಂ ಶ್ರೀಪ್ರಿಯಂಕರಾಯ ನಮಃ ।
ಓಂ ಘೋರಾಘಧ್ವಾನ್ತಮಾರ್ತಾಂಡಾಯ ನಮಃ ।
ಓಂ ಘೋರೇತರಫಲಪ್ರದಾಯ ನಮಃ ।
ಓಂ ಘೋರಘೋರಮಹಾಯನ್ತ್ರರಾಜಾಯ ನಮಃ ।
ಓಂ ಘೋರಮುಖಾಮ್ಬುಜಾಯ ನಮಃ । ನಮಃ । (ಘೋರಮುಖಾಮ್ಬುಜಾತಾಯ) 630 ।

ಓಂ ಸುಷಿರಸುಪ್ರೀತತತ್ತ್ವಾದ್ಯಾಗಮಜನ್ಮಭುವೇ ನಮಃ ।
ಓಂ ತತ್ತ್ವಮಸ್ಯಾದಿ ವಾಕ್ಯಾರ್ಥಾಯ ನಮಃ ।
ಓಂ ತತ್ಪೂರ್ವಮುಖಮಂಡಿತಾಯ ನಮಃ ।
ಓಂ ಆಶಾಪಾಶವಿನಿರ್ಮುಕ್ತಾಯ ನಮಃ ।
ಓಂ ಶೇಷಭೂಷಣಭೂಷಿತಾಯ ನಮಃ । (ಶುಭಭೂಷಣಭೂಷಿತಾಯ)
ಓಂ ದೋಷಾಕರಲಸನ್ಮೌಲಯೇ ನಮಃ ।
ಓಂ ಈಶಾನಮುಖನಿರ್ಮಲಾಯ ನಮಃ ।
ಓಂ ಪಂಚವಕ್ತ್ರಾಯ ನಮಃ ।
ಓಂ ದಶಭುಜಾಯ ನಮಃ ।
ಓಂ ಪಂಚಾಶದ್ವರ್ಣನಾಯಕಾಯ ನಮಃ । 640 ।

ಓಂ ಪಂಚಾಕ್ಷರಯುತಾಯ ನಮಃ ।
ಓಂ ಪಂಚಾಪಂಚಸುಲೋಚನಾಯ ನಮಃ ।
ಓಂ ವರ್ಣಾಶ್ರಮಗುರವೇ ನಮಃ ।
ಓಂ ಸರ್ವವರ್ಣಾಧಾರಾಯ ನಮಃ ।
ಓಂ ಪ್ರಿಯಂಕರಾಯ ನಮಃ ।
ಓಂ ಕರ್ಣಿಕಾರಾರ್ಕದುತ್ತೂರಪೂರ್ಣಪೂಜಾಫಲಪ್ರದಾಯ ನಮಃ ।
ಓಂ ಯೋಗೀನ್ದ್ರಹೃದಯಾನನ್ದಾಯ ನಮಃ ।
ಓಂ ಯೋಗಿನೇ ನಮಃ । (ಯೋಗಾಯ)
ಓಂ ಯೋಗವಿದಾಂ ವರಾಯ ನಮಃ ।
ಓಂ ಯೋಗಧ್ಯಾನಾದಿಸನ್ತುಷ್ಟಾಯ ನಮಃ । 650 ।

ಓಂ ರಾಗಾದಿರಹಿತಾಯ ನಮಃ ।
ಓಂ ರಮಾಯ ನಮಃ ।
ಓಂ ಭವಾಮ್ಭೋಧಿಪ್ಲವಾಯ ನಮಃ ।
ಓಂ ಬನ್ಧಮೋಚಕಾಯ ನಮಃ ।
ಓಂ ಭದ್ರದಾಯಕಾಯ ನಮಃ ।
ಓಂ ಭಕ್ತಾನುರಕ್ತಾಯ ನಮಃ ।
ಓಂ ಭವ್ಯಾಯ ನಮಃ ।
ಓಂ ಸದ್ಭಕ್ತಿದಾಯ ನಮಃ ।
ಓಂ ಭಕ್ತಿಭಾವನಾಯ ನಮಃ ।
ಓಂ ಅನಾದಿನಿಧನಾಯ ನಮಃ । 660 ।

ಓಂ ಅಭೀಷ್ಟಾಯ ನಮಃ ।
ಓಂ ಭೀಮಕಾನ್ತಾಯ ನಮಃ ।
ಓಂ ಅರ್ಜುನಾಯ ನಮಃ ।
ಓಂ ಬಲಾಯ ನಮಃ ।
ಓಂ ಅನಿರುದ್ಧಾಯ ನಮಃ ।
ಓಂ ಸತ್ಯವಾದಿನೇ ನಮಃ ।
ಓಂ ಸದಾನನ್ದಾಶ್ರಯಾಯ ನಮಃ ।
ಓಂ ಅನಘಾಯ ನಮಃ ।
ಓಂ ಸರ್ವವಿದ್ಯಾನಾಮಾಲಯಾಯ ನಮಃ । (ಸರ್ವವಿದ್ಯಾಲಯಾಯ)
ಓಂ ಸರ್ವಕರ್ಮಣಾಮಾಧಾರಾಯ ನಮಃ । (ಸರ್ವಕರ್ಮಧಾರಾಯ) 670 ।

ಓಂ ಸರ್ವಲೋಕಾನಾಮಾಲೋಕಾಯ ನಮಃ । (ಸರ್ವಲೋಕಾಲೋಕಾಯ)
ಓಂ ಮಹಾತ್ಮನಾಮಾವಿರ್ಭಾವಾಯ ನಮಃ ।
ಓಂ ಇಜ್ಯಾಪೂರ್ತೇಷ್ಟಫಲದಾಯ ನಮಃ ।
ಓಂ ಇಚ್ಛಾಶಕ್ತ್ಯಾದಿಸಂಶ್ರಯಾಯ ನಮಃ ।
ಓಂ ಇನಾಯ ನಮಃ ।
ಓಂ ಸರ್ವಾಮರಾರಾಧ್ಯಾಯ ನಮಃ ।
ಓಂ ಈಶ್ವರಾಯ ನಮಃ ।
ಓಂ ಜಗದೀಶ್ವರಾಯ ನಮಃ ।
ಓಂ ರುಂಡಪಿಂಗಲಮಧ್ಯಸ್ಥಾಯ ನಮಃ ।
ಓಂ ರುದ್ರಾಕ್ಷಾಂಚಿತಕನ್ಧರಾಯ ನಮಃ । (ರುದ್ರಶ್ರಿಯೇ, ನರವಾಚಕಾಯ) 680 ।

ಓಂ
ಓಂ ರುಂಡಿತಾಧಾರಭಕ್ತ್ಯಾದಿರೀಡಿತಾಯ ನಮಃ ।
ಓಂ ಸವನಾಶನಾಯ ನಮಃ ।
ಓಂ ಉರುವಿಕ್ರಮಬಾಹುಲ್ಯಾಯ ನಮಃ ।
ಓಂ ಉರ್ವ್ಯಾಧಾರಾಯ ನಮಃ ।
ಓಂ ಧುರನ್ಧರಾಯ ನಮಃ ।
ಓಂ ಉತ್ತರೋತ್ತರಕಲ್ಯಾಣಾಯ ನಮಃ ।
ಓಂ ಉತ್ತಮೋತ್ತಮನಾಯಕಾಯ ನಮಃ । (ಉತ್ತಮಾಯ ಉತ್ತಮನಾಯಕಾಯ)
ಓಂ ಊರುಜಾನುತಡಿದ್ವೃನ್ದಾಯ ನಮಃ ।
ಓಂ ಊರ್ಧ್ವರೇತಸೇ ನಮಃ । 690 ।

ಓಂ ಮನೋಹರಾಯ ನಮಃ ।
ಓಂ ಊಹಿತಾನೇಕವಿಭವಾಯ ನಮಃ ।
ಓಂ ಊಹಿತಾಮ್ನಾಯಮಂಡಲಾಯ ನಮಃ ।
ಓಂ ಋಷೀಶ್ವರಸ್ತುತಿಪ್ರೀತಾಯ ನಮಃ ।
ಓಂ ಋಷಿವಾಕ್ಯಪ್ರತಿಷ್ಠಿತಾಯ ನಮಃ ।
ಓಂ ೠಗಾದಿನಿಗಮಾಧಾರಾಯ ನಮಃ ।
ಓಂ ಋಜುಕರ್ಮಣೇ ನಮಃ । (ಋಜಿಚರ್ಮಣೇ)
ಓಂ ಮನೋಜವಾಯ ನಮಃ । (ಮನಋಜವೇ)
ಓಂ ರೂಪಾದಿವಿಷಯಾಧಾರಾಯ ನಮಃ ।
ಓಂ ರೂಪಾತೀತಾಯ ನಮಃ । 700 ।

ಓಂ ಋಷೀಶ್ವರಾಯ ನಮಃ ।
ಓಂ ರೂಪಲಾವಣ್ಯಸಮ್ಯುಕ್ತಾಯ ನಮಃ ।
ಓಂ ರೂಪಾನನ್ದಸ್ವರೂಪಧೃತೇ ನಮಃ ।
ಓಂ ಲುಲಿತಾನೇಕಸಂಗ್ರಾಮಾಯ ನಮಃ ।
ಓಂ ಲುಪ್ಯಮಾನರಿಪುವಜ್ರಾಯ ನಮಃ ।
ಓಂ ಲುಪ್ತಕ್ರೂರಾನ್ಧಕಹರಾಯಯ ನಮಃ ।
ಓಂ ಲೂಕಾರಾಂಚಿತಯನ್ತ್ರಧೃತೇ ನಮಃ ।
ಓಂ ಲೂಕಾರಾದಿವ್ಯಾಧಿಹರಾಯ ನಮಃ ।
ಓಂ ಲೂಸ್ವರಾಂಚಿತಯನ್ತ್ರಯುಜೇ ನಮಃ । (ಲೂಸ್ವರಾಂಚಿತಯನ್ತ್ರಯೋಜನಾಯ)
ಓಂ ಲೂಶಾದಿ ಗಿರಿಶಾಯ ನಮಃ । 710 ।

ಓಂ ಪಕ್ಷಾಯ ನಮಃ ।
ಓಂ ಖಲವಾಚಾಮಗೋಚರಾಯ ನಮಃ ।
ಓಂ ಏಷ್ಯಮಾಣಾಯ ನಮಃ ।
ಓಂ ನತಜನ ಏಕಚ್ಚಿತಾಯ ನಮಃ । (ನತಜನಾಯ, ಏಕಚ್ಚಿತಾಯ)
ಓಂ ದೃಢವ್ರತಾಯ ನಮಃ ।
ಓಂ ಏಕಾಕ್ಷರಮಹಾಬೀಜಾಯ ನಮಃ ।
ಓಂ ಏಕರುದ್ರಾಯ ನಮಃ ।
ಓಂ ಅದ್ವಿತೀಯಕಾಯ ನಮಃ ।
ಓಂ ಐಶ್ವರ್ಯವರ್ಣನಾಮಾಂಕಾಯ ನಮಃ ।
ಓಂ ಐಶ್ವರ್ಯಪ್ರಕರೋಜ್ಜ್ವಲಾಯ ನಮಃ । 720 ।

ಓಂ ಐರಾವಣಾದಿ ಲಕ್ಷ್ಮೀಶಾಯ ನಮಃ ।
ಓಂ ಐಹಿಕಾಮುಷ್ಮಿಕಪ್ರದಾತ್ರೇ ನಮಃ ।
ಓಂ ಓಷಧೀಶಶಿಖಾರತ್ನಾಯ ನಮಃ ।
ಓಂ ಓಂಕಾರಾಕ್ಷರಸಮ್ಯುತಾಯ ನಮಃ ।
ಓಂ ಸಕಲದೇವಾನಾಮೋಕಸೇ ನಮಃ । (ಸಕಲದಿವೌಕಸೇ)
ಓಂ ಓಜೋರಾಶಯೇ ನಮಃ ।
ಓಂ ಅಜಾದ್ಯಜಾಯ ನಮಃ । (ಅಜಾಡ್ಯಜಾಯ)
ಓಂ ಔದಾರ್ಯಜೀವನಪರಾಯ ನಮಃ ।
ಓಂ ಔಚಿತ್ಯಮಣಿಜನ್ಮಭುವೇ ನಮಃ ।
ಓಂ ಉದಾಸೀನೈಕಗಿರಿಶಾಯ ನಮಃ । (ಉದಾಸೀನಾಯ, ಏಕಗಿರಿಶಾಯ) 730 ।

ಓಂ ಉತ್ಸವೋತ್ಸವಕಾರಣಾಯ ನಮಃ । (ಉತ್ಸವಾಯ, ಉತ್ಸವಕಾರಣಾಯ)
ಓಂ ಅಂಗೀಕೃತಷಡಂಗಾಂಗಾಯ ನಮಃ ।
ಓಂ ಅಂಗಹಾರಮಹಾನಟಾಯ ನಮಃ ।
ಓಂ ಅಂಗಜಾಂಗಜಭಸ್ಮಾಂಗಾಯ ನಮಃ ।
ಓಂ ಮಂಗಲಾಯತವಿಗ್ರಹಾಯ ನಮಃ ।
ಓಂ ಕಃ ಕಿಂ ತ್ವದನು ದೇವೇಶಾಯ ನಮಃ ।
ಓಂ ಕಃ ಕಿನ್ನು ವರದಪ್ರದಾಯ ನಮಃ ।
ಓಂ ಕಃ ಕಿನ್ನು ಭಕ್ತಸನ್ತಾಪಹರಾಯ ನಮಃ ।
ಓಂ ಕಾರುಣ್ಯಸಾಗರಾಯ ನಮಃ ।
ಓಂ ಸ್ತೋತುಮಿಚ್ಛೂನಾಂ ಸ್ತೋತವ್ಯಾಯ ನಮಃ । 740 ।

ಓಂ ಶರಣಾರ್ಥಿನಾಂ ಮನ್ತವ್ಯಾಯ ನಮಃ । (ಸ್ಮರಣಾರ್ತಿನಾಂ ಮನ್ತವ್ಯಾಯ)
ಓಂ ಧ್ಯಾನೈಕನಿಷ್ಠಾನಾಂ ಧ್ಯೇಯಾಯ ನಮಃ ।
ಓಂ ಧಾಮ್ನಃ ಪರಮಪೂರಕಾಯ ನಮಃ । (ಧಾಮ್ನೇ, ಪರಮಪೂರಕಯ)
ಓಂ ಭಗನೇತ್ರಹರಾಯ ನಮಃ ।
ಓಂ ಪೂತಾಯ ನಮಃ ।
ಓಂ ಸಾಧುದೂಷಕಭೀಷಣಾಯ ನಮಃ । (ಸಾಧುದೂಷಣಭೀಷಣಾಯ ನಮಃ ।
ಓಂ ಭದ್ರಕಾಳೀಮನೋರಾಜಾಯ ನಮಃ ।
ಓಂ ಹಂಸಾಯ ನಮಃ ।
ಓಂ ಸತ್ಕರ್ಮಸಾರಥಯೇ ನಮಃ ।
ಓಂ ಸಭ್ಯಾಯ ನಮಃ । 750 ।

ಓಂ ಸಾಧವೇ ನಮಃ ।
ಓಂ ಸಭಾರತ್ನಾಯ ನಮಃ ।
ಓಂ ಸೌನ್ದರ್ಯಗಿರಿಶೇಖರಾಯ ನಮಃ ।
ಓಂ ಸುಕುಮಾರಾಯ ನಮಃ ।
ಓಂ ಸೌಖ್ಯಕರಾಯ ನಮಃ ।
ಓಂ ಸಹಿಷ್ಣವೇ ನಮಃ ।
ಓಂ ಸಾಧ್ಯಸಾಧನಾಯ ನಮಃ ।
ಓಂ ನಿರ್ಮತ್ಸರಾಯ ನಮಃ ।
ಓಂ ನಿಷ್ಪ್ರಪಂಚಾಯ ನಮಃ ।
ಓಂ ನಿರ್ಲೋಭಾಯ ನಮಃ । 760 ।

ಓಂ ನಿರ್ಗುಣಾಯ ನಮಃ ।
ಓಂ ನಯಾಯ ನಮಃ ।
ಓಂ ವೀತಾಭಿಮಾನಾಯ ನಮಃ । (ನಿರಭಿಮಾನಾಯ)
ಓಂ ನಿರ್ಜಾತಾಯ ನಮಃ ।
ಓಂ ನಿರಾತಂಕಾಯ ನಮಃ ।
ಓಂ ನಿರಂಜನಾಯ ನಮಃ ।
ಓಂ ಕಾಲತ್ರಯಾಯ ನಮಃ ।
ಓಂ ಕಲಿಹರಾಯ ನಮಃ ।
ಓಂ ನೇತ್ರತ್ರಯವಿರಾಜಿತಾಯ ನಮಃ ।
ಓಂ ಅಗ್ನಿತ್ರಯನಿಭಾಂಗಾಯ ನಮಃ । 770 ।

ಓಂ ಭಸ್ಮೀಕೃತಪುರತ್ರಯಾಯ ನಮಃ ।
ಓಂ ಕೃತಕಾರ್ಯಾಯ ನಮಃ ।
ಓಂ ವ್ರತಧರಾಯ ನಮಃ ।
ಓಂ ವ್ರತನಾಶಾಯ ನಮಃ ।
ಓಂ ಪ್ರತಾಪವತೇ ನಮಃ ।
ಓಂ ನಿರಸ್ತದುರ್ವಿಧಯೇ ನಮಃ ।
ಓಂ ನಿರ್ಗತಾಶಾಯ ನಮಃ ।
ಓಂ ನಿರ್ವಾಣನೀರಧಯೇ ನಮಃ ।
ಓಂ ಸರ್ವಹೇತೂನಾಂ ನಿದಾನಾಯ ನಮಃ ।
ಓಂ ನಿಶ್ಚಿತಾರ್ಥೇಶ್ವರೇಶ್ವರಾಯ ನಮಃ । 780 ।

ಓಂ ಅದ್ವೈತಶಾಮ್ಭವಮಹಸೇ ನಮಃ । (ಅದ್ವೈತಶಾಮ್ಭವಮಹತ್ತೇಜಸೇ)
ಓಂ ಸನಿರ್ವ್ಯಾಜಾಯ ನಮಃ । (ಅನಿರ್ವ್ಯಾಜಾಯ)
ಓಂ ಊರ್ಧ್ವಲೋಚನಾಯ ನಮಃ ।
ಓಂ ಅಪೂರ್ವಪೂರ್ವಾಯ ನಮಃ ।
ಓಂ ಪರಮಾಯ ನಮಃ । (ಯಸ್ಮೈ)
ಓಂ ಸಪೂರ್ವಾಯ ನಮಃ । (ಪೂರ್ವಸ್ಮೈ)
ಓಂ ಪೂರ್ವಪೂರ್ವದಿಶೇ ನಮಃ ।
ಓಂ ಅತೀನ್ದ್ರಿಯಾಯ ನಮಃ ।
ಓಂ ಸತ್ಯನಿಧಯೇ ನಮಃ ।
ಓಂ ಅಖಂಡಾನನ್ದವಿಗ್ರಹಾಯ ನಮಃ । 790 ।

ಓಂ ಆದಿದೇವಾಯ ನಮಃ ।
ಓಂ ಪ್ರಸನ್ನಾತ್ಮನೇ ನಮಃ ।
ಓಂ ಆರಾಧಕಜನೇಷ್ಟದಾಯ ನಮಃ । (ಆರಾಧಿತಜನೇಷ್ಟದಾಯ)
ಓಂ ಸರ್ವದೇವಮಯಾಯ ನಮಃ ।
ಓಂ ಸರ್ವಸ್ಮೈ ನಮಃ ।
ಓಂ ಜಗದ್ವ್ಯಾಸಾಯ ನಮಃ । (ಜಗದ್ವಾಸಸೇ)
ಓಂ ಸುಲಕ್ಷಣಾಯ ನಮಃ ।
ಓಂ ಸರ್ವಾನ್ತರಾತ್ಮನೇ ನಮಃ ।
ಓಂ ಸದೃಶಾಯ ನಮಃ ।
ಓಂ ಸರ್ವಲೋಕೈಕಪೂಜಿತಾಯ ನಮಃ । 800 ।

ಓಂ ಪುರಾಣಪುರುಷಾಯ ನಮಃ ।
ಓಂ ಪುಣ್ಯಾಯ ನಮಃ ।
ಓಂ ಪುಣ್ಯಶ್ಲೋಕಾಯ ನಮಃ ।
ಓಂ ಸುಧಾಮಯಾಯ ನಮಃ ।
ಓಂ ಪೂರ್ವಾಪರಜ್ಞಾಯ ನಮಃ ।
ಓಂ ಪುರಜಿತೇ ನಮಃ ।
ಓಂ ಪೂರ್ವದೇವಾಮರಾರ್ಚಿತಾಯ ನಮಃ ।
ಓಂ ಪ್ರಸನ್ನದರ್ಶಿತಮುಖಾಯ ನಮಃ ।
ಓಂ ಪನ್ನಗಾವಳಿಭೂಷಣಾಯ ನಮಃ ।
ಓಂ ಪ್ರಸಿದ್ಧಾಯ ನಮಃ । 810 ।

ಓಂ ಪ್ರಣತಾಧಾರಾಯ ನಮಃ ।
ಓಂ ಪ್ರಲಯೋದ್ಭೂತಕಾರಣಾಯ ನಮಃ ।
ಓಂ ಜ್ಯೋತಿರ್ಮಯಾಯ ನಮಃ ।
ಓಂ ಜ್ವಲದ್ದಂಷ್ಟ್ರಾಯ ನಮಃ ।
ಓಂ ಜ್ಯೋತಿರ್ಮಾಲಾವಳೀವೃತಾಯ ನಮಃ ।
ಓಂ ಜಾಜ್ಜ್ವಲ್ಯಮಾನಾಯ ನಮಃ ।
ಓಂ ಜ್ವಲನನೇತ್ರಾಯ ನಮಃ ।
ಓಂ ಜಲಧರದ್ಯುತಯೇ ನಮಃ ।
ಓಂ ಕೃಪಾಮ್ಭೋರಾಶಯೇ ನಮಃ ।
ಓಂ ಅಮ್ಲಾನಾಯ ನಮಃ । 820 ।

ಓಂ ವಾಕ್ಯಪುಷ್ಟಾಯ ನಮಃ ।
ಓಂ ಅಪರಾಜಿತಾಯ ನಮಃ ।
ಓಂ ಕ್ಷಪಾಕರಾಯ ನಮಃ ।
ಓಂ ಅರ್ಕಕೋಟಿಪ್ರಭಾಕರಾಯ ನಮಃ ।
ಓಂ ಕರುಣಾಕರಾಯ ನಮಃ ।
ಓಂ ಏಕಮೂರ್ತಯೇ ನಮಃ ।
ಓಂ ತ್ರಿಧಾಮೂರ್ತಯೇ ನಮಃ ।
ಓಂ ದಿವ್ಯಮೂರ್ತಯೇ ನಮಃ ।
ಓಂ ಅನಾಕುಲಾಯ ನಮಃ । ನಮಃ । (ದೀನಾನುಕೂಲಾಯ)
ಓಂ ಅನನ್ತಮೂರ್ತಯೇ ನಮಃ । 830 ।

ಓಂ ಅಕ್ಷೋಭ್ಯಾಯ ನಮಃ ।
ಓಂ ಕೃಪಾಮೂರ್ತಯೇ ನಮಃ ।
ಓಂ ಸುಕೀರ್ತಿಧೃತೇ ನಮಃ ।
ಓಂ ಅಕಲ್ಪಿತಾಮರತರವೇ ನಮಃ ।
ಓಂ ಅಕಾಮಿತಸುಕಾಮದುಹೇ ನಮಃ ।
ಓಂ ಅಚಿನ್ತಿತಮಹಾಚಿನ್ತಾಮಣಯೇ ನಮಃ ।
ಓಂ ದೇವಶಿಖಾಮಣಯೇ ನಮಃ ।
ಓಂ ಅತೀನ್ದ್ರಿಯಾಯ ನಮಃ ।
ಓಂ ಅಜಿತಾಯ ನಮಃ । (ಊರ್ಜಿತಾಯ)
ಓಂ ಪ್ರಾಂಶವೇ ನಮಃ । 840 ।

ಓಂ ಬ್ರಹ್ಮವಿಷ್ಣ್ವಾದಿವನ್ದಿತಾಯ ನಮಃ ।
ಓಂ ಹಂಸಾಯ ನಮಃ ।
ಓಂ ಮರೀಚಯೇ ನಮಃ ।
ಓಂ ಭೀಮಾಯ ನಮಃ ।
ಓಂ ರತ್ನಸಾನುಶರಾಸನಾಯ ನಮಃ ।
ಓಂ ಸಮ್ಭವಾಯ ನಮಃ ।
ಓಂ ಅತೀನ್ದ್ರಿಯಾಯ ನಮಃ ।
ಓಂ ವೈದ್ಯಾಯ ನಮಃ । (ವೈನ್ಯಾಯ)
ಓಂ ವಿಶ್ವರೂಪಿಣೇ ನಮಃ ।
ಓಂ ನಿರಂಜನಾಯ ನಮಃ । 850 ।

ಓಂ ವಸುದಾಯ ನಮಃ ।
ಓಂ ಸುಭುಜಾಯ ನಮಃ ।
ಓಂ ನೈಕಮಾಯಾಯ ನಮಃ ।
ಓಂ ಅವ್ಯಯಾಯ ನಮಃ । (ಭವ್ಯಾಯ)
ಓಂ ಪ್ರಮಾದನಾಯ ನಮಃ ।
ಓಂ ಅಗದಾಯ ನಮಃ ।
ಓಂ ರೋಗಹರ್ತ್ರೇ ನಮಃ ।
ಓಂ ಶರಾಸನವಿಶಾರದಾಯ ನಮಃ ।
ಓಂ ಮಾಯಾವಿಶ್ವಾದನಾಯ ನಮಃ । (ಮಾಯಿನೇ, ವಿಶ್ವಾದನಾಯ)
ಓಂ ವ್ಯಾಪಿನೇ ನಮಃ । 860 ।

ಓಂ ಪಿನಾಕಕರಸಮ್ಭವಾಯ ನಮಃ ।
ಓಂ ಮನೋವೇಗಾಯ ನಮಃ ।
ಓಂ ಮನೋರುಪಿಣೇ ನಮಃ ।
ಓಂ ಪೂರ್ಣಾಯ ನಮಃ ।
ಓಂ ಪುರುಷಪುಂಗವಾಯ ನಮಃ ।
ಓಂ ಶಬ್ದಾದಿಗಾಯ ನಮಃ ।
ಓಂ ಗಭೀರಾತ್ಮನೇ ನಮಃ ।
ಓಂ ಕೋಮಲಾಂಗಾಯ ನಮಃ ।
ಓಂ ಪ್ರಜಾಗರಾಯ ನಮಃ ।
ಓಂ ತ್ರಿಕಾಲಜ್ಞಾಯ ನಮಃ । 870 ।

ಓಂ ಮುನಯೇ ನಮಃ ।
ಓಂ ಸಾಕ್ಷಿಣೇ ನಮಃ ।
ಓಂ ಪಾಪಾರಯೇ ನಮಃ ।
ಓಂ ಸೇವಕಪ್ರಿಯಾಯ ನಮಃ ।
ಓಂ ಉತ್ತಮಾಯ ನಮಃ ।
ಓಂ ಸಾತ್ತ್ವಿಕಾಯ ನಮಃ ।
ಓಂ ಸತ್ಯಾಯ ನಮಃ ।
ಓಂ ಸತ್ಯಸನ್ಧಾಯ ನಮಃ ।
ಓಂ ನಿರಾಕುಲಾಯ ನಮಃ ।
ಓಂ ರಸಾಯ ನಮಃ । 880 ।

ಓಂ ರಸಜ್ಞಾಯ ನಮಃ ।
ಓಂ ಸಾರಜ್ಞಾಯ ನಮಃ ।
ಓಂ ಲೋಕಸಾರಾಯ ನಮಃ ।
ಓಂ ರಸಾತ್ಮಕಾಯ ನಮಃ ।
ಓಂ ಪೂಷಾದನ್ತಭಿದೇ ನಮಃ ।
ಓಂ ಅವ್ಯಗ್ರಾಯ ನಮಃ ।
ಓಂ ದಕ್ಷಯಜ್ಞನಿಷೂದನಾಯ ನಮಃ ।
ಓಂ ದೇವಾಗ್ರಣ್ಯೇ ನಮಃ ।
ಓಂ ಶಿವಧ್ಯಾನತತ್ಪರಾಯ ನಮಃ ।
ಓಂ ಪರಮಾಯ ನಮಃ । 890 ।

ಓಂ ಶುಭಾಯ ನಮಃ ।
ಓಂ ಜಯಾಯ ನಮಃ ।
ಓಂ ಜಯಾದಯೇ ನಮಃ । (ಜರಾರಯೇ)
ಓಂ ಸರ್ವಾಘಶಮನಾಯ ನಮಃ ।
ಓಂ ಭವಭಂಜನಾಯ ನಮಃ ।
ಓಂ ಅಲಂಕರಿಷ್ಣವೇ ನಮಃ ।
ಓಂ ಅಚಲಾಯ ನಮಃ ।
ಓಂ ರೋಚಿಷ್ಣವೇ ನಮಃ ।
ಓಂ ವಿಕ್ರಮೋತ್ತಮಾಯ ನಮಃ ।
ಓಂ ಶಬ್ದಗಾಯ ನಮಃ । 900 ।

ಓಂ ಪ್ರಣವಾಯ ನಮಃ ।
ಓಂ ವಾಯವೇ ನಮಃ । (ಮಾಯಿನೇ)
ಓಂ ಅಂಶುಮತೇ ನಮಃ ।
ಓಂ ಅನಲತಾಪಹೃತೇ ನಮಃ ।
ಓಂ ನಿರೀಶಾಯ ನಮಃ ।
ಓಂ ನಿರ್ವಿಕಲ್ಪಾಯ ನಮಃ ।
ಓಂ ಚಿದ್ರೂಪಾಯ ನಮಃ ।
ಓಂ ಜಿತಸಾಧ್ವಸಾಯ ನಮಃ ।
ಓಂ ಉತ್ತಾರಣಾಯ ನಮಃ ।
ಓಂ ದುಷ್ಕೃತಿಘ್ನೇ ನಮಃ । 910 ।

ಓಂ ದುರ್ಧರ್ಷಾಯ ನಮಃ ।
ಓಂ ದುಸ್ಸಹಾಯ ನಮಃ ।
ಓಂ ಅಭಯಾಯ ನಮಃ ।
ಓಂ ನಕ್ಷತ್ರಮಾಲಿನೇ ನಮಃ ।
ಓಂ ನಾಕೇಶಾಯ ನಮಃ ।
ಓಂ ಸ್ವಾಧಿಷ್ಠಾನಷಡಾಶ್ರಯಾಯ ನಮಃ ।
ಓಂ ಅಕಾಯಾಯ ನಮಃ ।
ಓಂ ಭಕ್ತಕಾಯಸ್ಥಾಯ ನಮಃ ।
ಓಂ ಕಾಲಜ್ಞಾನಿನೇ ನಮಃ ।
ಓಂ ಮಹಾನಟಾಯ ನಮಃ । 920 ।

ಓಂ ಅಂಶವೇ ನಮಃ ।
ಓಂ ಶಬ್ದಪತಯೇ ನಮಃ ।
ಓಂ ಯೋಗಿನೇ ನಮಃ ।
ಓಂ ಪವನಾಯ ನಮಃ ।
ಓಂ ಶಿಖಿಸಾರಥಯೇ ನಮಃ ।
ಓಂ ವಸನ್ತಾಯ ನಮಃ ।
ಓಂ ಮಾಧವಾಯ ನಮಃ ।
ಓಂ ಗ್ರೀಷ್ಮಾಯ ನಮಃ ।
ಓಂ ಪವನಾಯ ನಮಃ ।
ಓಂ ಪಾವನಾಯ ನಮಃ । 930 ।

ಓಂ ಅಮಲಾಯ ನಮಃ । (ಅನಲಾಯ)
ಓಂ ವಾರವೇ ನಮಃ ।
ಓಂ ವಿಶಲ್ಯಚತುರಾಯ ನಮಃ ।
ಓಂ ಶಿವಚತ್ವರಸಂಸ್ಥಿತಾಯ ನಮಃ ।
ಓಂ ಆತ್ಮಯೋಗಾಯ ನಮಃ ।
ಓಂ ಸಮಾಮ್ನಾಯತೀರ್ಥದೇಹಾಯ ನಮಃ ।
ಓಂ ಶಿವಾಲಯಾಯ ನಮಃ ।
ಓಂ ಮುಂಡಾಯ ನಮಃ ।
ಓಂ ವಿರೂಪಾಯ ನಮಃ ।
ಓಂ ವಿಕೃತಯೇ ನಮಃ । 940 ।

ಓಂ ದಂಡಾಯ ನಮಃ ।
ಓಂ ದಾನ್ತಾಯ ನಮಃ ।
ಓಂ ಗುಣೋತ್ತಮಾಯ ನಮಃ ।
ಓಂ ದೇವಾಸುರಗುರವೇ ನಮಃ ।
ಓಂ ದೇವಾಯ ನಮಃ ।
ಓಂ ದೇವಾಸುರನಮಸ್ಕೃತಾಯ ನಮಃ ।
ಓಂ ದೇವಾಸುರಮಹಾಮನ್ತ್ರಾಯ ನಮಃ ।
ಓಂ ದೇವಾಸುರಮಹಾಶ್ರಯಾಯ ನಮಃ ।
ಓಂ ದಿವ್ಯಾಯ ನಮಃ ।
ಓಂ ಅಚಿನ್ತ್ಯಾಯ ನಮಃ । 950 ।

ಓಂ ದೇವತಾಽಽತ್ಮನೇ ನಮಃ ।
ಓಂ ಈಶಾಯ ನಮಃ ।
ಓಂ ಅನೀಶಾಯ ನಮಃ ।
ಓಂ ನಗಾಗ್ರಗಾಯ ನಮಃ ।
ಓಂ ನನ್ದೀಶ್ವರಾಯ ನಮಃ ।
ಓಂ ನನ್ದಿಸಖ್ಯೇ ನಮಃ ।
ಓಂ ನನ್ದಿಸ್ತುತಪರಾಕ್ರಮಾಯ ನಮಃ ।
ಓಂ ನಗ್ನಾಯ ನಮಃ ।
ಓಂ ನಗವ್ರತಧರಾಯ ನಮಃ ।
ಓಂ ಪ್ರಲಯಾಕಾರರೂಪಧೃತೇ ನಮಃ । – ಪ್ರಲಯಕಾಲರೂಪದೃಶೇ ನಮಃ । 960 ।

ಓಂ ಸೇಶ್ವರಾಯ ನಮಃ । – ಸ್ವೇಶಾಯ
ಓಂ ಸ್ವರ್ಗದಾಯ ನಮಃ ।
ಓಂ ಸ್ವರ್ಗಗಾಯ ನಮಃ ।
ಓಂ ಸ್ವರಾಯ ನಮಃ ।
ಓಂ ಸರ್ವಮಯಾಯ ನಮಃ ।
ಓಂ ಸ್ವನಾಯ ನಮಃ ।
ಓಂ ಬೀಜಾಕ್ಷರಾಯ ನಮಃ ।
ಓಂ ಬೀಜಾಧ್ಯಕ್ಷಾಯ ನಮಃ ।
ಓಂ ಬೀಜಕರ್ತ್ರೇ ನಮಃ ।
ಓಂ ಧರ್ಮಕೃತೇ ನಮಃ । 970 ।

ಓಂ ಧರ್ಮವರ್ಧನಾಯ ನಮಃ ।
ಓಂ ದಕ್ಷಯಜ್ಞಮಹಾದ್ವೇಷಿಣೇ ನಮಃ ।
ಓಂ ವಿಷ್ಣುಕನ್ಧರಪಾತನಾಯ ನಮಃ ।
ಓಂ ಧೂರ್ಜಟಯೇ ನಮಃ ।
ಓಂ ಖಂಡಪರಶವೇ ನಮಃ ।
ಓಂ ಸಕಲಾಯ ನಮಃ ।
ಓಂ ನಿಷ್ಕಲಾಯ ನಮಃ ।
ಓಂ ಅಸಮಾಯ ನಮಃ । – ಅನಘಾಯ ನಮಃ ।
ಓಂ ಮೃಡಾಯ ನಮಃ ।
ಓಂ ನಟಾಯ ನಮಃ । 980 ।

ಓಂ ಪೂರಯಿತ್ರೇ ನಮಃ ।
ಓಂ ಪುಣ್ಯಕ್ರೂರಾಯ ನಮಃ ।
ಓಂ ಮನೋಜವಾಯ ನಮಃ ।
ಓಂ ಸದ್ಭೂತಾಯ ನಮಃ ।
ಓಂ ಸತ್ಕೃತಾಯ ನಮಃ ।
ಓಂ ಶಾನ್ತಾಯ ನಮಃ ।
ಓಂ ಕಾಲಕೂಟಾಯ ನಮಃ ।
ಓಂ ಮಹತೇ ನಮಃ ।
ಓಂ ಅನಘಾಯ ನಮಃ ।
ಓಂ ಅರ್ಥಾಯ ನಮಃ । 990 ।

ಓಂ ಅನರ್ಥಾಯ ನಮಃ ।
ಓಂ ಮಹಾಕಾಯಾಯ ನಮಃ ।
ಓಂ ನೈಕಕರ್ಮಸಮಂಜಸಾಯ ನಮಃ ।
ಓಂ ಭೂಶಯಾಯ ನಮಃ ।
ಓಂ ಭೂಷಣಾಯ ನಮಃ ।
ಓಂ ಭೂತಯೇ ನಮಃ ।
ಓಂ ಭೂಷಣಾಯ ನಮಃ ।
ಓಂ ಭೂತವಾಹನಾಯ ನಮಃ ।
ಓಂ ಶಿಖಂಡಿನೇ ನಮಃ ।
ಓಂ ಕವಚಿನೇ ನಮಃ । 1000 ।

ಓಂ ಶೂಲಿನೇ ನಮಃ ।
ಓಂ ಜಟಿನೇ ನಮಃ ।
ಓಂ ಮುಂಡಿನೇ ನಮಃ ।
ಓಂ ಕುಂಡಲಿನೇ ನಮಃ ।
ಓಂ ಮೇಖಲಿನೇ ನಮಃ ।
ಓಂ ಮುಸಲಿನೇ ನಮಃ ।
ಓಂ ಖಡ್ಗಿನೇ ನಮಃ ।
ಓಂ ಕಂಕಣೀಕೃತವಾಸುಕಯೇ ನಮಃ । 1008 ।

ಇತಿ ಶ್ರೀವೀರಭದ್ರಸಹಸ್ರನಾಮಾವಲಿಃ ಸಮಾಪ್ತಾ ।

            </Text>
          </ScrollView>
        </View>
        <View style={styles.page} key="3">
          <Text style={styles.textalign}> Page 3 </Text>
          <Text style={styles.textalign}>
            *ಶ್ರೀವೀರಭದ್ರೇಶ್ವರ ವಡಪು* 
            {"\n"}{"\n"}
            ಆಹಾ ರುದ್ರಾ l ಆಹಾ ವೀರಾ l ನಿಲ್ಲಿಸಬಹುದಯ್ಯಾ ಒಂದೇ
            ಮಂತ್ರದಿಂದ ಕಾಳೋರಗನ | ನಿಲ್ಲಿಸ ಬಹುದಯ್ಯಾ ಒಂದೇ ಮಂತ್ರದಿಂದ ಹಾರುವ ಪಕ್ಷಿಯ |
            ನಿಲ್ಲಿಸಬಹುದಯ್ಯಾ ಒಂದೇ ಮಂತ್ರದಿಂದ ಹೆಬ್ಬುಲಿಯ | ನಿಲ್ಲಿಸಬಹುದಯ್ಯಾ ಒಂದೇ
            ಮಂತ್ರದಿಂದ ಈ ಹೆಮ್ಮಾರಿಯ ಲೋಭವೆಂಬ ಗ್ರಹಣಹಿಡಿದವರನ್ನು ಯಾತರಿಂದಲೂ ಬಿಡಿಸುಲಾಗದು
            l ಈ ಲೋಭಕ್ಕೆ ದರಿದ್ರವೇ ಔಷಧ | ಹೇಳಿದರೆ ಕೇಳರು | ತಾವೂ ತಿಳಿಯರು | ಶಾಸ್ತ್ರವ
            ಭಕ್ತಿಯ ಹಿಡಿಯರು l ಇಂಥ ಗೊಡ್ಡ ಮೂಳ ಹೊಲೆಯರಿಗೆ | ಕರ್ಮವೆಂಬ ಶರಧಿಯಲ್ಲಿ ಬಿದ್ದು
            | ಉರುಳಾಡುವುದೇ ಸತ್ಯವೇದಾಂತ ನಮ್ಮ ಅಂಬಿಗರ ಚೌಡಯ್ಯ ಕಡೆ ಕಡೆ....... *ಶ್ರೀ
            ವೀರಭದ್ರೇಶ್ವರ ಪ್ರಚಾರ ಸಮಿತಿ*
          </Text>
        </View>
      </PagerView>
    </View>
  );
};

const styles = StyleSheet.create({
  viewPager: {
    flex: 1,
    marginTop: 0,
    backgroundColor: "#fe724c",
    padding: 15,
  },
  page: {
    justifyContent: "center",
    alignItems: "center",
  },
  textalign: {
    textAlign: "justify",
    fontSize: 20,
    color: "#ffffff",
    padding: 15,
  },
});

export default MyPager;
