import React, { Component } from "react";
import {
  Platform,
  StyleSheet,
  View,
  Text,
  Image,
  Alert,
  ImageBackground,
  Animated,
  Button,
  ScrollView,
} from "react-native";
import PropTypes from "prop-types";
import PagerView from "react-native-pager-view";

class TypingText extends Component<{}> {
  constructor() {
    super();

    this.index = 0;

    this.typing_timer = -1;

    this.blinking_cursor_timer = -1;

    this.state = { text: "", blinking_cursor_color: "transparent" };
  }

  componentDidMount() {
    this.typingAnimation();
    this.blinkingCursorAnimation();
  }

  componentWillUnmout() {
    clearTimeout(this.typing_timer);

    this.typing_timer = -1;

    clearInterval(this.blinking_cursor_timer);

    this.blinking_cursor_timer = -1;
  }

  typingAnimation = () => {
    clearTimeout(this.typing_timer);

    this.typing_timer = -1;

    if (this.index < this.props.text.length) {
      if (this.refs.animatedText) {
        this.setState(
          { text: this.state.text + this.props.text.charAt(this.index) },
          () => {
            this.index++;

            this.typing_timer = setTimeout(() => {
              this.typingAnimation();
            }, this.props.typingAnimationDuration);
          }
        );
      }
    }
  };

  blinkingCursorAnimation = () => {
    this.blinking_cursor_timer = setInterval(() => {
      if (this.refs.animatedText) {
        if (this.state.blinking_cursor_color == "transparent")
          this.setState({ blinking_cursor_color: this.props.color });
        else this.setState({ blinking_cursor_color: "transparent" });
      }
    }, this.props.blinkingCursorAnimationDuration);
  };

  render() {
    return (
      <View
        style={{
          flexDirection: "row",
          alignItems: "center",
          justifyContent: "flex-start",
        }}
      >
        <Text
          ref="animatedText"
          style={{
            color: this.props.color,
            fontSize: this.props.textSize,
            textAlign: "center",
            marginTop: this.props.marginTop,
            marginHorizontal: this.props.marginHorizontal,
            fontFamily: this.props.fontFamily,
          }}
        >
          {this.state.text}

          <Text style={{ color: this.state.blinking_cursor_color }}>|</Text>
        </Text>
      </View>
    );
  }
}

export default class FamilyInfo extends Component<{}> {
  constructor() {
    super();
    this.state = {
      isVisible: true,
      ticketIndex: 1,
      startValue: new Animated.Value(0),
      endValue: 1,
      duration: 10000,
    };
  }

  componentDidMount() {
    var that = this;
  }
  static navigationOptions = {
    // header: null
    title: "ಶ್ರೀ ವೀರಭದ್ರೇಶ್ವರ ಶತಕ",
    headerTintColor: '#FFC93c',
    headerStyle: {
      backgroundColor: '#FF6F3C',
      borderBottomColor: '#FFDF00',
      borderBottomWidth: 3,
    },
    headerTitleStyle: {
      fontSize: 18,
    },
    //Sets Header text of Status Bar
  };

  render() {
    const ticketHeight = 400;
    const { navigate } = this.props.navigation;
    return (
        <View style={{ flex: 1 }}>
      <PagerView style={styles.viewPager} initialPage={0}>
        <View style={styles.page} key="1">
          <ScrollView>
            <Text style={styles.textalign}> Page 1 </Text>
            <Text style={styles.textalign}>
             *ಶ್ರೀ ವೀರಭದ್ರೇಶ್ವರ ಶತಕ*{"\n"}{"\n"}

ಅಕ್ಷಯ, ಅಕ್ಷರ, ಅಕ್ಷಿತ್ರಯ, ಕ್ಷುದ್ರ ಕ್ರೂರರಂ ಕ್ಷಮಿಪ, ಮೋಕ್ಷಪ್ರದ, ದಕ್ಷಧ್ವರಹರ. ಕ್ಷಾತ್ರ ವಿಪುಳ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಮೋಕ್ಷಮಂ ll ೧ ll

ಶಾಂತಿನಿಧಿ, ಭಕ್ತಿಯಸಾಗರ, ಏಕೋನಿಷ್ಠೆಯ ಶಿವ, 
ಅತಿ ಸಾಮರ್ಥ್ಯದತರು, ನೀತಿಯಸಾಗರ, ಸತ್ಯಸದನ, ಸರ್ವಜ್ಞತ್ವದ ಶಾಸನ, ಭಕ್ತರ ಕಾರುಣ್ಯನಿಧಿ ಶ್ರೀವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ನೀತಿಯಂ ll ೨ ll

ಸಕಲವಿಶ್ವದ ಬಲನೂ, ರುದ್ರದೇವನ ಬಲನೂ, ನಡುಗಣೋದ್ಭವನೂ ಆದ ಅಮರೇಂದ್ರ ;
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ತ್ರಿನೇತ್ರಮಂ ll ೩ ll

ಅಖಿಳಾಕ್ಕಾಧಾರಂ, ಭವದೂರಂ, 
ಸುಖಸಾರಂ, ಮಹಿಮಾಗಾರಂ; 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪದೆಮಗೆ ಸುಖಸಾರಂ ll ೪ ll

ಎಲ್ಲ ವಸ್ತುಗಳಂ ಪಡೆಯಬಲ್ಲುದು ಧರೆ, 
ಯಾಗ ಸಹಸ್ರದ ಫಲವಂ ಕೊಡಬಲ್ಲ ಶಿವಂ, 
ಆ ಶಿವ ಸ್ವರೂಪಿ ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಶಿವಪದಮಂ ll ೫ ll

ಸುರಗಿರಿಯ ಮಹತ್ವದೊಳು, 
ಸಮುದ್ರದ ಭಾಸುರತೆಯೊಳು; 
ಕಲ್ಪದ್ರುಮದ ಉದಾರದೊಳು ಕಾಣ್ಬ; 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ನಿನ್ನ ದಿವ್ಯಮಂ ll ೬ ll

ಹರಿ, ವಾಣೀವರ, ದಿಗಧೀಶ್ವರ, ವಿದ್ಯಾಧರ, 
ಕಿನ್ನರ, ಖೇಚರ, ಗರುಡೋರಗರಿಂ, ಸೆಲೆ; 
ಮೀರಿದ ಶಕ್ತಿ ಸಂಭೂತ; 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ದಿವ್ಯಶಕ್ತಿಯಂ ll ೭ ll

ಯಜ್ಞಾಧಿಪ ಅತ್ಯಗ್ನಿಷ್ಟೋಮದ
ಶಿವದೇವರ ಆತ್ಮಜ-ಜೀವನಯಜ್ಞಾಧಿಪ; 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸತ್ಪಲಮಂ ll ೮ ll

ಅಗ್ರಾಸನದೊಳೊಪ್ಪುವ ವೇದಗಳೆಲ್ಲವಂ ಬಲ್ಲ ಮಕುಟದೋಳ್ ಎಲ್ಲದೇವರ ಧರಿಪ, ಅಮೋಘ ಜಟಾಧಾರಿ; ಆಸುರ ಕುಂಡಲ ವಸ್ತ್ರಾಲಂಕಾರಭೂಷಿತ ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ವೇದಜ್ಞಾನಮಂ ll ೯ ll

ದಕ್ಷಪುರಾಂತಕನೂ, ಅಧ್ವರದೊಡೆಯನೂ, ಯಾಗರಕ್ಷಕನೂ; ಎಲುದೊಡವನೂ, ತೊಗಲುಡುವನೂ ಆದ ರುದ್ರದೇವರಮಗನೇ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಶ್ರೀ ರಕ್ಷೆಯಂ ll ೧೦ ll

ಅಗ್ರಾಸನದೊಳೋಪ್ಪುವ, ವೇದಂಗಳಂ, ದೇವರಮಕುಟಂ 
ಮಂತ್ರಗಳಂ ಮಸ್ತಕದೋಳ್ ಪಡೆದ ಜಟೆಧಾರಿ ಹೆಗ್ಗುರುಹಿನ ಹೆಮ್ಮೆಗಳಾಗರ ಶಿವಪುತ್ರ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಒಪ್ಪಮಂ ll ೧೧ ll

ಪ್ರೇತೋರ್ತಿಯೊಳ್ ಪವಡಿಪ, ಅಧ್ವರದೊಡೆಯ ಯಾಗರಕ್ಷಕ ದಕ್ಷಪುರಾಂತಕ ಶ್ರೀ ರುದ್ರದೇವರ ಸುಪುತ್ರ ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಯಜ್ಞದೀಕ್ಷೆಯಂ ll ೧೨ ll

 ದಕ್ಷನ ಅಳಿಯನೂ, ಅಧ್ವರದೊಡೆಯನೂ ಶರಣೆಂದವರನೆಂದಳಿಯನೂ, ಅರೆವೆಣ್ಣನೂ ಕುಲೀನನಾಥನೂ ನಿರ್ಗುಣ ದೈವನೂ ಆದ ಹರತನುಜ
ಶ್ರೀವೀರೇಂದ್ರ ನೀಡೆಮಗೆ ನಿರ್ಗುಣಮಂ ll ೧೩ ll

ಭರ್ಗನ ಭಾಳಾಕ್ಷನ ಜಡೆಶ್ರೇಷ್ಠನ ಮಗನೇ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಒಳಗಣ್ಣಂ ll ೧೪ ll

ಅಗಸ್ತ್ಯ, ವಶಿಷ್ಠಂ, ಶೃಗು, ಗೌತಮಂ
ದೇವಲ, ಉಪಮನ್ಯುಂ, ದಧೀಚಿ ಮೊದಲಾದ ಋಷಿವರೇಣ್ಯರ ಆರಾಧ್ಯದೇವಸಂಭೂತ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಋಷಿಋಣಮೋಕ್ಷಂ ll ೧೫ ll

ಅಗಜೇಶಂ ಅಘನಾಶಂ ಇಂದುಧರಂ ಶ್ರೀ ವಾಗೀಶಂಗಜಂ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ವಾಕ್‌ಚಾತುರ್ಯಂ ll ೧೬ ll

ಶಿವನಿಂದೆಯದು ಕೆಡುನುಡಿಗಳ ಕಡೆಗಾಲಂ ಎಂದು
ಶಿವ ಪಿತನೆಂಬುನ್ನತಿಯೆಂದೆಣಿಸದೆ ಶಪಿಸಿದ ಶಿವನೋರ್ವನಿಗೆ ಮನ್ನಣೆಗೈಯುವುದೇ ಸತೀತ್ವವೆಂದರಿದ ಗಿರಿಜಾದೇವಿಯಸುತ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸುಖಮಂ ll ೧೭ ll

ಶಿವನಿಂದೆಯ ಕೇಳದ ಗಿರಿಜೆ ಅಗ್ನಿಕುಂಡವ 
ದಿಟ್ಟಿಸಿ ನೋಡಿ ಅಂತಃ ಕುಂಡಲಿಯೊಳ್ ಪ್ರಾಣವತೊಡಗಿಸಿ ನಡುನೆತ್ತಿಯೊಳು ಸಹಸ್ರ ರವಿಪ್ರಭೆ 
ಜ್ಯೋತಿ ಬೆಳಗಿಸಿದ ದಾಕ್ಷಾಯಣಿಸುತ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಕುಂಡಲಿಶಕ್ತಿಯಂ ll ೧೮ ll

ರುದ್ರನ ಭಾಳಾಕ್ಷದಿಂದ ಜನಿಸಿದ ಭದ್ರನೆ
ಸುರಸೈನ್ಯ ಸಮುದ್ರಕೆ ವಡಬಾನಲನೆ, ಭದ್ರಾಣಿವಲ್ಲಭ ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ವುದೆಮಗೆ ಭದ್ರಮಂ ll ೧೯ ll

ಕುಂಡಲಿ ಅಗ್ನಿಯೊಳ್ ದಹಿಸಿದ ಅಜಗೆಯ ಸುದ್ದಿ ಮನಸಿಜಹರನ ಹಣೆಗಣ್ ಥಳಥಳಿಸಿತು
ಕಡೆಗಾಲದ ಕಿಚ್ಚಿನೊಳ್ ಉರಿ ಎದ್ದಿತು ಮುಗಿಲೆತ್ತರಕೆ ಶಿವ ಜಡೆಯೊಳ್ ಗಂಗೆ ಮಡುವುಕ್ಕುತ್ತೆಸರಿಡಿದಳ್ 
ಶಿವ ಬೆವರಿದ ಮಹ ಉರಿಯಲಿ ಉದ್ಭವಿಸಿದ  
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಮಹಾ ಬೆಳಗಂ ll ೨೦ ll

ನಡುಗಣ್ಣೊಳುದ್ಭವಿಸಿದ ಭದ್ರನ ಭಾರಕ್ಕೆ 
ಇಳೆಬಿರಿದಿತು ಬ್ರಹ್ಮಾಂಡವು ತತ್ತರಿಸಿತು 
ಹೀಗೆ ಶಿವನಿಗೇ ಬೆರಗನ್ನುಂಟುಮಾಡಿದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪರಾಕ್ರಮಂ ll ೨೧ ll

ಎಳೆಸೊಡರಿನ ಕುಡಿಯಂತೆ ನಿನ್ನ ಮೈಬಣ್ಣ
ನಿಡು ಜಡೆಯ ನಡುನೆತ್ತಿಯ ಲಿಂಗ ಫಣಿಕುಂಡಲ ಭಾಸುರ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಲಿಂಗತೇಜಮಂ ll ೨೨ ll

ಉರಿಗೆದರುವ ಪಂಚಮುಖನೆ, ನಿಡುದಾಡೆಗಳಿಂದೆಸವನೆ 
ಸಹಸ್ರ ಭುಜಬಲ, ಚಲ್ಲಣಧಾರಿ, ಶಿರೋಮಾಲಾಭರಣ ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಸದೆಮಗೆ ಶ್ರೀ ನಿಲವಂ ll ೨೩ ll

ತನ್ನಂದದ ಭಟ ಸಮೂಹ ಚಮೂಪ 
ಭೂತಗಣಾಧೀಶ, ಬ್ರಹ್ಮಾಂಡ ರಕ್ಷಕ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ರಕ್ಷಾಬಲಮಂ ll ೨೪ ll

ರುದ್ರನ ಬಾಳಕ್ಷದೊಳು ಜನಿಸಿದ ಸುರಸೈನ್ಯ
ಸಮುದ್ರ ವಡಬಾನಲ, ಭದ್ರಾಣಿವಲ್ಲಭ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಅಕ್ಷತ್ರಯಮಂ ll ೨೫ ll

ಶಿವನ ಹಣೆಗಣ್ ಕಿಚ್ಚು ಕಿಡಿಕೆದರುಕ್ಕಿತು 
ದಳ್ಳುರಿ ಗಗನವತೀವಿತು ಜಡೆಯೊಳು ಗಂಗೆ
ಚುಯ್ಯನೆ ಉಕ್ಕಿತು, ಶಿವ ಕೊಪವೇಮೈವೆತ್ತಂತೆ ಜನಿಸಿದ ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ನಿನ್ನ ವಿರಾಟ ಸ್ವರೂಪಮಂ ll ೨೬ ll

ಎಳೆ ಜ್ಯೋತಿಯ ಬೆಳಗಿನ ಮೈಬಣ್ಣನೂ
ನಿಡು ಜಡೆಮುಡಿಯನೂ, ನಡುನೆತ್ತಿಯೊಳ್ ಲಿಂಗ ಉಳ್ಳವನೂ,
ಫಣಿಕುಂಡಲ ಧರನೂ, ಉರಿಗೆದರುವ ಕುಣಿಗಣ್ಣ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ನಿನ್ನ ದಿವ್ಯಬೆಳಗಂ ll ೨೭ ll

ನೇಸರ ಕಡುಪುಳ್ಳವನೂ, ಕಾಲನಕಂಗಳ ಹುಬ್ಬುಳ್ಳವನೂ 
ಅಸುರರ ತಲೆಗಳ ಗೆಜ್ಜೆಹೊಂದಿದವನೂ; ಶೇಷನಬಂದಿಗೆ ಧರಿಸಿದವನೂ, 
ಮಾರಿಮಂಡೆಯ ನಡುಗಂಟೆಯಾಗಿರಿಸಿದವನೂ 
ಹಿಣಿಲಚರ್ಮದ ಹಲಗೆಯ ಕಡುಗಲಿ
ಶ್ರೀ ವೀರೇಂದ್ರ ರಕ್ಷಿಸೆಮ್ಮನು ll ೨೮ ll

ಪ್ರಳಯಗ್ನಿಯೊಳ್ ಕಾಯಿಸಿ, ವಜ್ರದ ಸಮ್ಮಟಿಗೆಯಿಂದ 
ನಿಗುಚಿ ಕುಳಿಕನ ವಿಷದಿಂ ನೀರೂಡಿಸಿ ನೇಸರ ಮಂಡಳದಿಂದ ಮಸೆದ ಎಳೆಮಿಂಚಿನ 
ಖಡ್ಗವಪಡೆದ ಶ್ರೀ ವೀರೇಂದ್ರ ಕಾಪುದೆಮ್ಮನು ll ೨೯ ll

ಜಲಧಿಯನೆಕುಡಿದ, ಹರಿಕಮಲಜರನೆ ಜಡಿದ, ಕುಲಗಿರಿಗಳನೇ ಹುಡಿಗೆಯ್ಯ ನಾನಾ ಭುವನಾವಳಿಯ ಕೀಲ್ಗಳನು ಕೆಡಹಬಲ್ಲ, ಶಶಿ, ರವಿ, ತಾರೆಗಳ, ಉಡುಗಿಸಬಲ್ಲ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ನಿನ್ನ ಸಾಮರ್ಥ್ಯಮಂ ll ೩೦ ll

ಮಲೆತೊಡೆ ಕೊಲುವ ಶರಣೆನೆ ಕಾಯ್ದ 
ಶಿವನಾಜ್ಞೆ ಮೀರದ ವೀರ ಕುಲಾಧೀಶ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸುವಿವೇಕಮಂ ll ೩೧ ll

ರುದ್ರಭಯಂಕರ ಅಗ್ನಿ ಮೊಗಕಾಲನ ಮೀರಿಪ ಕಿರುದಾಡೆಯ ನಿಲಾದ್ರಿಯಂದದ ಕಾರ್ಮೇಘ, ಮಿಂಚಿನ ಅಲಂಕಾರ - ದಶಾಯುಧಸಂಯುತೆ ಭದ್ರಾಣಿವಲ್ಲಭ ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಕುಲವಧುವಂ ll ೩೨ ll

ನಡುಗಣ್ಣಿಂಪುಟ್ಟಿದ ಚಂಡಾಂಶು ಶತಪ್ರಭ 
ಶ್ರೀ ವೀರೇಂದ್ರ ನೀಡಮಗೆ ಚಂಡಾಂಶು ಪ್ರಭೆಯಂ ll ೩೩ ll

ಶಿವನಂ ಬೀಳ್ಕೊಂಡು ಕರಂ ಕೈವೀಸುತ್ತಿರೆ 
ಸಾಗರ ವಾರಧಿಗಳುಕ್ಕಿದವು, ರಸೆ ಬಸವಳಿದುದು ಅಡಿಯಿಟ್ಟೊಡೆ ಬೆಟ್ಟಂ ಹಿಟ್ಟಾದವು ವಿಪಳಪರಾಕ್ರಮಿ; ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪರಾಕ್ರಮಂ ll ೩೪ ll

ಜವ ಜರಿವಂತೆ ಇಂದ್ರನೆದೆ ಬಿರಿವಂತೆ
ಫಣಿ ಕಮಠರುಮ್ಮಳಿಸುವಂತೆ ಹರಿ 
ಬೊಮ್ಮರು ಕಂಬನಿಗರೆವಂತೆ ವೀರಾಟೋಪವತಾಳ್ದ ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ಪುದೆಮಗೆ ನಿರ್ವಿಕಾರಮಂ ll ೩೫ ll

ರಿಪುವೈರಿ ಕೋಲಾಹಲ, ರಿಪುಕುಲಭೀಷಣ
ರಿಪುಶೋಷಣ ರಿಪಫಣಿ ಖಗಪತಿ 
ರಿಪು ಕರಿಮೃಗಪತಿ ರಿಪುಗಿರಿ ನಾಕಪತಿ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ಪುದೆಮಗೆ ಜಯಮಂ ll ೩೬ ll

ಶಿಖಿಸಂಭವ ಭಾಳಾಂಬಕ
ಶರಣಾಗತ ಜನರಕ್ಷಕ
ಶ್ರೀ ವೀರೇಂದ್ರ ರಕ್ಷಿಸೆಮ್ಮಂ ll ೩೭ ll

ಶಶಿಮೌಳಿಯ ಲಿಂಗಾರ್ಚನೆಗೆ, 
ಯಜ್ಞಕರ್ಮಗಳಿಗೆ, ಮೃಗರೂಪದ 
ಕೃಷ್ಣಾಜಿನವೆ ಮೊದಲೆನಿಸಿದ,
ಶ್ರೀ ವೀರೇಂದ್ರ ನೀಡೆಮಗೆ ಲಿಂಗಾರ್ಚನಾಭಾವಮಂ ll ೩೮ ll

ಅಪ್ರತಿಮ ಬಳಾಧಿಕ, ಉರುಪಟುಭಟ
ಶಾಕಿನಿ, ಡಾಕಿನಿ, ಬೇತಾಳರ ಆಟಗಾರ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಪರಿಹರಿಪುದೆಮ್ಮ ಪೈಶಾಚಿಕ ಕಾಟಮಂ ll ೩೯ ll

ಶಿವದೂಷಕ ಗಜ, ಕಂಠೀರವ, ಶಿವದೂಷಕ ಕುಲ
ಮದಮರ್ದನ, ಶಿವದೂಷಕ ವನಮಧ್ಯದ ಮಹಾಮಂದರ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ಪುದೆಮಗೆ ಶಿವಚಿಂತನೆಯಂ ll ೪೦ ll

ಶಿವದೂಷಕ ತಿಮಿರ ದಿವಾಕರ
ಆನತ ಜನರಘ ಸಂಹರ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ವುದೆಮಗೆ ಸಂತಸಮಂ ll ೪೧ ll

ಘನಯಜ್ಞನ ಶಿರವನ್ನು, ದಕ್ಷನತಲೆಯನ್ನು ಕಾಲನತೋಳನ್ನು ಪೂಷಾದಿತ್ಯನಹಲ್ಲನ್ನು ವಾಣಿಯಮೂಗನ್ನು ಹರಚರಣಕೆ ಒಪ್ಪಿಸಿದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಅತುಲ ಬಲಮಂ ll ೪೨ ll

ಮೃಗದೊಲವನ್ನು ಮೇಣ್ ಗದೆಯನ್ನು 
ವಿಷ್ಣು ಚಕ್ರವನ್ನು ಅನಲನ ನಾಲಗೆಯನ್ನು
ಸುರಪತಿಮುಖ್ಯರ ವಾಹನವನ್ನು, ಮಂಡನ ಶಸ್ತ್ರಾಸ್ತ್ರವನ್ನು ಶಿವಗಪ್ಪೈಸಿದ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ದಿವ್ಯತೇಜಮಂ ll ೪೩ ll

ಶಿವದೂಷಣೆಯಿಂದ ಕುರಿಮೊಗವ ಪಡೆದ 
ದಕ್ಷನ ಹಮ್ಮನ್ನುರಿದು, ಶರಣೆನೆ ಮಾಡಿದ
ಶತಯಜ್ಞಫಲಗಳನಿಂದುಧರನಿಂ ದಕ್ಷಂಗೆ ಕೊಡಿಸಿದ ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಶತಯಜ್ಞಫಲಗಳಂ ll ೪೪ ll

ದಕ್ಷಾಧ್ವರಮಂ ನಿರ್ಧೂಮಧಾಮಂಗೈದ
ಸುಧಾಕರ ವಿರುಪಾಕ್ಷನ ಚರಣಕ್ಕೆರಗಿದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ಪೆದೆಮ್ಮ ಧಾಮಮಂ ನಿರ್ಧೂಮಮಂ ll ೪೫ ll

ಗಗನದೊಳು ಸಿಡಿಲ್ಮೂರ್ತಿಯಂತೆ, ಶಿವನ ಭಾಳಲೋಚನವೆ 
ರೂಪಗೊಂಡಂತೆ ಕಾಳಕೂಟದೊಳೆಗೆದ ಕೇಸರಿಯಂತೆ,
ಕಾಲಾಗ್ನಿದಳ್ಳುರಿಯಂತೆ, ಆವಿರ್ಭವಿಸಿದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ನಿನ್ನ ಶೌರ್ಯಮಂ ll ೪೬ ll

ಏಕ ಜಡೆಲಿಂಗಂ ಶಿರೋಮಾಲೆಗಳ ಧರಿಸಿರ್ಪ
ಕೆಂಗಣ್ಣಿನ ಮೀಸೆಗಳಿಂದಂ, ಬೆಳಗುವ 
ರಜತಗಿರಿ ಸದೃಶ, ಅತುಳ ಕೋಪಾನ್ವಿತ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ನಿನ್ನನಿಲವಂ ll ೪೭ ll

ನೆನೆವರ ನಿಧಾನ, ಭಕ್ತಜನ ಸುರತರು, 
ವೀರಕುಲ ಜಗದ್ಗುರು, ಶರಣಜನಜನಕ,
ಶರಣಾಬ್ಧಚಂದ್ರ ಪರಮಾತ್ಮರೂಪ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ನಿಧಾನಮಂ ll ೪೮ ll

ದುಷ್ಟಜನ ಶಿಕ್ಷಕ, ಶಿಷ್ಟಜನ ರಕ್ಷಕ, 
ಸೃಷ್ಟಿಸ್ಥಿತಿ ಪ್ರಳಯಕರ್ತ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸೃಷ್ಟಿ ಸಂತಸಮಂ ll ೪೯ ll

ವೇದಾರ್ಥರೂಪನೂ, ವಾದತರ್ಕಗಳ ಪರಿಣತನೂ
ವೇದಾಂಗ ವೇದ್ಯನಾದಪ್ರಮೋದ,
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ವಾದತರ್ಕಗಳ ಪರಿಣತಮಂ ll ೫೦ ll

ಗರ್ವದಿಂ ಬೆಂದು ಶಶಿಧರಗೆ ಶರಣೆಂದ
ದಕ್ಷನಿಗೆ ಶತಯಜ್ಞಫಲಮಂ ಕರುಣಿಸಿದ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಶತಯಜ್ಞಫಲಮಂ ll ೫೧ ll

ಶಿವಪುತ್ರರತ್ನತ್ರಯರು ಗಣಪತಿ,
ಕುಮಾರ, ವೀರರೆಂಬುವರು, ಶಿವನ ಪಂಚವಿಂಶತಿ ಲೀಲೆಯೊಳ್ ದ್ವಾದಶಲೀಲೆಯ ಅವತಾರಪುರುಷ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ವುದೆಮಗೆ ಲೀಲಾವಿನೋದಮಂ ll ೫೨ ll

ವೇದವಾಚೀನ ಶೈವಧರ್ಮದ ಪ್ರಮುಖದೇವ, ವೀರಶೈವ ಧರ್ಮೋದ್ವಾರಕ, ಪಂಪಾಪವಾಸಿ, ತುಮಕೂರು ನಿಜಗಲ್ಲವಾಸಿ.
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ಪುದೆಮಗೆ ಸುವ್ಯವಸ್ಥಿತ ವಾಸ್ತವ್ಯಮಂ ll ೫೩ ll

ಪಂಚಗೋತ್ರಗಳಾದ ವೀರ, ನಂದಿ, ಭೃಂಗಿ, 
ವೃಷಭಮ ಸ್ಕಂದಗಳಲ್ಲೊಂದಾದ
ವೀರಗೋತ್ರಾಧಿಪತಿ ಶ್ರೀ ಭಗವತ್ಪಾದ ರೇಣುಕಾಚಾರ್ಯಮಠಾಧೀಶ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಆಶೀರ್ವದಿಸೆಮ್ಮನು ll ೫೪ ll

ಸಹಸ್ರಮುಖ, ದ್ವಿಸಹಸ್ರ ಹಸ್ತ ತಸಹಸ್ರನೇತ್ರ 
ಸಹಸ್ರ ಭುಜನಬಲವೀರ ಹಲಗೆಯಕಡುಗಲಿ, ನಡುನೆತ್ತಿಯಲಿಂಗ; 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಲಿಂಗಸಾಹಿತ್ಯಮಂ ll ೫೫ ll

ಶಿವಸಂಕಲ್ಪದಿಂ ಆವಿರ್ಭವಿಸಿದ ನೀಲಾದ್ರಿ ಸದೃಶ ಶರೀರೆ 
ವೀರಭದ್ರನ ಅತುಳಕೋಪಾಗ್ನಿಗೆ ಉಪಶಮನಮಂ ಮಾಡಿದ ಭದ್ರಾಣಿಯ ವಲ್ಲಭ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪ್ರಶಾಂತಮನಮಂ ll ೫೬ ll

ನವಬ್ರಹ್ಮ ಪ್ರಜಾಪತಿ ಎಂಬ ನಾಮದ, ದಕ್ಷಬ್ರಹ್ಮನ ಶಿವದ್ವೇಷಯಾಗವ ಧ್ವಂಸಗೈದು, ದಕ್ಷನತಲೆಗಡಿದು ದಕ್ಷಗೆ ಕುರಿದಲೆಯಂ ಕೊಟ್ಟು ರಕ್ಷಿಸಿದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಶಿವಭಕ್ತಿಯಂ ll ೫೭ ll

ಪರಶಿವನಪತ್ನಿ ದಕ್ಷಬ್ರಹ್ಮನ ಮಗಳು 
ಯೋಗಾಗ್ನಿಯಲ್ಲಿ ಸುಟ್ಟು ಪಾತಿವ್ರತ್ಯದಿ 
ಸತಿದೇವಿ ಎಂದೆನಿಸಿದ ದಾಕ್ಷಾಯಣಿಸುತ
ಶ್ರೀ ವೀರೇಂದ್ರ ನೀಡೆಮಗೆ ಯೋಗದೃಷ್ಟಿಯಂ ll ೫೮ ll

ಕೈಲಾಸವಾಸಿ ಸೃಷ್ಟಿಸ್ಥಿತಿ ಲಯಕರ್ತ 
ಪರಬ್ರಹ್ಮ ಪರಮಪುರುಷ
ಪರಮೇಶ್ವರನ ಹಣೆಗಣ್ಣೊಳುದ್ಭವಿಸಿದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳುದೆಮಗೆ ನಿಜಪದಮಂ ll ೫೯ ll

ಆರ್ಯ ದ್ರಾವಿಡ ಸಮನ್ವಯಾಚಾರ್ಯ ಅಸಮಾನಪರಾಕ್ರಮಿ ವೀರಶೈವಮನ
ಸ್ಥಾಪನಾಚಾರ್ಯ, ಮೇಣ್ ಅದರ ಅಭಿವರ್ಧಕ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ನೀಡೆಮಗೆ ಸಮನ್ವಯ ದೃಷ್ಟಿಯಂ ll ೬೦ ll

ಶ್ರೀ ರುದ್ರಸ್ವರೂಪಿ, ರುದ್ರಮತ್ರ, ರುದ್ರಾಣಿತನುಜ 
ಶ್ರೀ ರುಚಿರಮೂರ್ತಿ, ರುಜುಸ್ವಭಾವವ್ಯಕ್ತಿ
ಶ್ರೀ ವೀರೇಂದ್ರ ನೀಡೆಮಗೆ ರುದ್ರಸ್ವರೂಪಮಂ ll ೬೧ ll

ಶ್ರೀ ರುಂಡಮಾಲಾಧಾರ ವೀರಭದ್ರ
ವೀತರಾಗಾಯ ವೀರಕ್ರಾಂತಿಕಾರ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ವೀರಜ್ಯೋತಿಯಂ ll ೬೨ ll

ಶ್ರೀ ವೀರಕಂಕಣಧರ ವೀರಾಸನಾಸೀನ 
ವೀರ್ಯವಂತ ಶ್ರೀ ಭದ್ರ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ವೀರಾಸನಮಂ ll ೬೩ ll

ಶ್ರೀ ಭಸಿತಾಂಗ ಭವರೋಗಹರ
ಶ್ರೀ ಭಾಗ್ಯಪ್ರದ ಭವ್ಯರೂಪಿ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಭಾಗ್ಯಮಂ ll ೬೪ ll

ಕೀರ್ತಿಭರಿತನು ಭವಜನಭರಣನೂ, ಭಾರತೀಯ ಸಂಸ್ಕೃತಿ ಪೋಷಕನೂ, ಭವಿತವ್ಯ ಪ್ರದನೂ ಆದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಭವಿತವ್ಯಮಂ ll ೬೫ ll

ಭಾವಜ್ಜನೂ, ಭಾವಶುದ್ಧನೂ, ಭವ್ಯವೃದ್ಧನೂ ಭಾವಸಿದ್ಧನೂ, ಭಾವಿಕಪಾಲಕನೂ ಆದ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಭಾವಶುದ್ಧಮಂ ll ೬೬ ll

ಓಂ ಭಾಸುರನೇ, ಭಿನ್ನಭಾವ ಶೂನ್ಯವೇ 
ಭುವನ ರಕ್ಷಕನೇ ಭು ವಾಸಾಧಿಪನೇ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಭಾಸುರತ್ವಮಂ ll ೬೭ ll

ಹೇ ಭೂತಾತ್ಮ ನೃತ್ಯಭೃತಾಯ 
ಭೈರವ ಪೋಷಣ ಭೌಮಬಲ
ಶ್ರೀ ವೀರೇಂದ್ರ ನೆಲಸಿರ್ಪುದೆಮ್ಮ ಹೃತ್ಕಮಲದೊಳು ll ೬೮ ll

 ಓಂ ಮಣಿಮಂಟಪಾಧ್ಯಕ್ಷ, ಮಥನಹರಣ
ಮದನಹರ, ಮನಃ ಪ್ರಸಾದಾಯ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಮಣಿಮಂಟಪದಕ್ಷಪದವಿಯಂ ll ೬೯ ll

ಹೇ ಮನಃ ಕಷಾಯ ನಿವಾರಕ 
ಮನೋನಿಗ್ರಹಕ ಮಂದಸ್ಮಿತ ಮರಜ್ಞ 
ಶ್ರೀ ವೀರೇಮದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸಂಯಮಮಂ ll ೭೦ ll

ಓಂ ಮಲತ್ರಯ ಪ್ರಕ್ಷಾಲಯ, ಮಲ್ಲಿಕಾರ್ಜುನ ಮಹೋದಯ, ಹೃದಯ ಮಹಂತಚಿತ್ತ
ಶ್ರೀ ವೀರೇಂದ್ರ ಪ್ರಕ್ಷಾಲಿಪುದೆಮ್ಮ ಮಲತ್ರಯಮಂ ll ೭೧ ll

ಓಂ ಮಹಾತ್ಮ ಮಹವೀರ ಮಹಾಪ್ರತಾಪ
ಮಹಾರಥಿಕ ಮಹಿಳಾಮೌಲ್ಯಪ್ರದಾಯ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಸೆಮ್ಮ ಮಹಿಳಾಮೌಲ್ಯಮಂ ll ೭೨ ll 

ಹೇ ಮಹೇಶ್ವರಾ ಮಹೋತ್ಸವಪೂರ್ಣ 
ಮಾನನಿಧಿ ಮಾನನೀಯ ಮಹಾಕಾಳಿಸುತ ಮಾಯಾವಹವಿಸರ್ಜಕ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಮಾನಧನಮಂ ll ೭೩ ll

ಮಿತಭಾಷಿತ, ಮಿಳಿತಜೀವಿತ, ಮುಕುಟಧರ,
ಮುಕ್ತಹಸ್ತ, ಮುಕ್ತಮಾಲಾ. ಭೂಷಣ, ಮಹಾಲಿಂಗಾರ್ಚಕ ಶಕ್ತ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಲಿಂಗಾರ್ಚಕ ಶಕ್ತಿಯಂ ll ೭೪ ll

ಮುಖಭಾವ ಇಂಗಿತವನರಿಯಬಲ್ಲ, 
ಮುಖಸ್ತುತಿಗೆಡೆಗೆ ಅವಕಾಶವೀಯದ 
ಮುದಿತಮುಖ ಮುನಿರಕ್ಷಕ
ಶ್ರೀ ವೀರೇಂದ್ರ ನೀಡೆಮಗೆ ಅಂತಃ ಸಾಕ್ಷಿಯಂ ll ೭೫ ll

ಮೂಲಾಧಾರ ಸ್ವರೂಪಿ, ಮೂಲ ವೀರಶೈವ ಮೂಲಧರ್ಮಾಚಾರ್ಯ, ಮನುಕುಲದ ಮೂಲನಿವಾಸಿ, ಮೇಳಪ್ರಿಯ,
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಸೆಮಗೆ ವೀರಶೈವತ್ವಮಂ ll ೭೬ ll

ಮೋದಕ ಕರ, ಮೋಸರಹಿತ ಸಮ್ಮೋಹನ
ವಿನಾಶಕ ಮೋಹಪಾಶ ನಿರ್ಮೂಲಕ, ಮೌನಿ ಮೌಲಿಕ, ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಬಾಳ ಮೌಲಿಕಮಂ ll ೭೭ ll

ಓಂ ಪಕ್ಷಪಕ್ಷಾಂತರ ಪರಿಹಾರಕ 
ಪಾಪಪಂಕ ಪ್ರಕ್ಷಾಲಕ, ಪಾದಪಂಕಜ 
ಶ್ರೀ ವೀರೇಂದ್ರ ರಕ್ಷಿಸಮಂ ಪಾಪ ಪಂಕದಿಂ ll ೭೮ ll

ಓಂ ಫಣಿಹಸ್ತ ಅಭಯ ಪ್ರದಾಯಕ, 
ಪತಿತ ಪಾವನ, ಪ್ರಪ್ರಥಮ ಪ್ರತಿಮಾನ್ವಿತ ಪಥದರ್ಶಕ ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ವುದೆಮಗೆ ಪಥದರ್ಶನಂ ll ೭೯ ll

ಓಂ ಪದ್ಮಲೋಚನ, ಪದ್ಮನಯನ, 
ಪರಂಜ್ಯೋತಿ ಸ್ವರೂಪ, ಪರಮಾನಂದ ಪ್ರದಾಯಕ, ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪರಂಜ್ಯೋತಿ ರೂಪಂ ll ೮೦ ll

ಓಂ ಪರಮಾನಂದ ಪ್ರದಾಯಕ, 
ಪರಮಾರ್ಥ ಪ್ರಮೋದಾಯ, 
ಪರಮಾವಧಿ ಪರಾಕ್ರಮ ಪಂಚಾಚಾರ್ಯ ಪ್ರಾಣಸ್ವರೂಪಿ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪರಮಾರ್ಥ ಬೋಧಮಂ ll ೮೧ ll

ಓಂ ಪರಮ ಪ್ರತಿಭಾನ್ವಿತ, ಪರಿಣಾಮಕಾರಿ ಪ್ರಕ್ರಿಯ ಪರಿಭ್ರಮನ ಪರಿಹಾರಕ, ಪರಿಶೋಧನ ಪ್ರಬುದ್ಧ ಪರಿವೃತ ಶಿವ ಸಮಸ್ಯ ಸಂಹಾರಕ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪರಮ ಪ್ರತಿಭೆಯಂ ll ೮೨ ll 

ಓಂ ಪರಿಸ್ಥಿತಿ ಸುಸ್ಥಿತಿಕರ್ತ, ಪರಿಶಿಷ್ಟವರ್ಗೋದ್ಧಾರಕ
ಪರೀಕ್ಷನ ಪ್ರವೀಣ, ಪರುಷಹಸ್ತ ಪ್ರಕೃತಿ ವಿಕೃತಿ ವಿಜಯವೀರ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸುಸ್ಥಿತಿಯಂ ll ೮೩ ll

ಓಂ ಪರಮಾರ್ಥಕರ ಸಿದ್ಧ ಪ್ರಬುದ್ಧ 
ಪವನಪುತ್ರ ಕಾರುಣ್ಯ ಪ್ರದಾಯಕ 
ಪಂಚೇಮದ್ರಿಯ ಲಿಂಗಸ್ವರೂಪಿ, ಪುರುಷಾರ್ಥ ಪ್ರದಾಯ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪರಮಾರ್ಥಮಂ ll ೮೪ ll

ಓಂ ಪುರುಷತ್ವ ಪ್ರದಾಯಕ, ಪೂಜಾಮಂಟಪ ಸ್ಥಾಪಕ, ಪೂಜಾವಿಧಿ ವಿಧಾನ ಪ್ರಬೋಧಕ, 
ಪೂರ್ಣಾಭಿಲಾಶ ಪ್ರದಾಯಕ ಪ್ರಗಲ್ಯ ಪ್ರತಿಭಾವಂತ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪುರುಷತ್ವಮಂ ll ೮೫ ll

ಓಂ ಸಮೃದ್ಧಿಕರಣ, ಸಂಭಾವ್ಯಪ್ರಿಯ, 
ಸಮ್ಯಕ್‌ಕರುಣ, ಸವ್ಯಸಾಚಿ ಸಂಪನ್ನ, 
ಸಾಂತ್ವನ ಶೀಲ, ಸಾರೋದ್ಧಾರ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸಮೃದ್ಧಿಯಂ ll ೮೬ ll

ಓಂ ಸುಭದ್ರವೀರ ಶಿವಗಣಾಚಾರ್ಯ, 
ಶ್ರೀಗುರು ಸಾರ್ವಭೌಮ ಸರ್ವಸಿದ್ದಹಸ್ತ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ವುದೆಮಗೆ ಸುಭದ್ರತೆಯಂ ll ೮೭ ll

ಓಂ ಚರ್ಮವಾಸ ಚಾರಹಸ್ಯ
ಗ್ರಹಭೇತಾಳ ಮಾರಿಗಣ ವಿಭಂಜಕ 
ಯೋಗೀಂದ್ರ ಸರ್ವವೇದ ಶಿರೋರತ್ನ. 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ಪುದೆಮಗೆ ನಿರ್ವಿಘ್ನಮಂ ll ೮೮ ll

ಓಂ ಸಹಸ್ರಬಾಹು ಸರ್ವಜ್ಞ 
ಸಚ್ಚಿದಾನಂದ ಭಕ್ತವಾಲೋಕನ
ಸರ್ವಾಭೀಷ್ಟ ಪ್ರದಾಯಕ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸಚ್ಚಿದಾನಂದಮಂ ll ೮೯ ll

ಓಂ ಬಂಧ ವಿಮೋಚಕ ಶಾಶ್ವತವೀರ 
ಗುಪ್ತನಿಧೀಶ್ವರ ಸರ್ವಸಿದ್ಧಿಕರ ಸಕಲಾಗಮ ಶೋಭಿತ
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ಪುದೆಮಗೆ ಸರ್ವಸಿದ್ಧಿಯಂ ll ೯೦ ll

ಸಮಸ್ತ ರೋಗನಿವಾರಕ ಮಂತ್ರನಾಯಕ
ವಿರಕ್ತರಿಗೆ ವಿರಾಗಮಂ ನೃಪರಿಗೆ ಜಯಂ, 
ವ್ರತಸ್ಥರಿಗೆ ಶುಭಫಲಮ ಕರುಣಿಸಬಲ್ಲ | 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ವುದೆಮಗೆ ಭೂತಪ್ರೇತ ವಿನಾಶಮಂ ll ೯೧ ll

ವೀರಾಗಮ ಪಂಡಿತ ವೀರವೃದ್ಧಿಪ್ರಿಯ ಮಮಸಾಯುಜ್ಯ ಪ್ರದಾಯಕ 
ಜನ್ಮಸಂಸಾರ ವರ್ಜಿತ ಭದ್ರಕವಚಕರ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಭದ್ರಕವಚಮಂ ll ೯೨ ll

ಓಂ ಭದ್ರಾವತಾರ, ಭಾರತದ ಭಾಗ್ಯಚೇತನ,
ಮಾನವತಾಪ್ರೇಮಿ, ವೀರಶ್ರೀವಿರಾಜಿತ, 
ಪ್ರಪ್ರಥಮ ಕ್ರಾಂತಿವೀರ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಭಾಗ್ಯಮಂ ll ೯೩ ll

ಓಂ ಸರ್ವಜೀವಿಸರ್ಶಿ, ಭುವನಜೀವ ಸಮದರ್ಶಿ, ವಿಶ್ವಬಂಧು, ವಿಶ್ವವಿಘ್ನ ನಿವಾರಕ,
ಸುಪ್ರಸನ್ನ ಸುಪ್ರಭಾತಕರ 
ಶ್ರೀ ವೀರೇಂದ್ರ ನೀಡಮಗೆ ಸುಪ್ರಸನ್ನಮಂ ll ೯೪ ll

ಓಂ ಆರ್ಯ ದ್ರಾವಿಡ ಸಮನ್ವಯಶೀಲ
ಅರ್ಯವರ್ತಾಧೀಶ, ಸ್ಥೈರ್ಯ ಧೀರಗುಣ ಗಾಂಭೀರ್ಯ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸಮನ್ವಯ ಶೀಲಮಂ ll ೯೫ ll

ಬಲಿ ಎಂದು ಹಸು ಎತ್ತು ಕುರಿ ಕೋಣಗಳ ಕೊಲುವ ಯಜ್ಞನಿರೋಧ ಕ್ರಾಂತಿಯನೆಸಗಿದ ಯಶೋವಂತ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸುಯಜ್ಞಫಲಮಂ ll ೯೬ ll

ಕುರುಬರಿಗೆ ಡೊಳ್ಳು ಡೋಲುಗಳ ಕಾಯಕವ ಕೊಟ್ಟೆ. ಶಿವನಿಗೆ ಡಮರುಗವನಿತ್ತು ಸಯ್ತಿಟ್ಟೆ 
ಲಿಂಗದ ವೀರರಿಗೆ ಕರಡೆಸವಾಳವನಿತ್ತು ಕರುಣಿಸಿದೆ ಆದಿಕನ್ನಡಿಗರಿಗೆ ಹಲಗೆಗಳನಿತ್ತು ಆದರಿಸಿದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ವುದೆಮಗೆ ಕಾಯಕ ಮನಮಂ ll ೯೭ ll

ಕಲೆಗಾರ ಶಿಲ್ಪಿ ನೀನು ಶಿಲ್ಪಿಗೆ ಗುರುವಾದೆ 
ಪಂಚಾಳರಿಗೆ ಪ್ರಾಣಪ್ರತಿಷ್ಠೆಯ ಬಣ್ಣಿಸಿದೆ 
ಪುರವಂತರು ಪುರರಕ್ಷಣೆಗೈವಂತೆ ಮಾಡಿದೆ ವೀರಗಾಸೆಯ ನುಡಿದ ವೀರರಿಗೆ ಒಲಿದುಬಂದೆ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪ್ರಾಣಪ್ರತಿಷ್ಠೆಯಂ ll ೯೮ ll

ಲಿಂಗಜಾತಿ ಪಂಥಗಳ ಭೇದವಿಲ್ಲದ 
ಬಡವ ಬಲ್ಲಿದರೆಂಬ ಭಾವವಿಲ್ಲದ 
ಸಂಕುಚಿತ ಸ್ವಾರ್ಥವನರಿಯದ ವಿವಾದಕ್ಕಿಳಿಯದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸಮತೋಲನಮಂ ll ೯೯ ll 

ಸಹಸ್ರ ತಾವರೆಯ ಪೂಜೆಯಲ್ಲಿ ನಿರತ ವಿಷ್ಣುವಿಗೆ
ಒಂದು ತಾವರೆಯ ಕೊರತೆಗೈದೆ 
ವಿಷ್ಣು ತನ್ನ ಕಣ್ಣನ್ನೇ ಕಿತ್ತು ನಿನ್ನಡಿಗಿಡೆ
“ಕಣ್ಣಡಿಗ"ನೆಂಬ ಬಿರುದುಪಡೆದ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಕನ್ನಡಭಾಷಾ ಪ್ರದೀಪಮಂ ll ೧೦೦ ll 

ಕನ್ನಡಿಗರ ಮೂಲಪುರುಷ ಕನ್ನಡನಾಡಿನ ಪುನೀತತಾಣಗಳಲ್ಲೆಲ್ಲ ಅಣುಶಕ್ತಿ ರೂಪದಲಿ ತೋರ್ಪ ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದು ಕನ್ನಡನಾಡಿಗೆ ಶ್ರೇಯೋಭಿವೃದ್ಧಿಯಂ ll ೧೦೧ ll

ಮೊರಬ ಕಾರ್ಕಳ ಕಲ್ಯಾಣ ಗದುಗು ತಿರುಪತಿ ಎಡೆಯೂರು ಗೊಡಚಿ ಉಳವಿ 
ಕೂಡಲಿಗೆ ಸಿರಿಗಿರಿ ಹುಮನಾಬಾದ ಗೂಳೂರು ನಿಡುಮಾವಿಡಿ ಬಾಳೆಹೊನ್ನೂರಲಿ ವಿರಾಜಿಪ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಸದಾನೆಲಸು ಎಮ್ಮೀ ಹೃದಯ ಪದ್ಮದಲಿ ll ೧೦೨ ll

ರುದ್ರ ಕಾಳವ್ವೆಯರ ಪುತ್ರ 
ಭದ್ರಕಾಳೀ ಭವಾನಿಪತಿ 
ಶಿವ ಪ್ರಭಾವಳಿಯ ನಿರ್ಮಿಸಿದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಸೆಮಗೆ ಶಿವತತ್ವಂ ll ೧೦೩ ll

ವೀರಶೈವ ಸಂಸ್ಥಾಪಕ ವೀರಧ್ವಜ ನಿರ್ಮಾಪಕ
ವೀರಗಣಾಧಿನಾಯಕ 
ಮಾನವತಾ ಮೌಲ್ಯ ಸಂಸ್ಥಾಪಕ 
ವಿವಿಧ ವೃತ್ತಿ ಪ್ರದಾಯಕ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ವಿವಿಧ ವೃತ್ತಿಯಂ ll ೧೦೪ ll

ಶಿವರಾಜ್ಯದ ವೀರ ಶಿವಸಂಸ್ಕೃತಿ ಚಕ್ರವರ್ತಿ ವೀರಮುದ್ರಾಭರಣ, ವೀರಗಚ್ಚೆಯವೀರ, 
ವೀರ ಕಂಕಣಧರ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಶಿವ ಸಂಸ್ಕೃತಿಯಂ ll ೧೦೫ ll

ದ್ವಿಜಹೋಮ ವಿನಾಶಕ 
ದಕ್ಷಧ್ವರಹರ ಪಂಚಸೂತಕ ನಿರ್ಮುಕ್ತ
ಧರ್ಮಾರ್ಥ ಕಾಮಮೋಕ್ಷ ಪ್ರದಾಯಕ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ವುದೆಮಗೆ ಮೋಕ್ಷಮಂ ll ೧೦೬ ll

ಯೋಗ ನಿದ್ರಾವಿಲಾಸ, ಭೋಗಭಾಗ್ಯ ಪ್ರದಾಯಕ ಪಿತೃಕರ್ಮ ವಿನಾಶಕ, ಪ್ರಾಣಲಿಂಗ ಪೂಜಕ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಯೋಗನಿದ್ರಾ ವಿಲಾಸಮಂ ll ೧೦೭ ll

ಭಸ್ಮದೂಳಿತ ದೇಹಾಯ ಅರಿಷಡ್ವರ್ಗದಗ್ದಾಯ
ಪಂಚಾಕೋಶದ ಭದ್ರಪೀಠಾಸೀನ 
ಚಿಚ್ಛಕ್ತಿ ಜ್ಞಾನಮೂರ್ತಿ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಸದಾ ನೆಲಸುಗೆ ಎಮ್ಮಾತ್ಮಪೀಠದಲಿ ll ೧೦೮ ll

*ಇತಿ ಶ್ರೀ ಸಿ. ಎಂ. ವೀರಭದ್ರಾರ್ಯ ವಿರಚಿತ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕಾವ್ಯಾಂಕಿತ ಶ್ರೀ ವೀರಭದ್ರ ಶತಕ ವಚನಕ್ಕೆ ಮಂಗಲಮಸ್ತು*

            </Text>
          </ScrollView>
        </View>
        <View style={styles.page} key="2">
          <ScrollView>
            <Text style={styles.textalign}> Page 2 </Text>
            <Text style={styles.textalign}>
             *ಶ್ರೀ ವೀರಭದ್ರೇಶ್ವರ ಶತಕ*   {"\n"}{"\n"}

ಅಕ್ಷಯ, ಅಕ್ಷರ, ಅಕ್ಷಿತ್ರಯ, ಕ್ಷುದ್ರ ಕ್ರೂರರಂ ಕ್ಷಮಿಪ, ಮೋಕ್ಷಪ್ರದ, ದಕ್ಷಧ್ವರಹರ. ಕ್ಷಾತ್ರ ವಿಪುಳ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಮೋಕ್ಷಮಂ ll ೧ ll

ಶಾಂತಿನಿಧಿ, ಭಕ್ತಿಯಸಾಗರ, ಏಕೋನಿಷ್ಠೆಯ ಶಿವ, 
ಅತಿ ಸಾಮರ್ಥ್ಯದತರು, ನೀತಿಯಸಾಗರ, ಸತ್ಯಸದನ, ಸರ್ವಜ್ಞತ್ವದ ಶಾಸನ, ಭಕ್ತರ ಕಾರುಣ್ಯನಿಧಿ ಶ್ರೀವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ನೀತಿಯಂ ll ೨ ll

ಸಕಲವಿಶ್ವದ ಬಲನೂ, ರುದ್ರದೇವನ ಬಲನೂ, ನಡುಗಣೋದ್ಭವನೂ ಆದ ಅಮರೇಂದ್ರ ;
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ತ್ರಿನೇತ್ರಮಂ ll ೩ ll

ಅಖಿಳಾಕ್ಕಾಧಾರಂ, ಭವದೂರಂ, 
ಸುಖಸಾರಂ, ಮಹಿಮಾಗಾರಂ; 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪದೆಮಗೆ ಸುಖಸಾರಂ ll ೪ ll

ಎಲ್ಲ ವಸ್ತುಗಳಂ ಪಡೆಯಬಲ್ಲುದು ಧರೆ, 
ಯಾಗ ಸಹಸ್ರದ ಫಲವಂ ಕೊಡಬಲ್ಲ ಶಿವಂ, 
ಆ ಶಿವ ಸ್ವರೂಪಿ ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಶಿವಪದಮಂ ll ೫ ll

ಸುರಗಿರಿಯ ಮಹತ್ವದೊಳು, 
ಸಮುದ್ರದ ಭಾಸುರತೆಯೊಳು; 
ಕಲ್ಪದ್ರುಮದ ಉದಾರದೊಳು ಕಾಣ್ಬ; 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ನಿನ್ನ ದಿವ್ಯಮಂ ll ೬ ll

ಹರಿ, ವಾಣೀವರ, ದಿಗಧೀಶ್ವರ, ವಿದ್ಯಾಧರ, 
ಕಿನ್ನರ, ಖೇಚರ, ಗರುಡೋರಗರಿಂ, ಸೆಲೆ; 
ಮೀರಿದ ಶಕ್ತಿ ಸಂಭೂತ; 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ದಿವ್ಯಶಕ್ತಿಯಂ ll ೭ ll

ಯಜ್ಞಾಧಿಪ ಅತ್ಯಗ್ನಿಷ್ಟೋಮದ
ಶಿವದೇವರ ಆತ್ಮಜ-ಜೀವನಯಜ್ಞಾಧಿಪ; 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸತ್ಪಲಮಂ ll ೮ ll

ಅಗ್ರಾಸನದೊಳೊಪ್ಪುವ ವೇದಗಳೆಲ್ಲವಂ ಬಲ್ಲ ಮಕುಟದೋಳ್ ಎಲ್ಲದೇವರ ಧರಿಪ, ಅಮೋಘ ಜಟಾಧಾರಿ; ಆಸುರ ಕುಂಡಲ ವಸ್ತ್ರಾಲಂಕಾರಭೂಷಿತ ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ವೇದಜ್ಞಾನಮಂ ll ೯ ll

ದಕ್ಷಪುರಾಂತಕನೂ, ಅಧ್ವರದೊಡೆಯನೂ, ಯಾಗರಕ್ಷಕನೂ; ಎಲುದೊಡವನೂ, ತೊಗಲುಡುವನೂ ಆದ ರುದ್ರದೇವರಮಗನೇ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಶ್ರೀ ರಕ್ಷೆಯಂ ll ೧೦ ll

ಅಗ್ರಾಸನದೊಳೋಪ್ಪುವ, ವೇದಂಗಳಂ, ದೇವರಮಕುಟಂ 
ಮಂತ್ರಗಳಂ ಮಸ್ತಕದೋಳ್ ಪಡೆದ ಜಟೆಧಾರಿ ಹೆಗ್ಗುರುಹಿನ ಹೆಮ್ಮೆಗಳಾಗರ ಶಿವಪುತ್ರ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಒಪ್ಪಮಂ ll ೧೧ ll

ಪ್ರೇತೋರ್ತಿಯೊಳ್ ಪವಡಿಪ, ಅಧ್ವರದೊಡೆಯ ಯಾಗರಕ್ಷಕ ದಕ್ಷಪುರಾಂತಕ ಶ್ರೀ ರುದ್ರದೇವರ ಸುಪುತ್ರ ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಯಜ್ಞದೀಕ್ಷೆಯಂ ll ೧೨ ll

 ದಕ್ಷನ ಅಳಿಯನೂ, ಅಧ್ವರದೊಡೆಯನೂ ಶರಣೆಂದವರನೆಂದಳಿಯನೂ, ಅರೆವೆಣ್ಣನೂ ಕುಲೀನನಾಥನೂ ನಿರ್ಗುಣ ದೈವನೂ ಆದ ಹರತನುಜ
ಶ್ರೀವೀರೇಂದ್ರ ನೀಡೆಮಗೆ ನಿರ್ಗುಣಮಂ ll ೧೩ ll

ಭರ್ಗನ ಭಾಳಾಕ್ಷನ ಜಡೆಶ್ರೇಷ್ಠನ ಮಗನೇ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಒಳಗಣ್ಣಂ ll ೧೪ ll

ಅಗಸ್ತ್ಯ, ವಶಿಷ್ಠಂ, ಶೃಗು, ಗೌತಮಂ
ದೇವಲ, ಉಪಮನ್ಯುಂ, ದಧೀಚಿ ಮೊದಲಾದ ಋಷಿವರೇಣ್ಯರ ಆರಾಧ್ಯದೇವಸಂಭೂತ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಋಷಿಋಣಮೋಕ್ಷಂ ll ೧೫ ll

ಅಗಜೇಶಂ ಅಘನಾಶಂ ಇಂದುಧರಂ ಶ್ರೀ ವಾಗೀಶಂಗಜಂ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ವಾಕ್‌ಚಾತುರ್ಯಂ ll ೧೬ ll

ಶಿವನಿಂದೆಯದು ಕೆಡುನುಡಿಗಳ ಕಡೆಗಾಲಂ ಎಂದು
ಶಿವ ಪಿತನೆಂಬುನ್ನತಿಯೆಂದೆಣಿಸದೆ ಶಪಿಸಿದ ಶಿವನೋರ್ವನಿಗೆ ಮನ್ನಣೆಗೈಯುವುದೇ ಸತೀತ್ವವೆಂದರಿದ ಗಿರಿಜಾದೇವಿಯಸುತ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸುಖಮಂ ll ೧೭ ll

ಶಿವನಿಂದೆಯ ಕೇಳದ ಗಿರಿಜೆ ಅಗ್ನಿಕುಂಡವ 
ದಿಟ್ಟಿಸಿ ನೋಡಿ ಅಂತಃ ಕುಂಡಲಿಯೊಳ್ ಪ್ರಾಣವತೊಡಗಿಸಿ ನಡುನೆತ್ತಿಯೊಳು ಸಹಸ್ರ ರವಿಪ್ರಭೆ 
ಜ್ಯೋತಿ ಬೆಳಗಿಸಿದ ದಾಕ್ಷಾಯಣಿಸುತ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಕುಂಡಲಿಶಕ್ತಿಯಂ ll ೧೮ ll

ರುದ್ರನ ಭಾಳಾಕ್ಷದಿಂದ ಜನಿಸಿದ ಭದ್ರನೆ
ಸುರಸೈನ್ಯ ಸಮುದ್ರಕೆ ವಡಬಾನಲನೆ, ಭದ್ರಾಣಿವಲ್ಲಭ ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ವುದೆಮಗೆ ಭದ್ರಮಂ ll ೧೯ ll

ಕುಂಡಲಿ ಅಗ್ನಿಯೊಳ್ ದಹಿಸಿದ ಅಜಗೆಯ ಸುದ್ದಿ ಮನಸಿಜಹರನ ಹಣೆಗಣ್ ಥಳಥಳಿಸಿತು
ಕಡೆಗಾಲದ ಕಿಚ್ಚಿನೊಳ್ ಉರಿ ಎದ್ದಿತು ಮುಗಿಲೆತ್ತರಕೆ ಶಿವ ಜಡೆಯೊಳ್ ಗಂಗೆ ಮಡುವುಕ್ಕುತ್ತೆಸರಿಡಿದಳ್ 
ಶಿವ ಬೆವರಿದ ಮಹ ಉರಿಯಲಿ ಉದ್ಭವಿಸಿದ  
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಮಹಾ ಬೆಳಗಂ ll ೨೦ ll

ನಡುಗಣ್ಣೊಳುದ್ಭವಿಸಿದ ಭದ್ರನ ಭಾರಕ್ಕೆ 
ಇಳೆಬಿರಿದಿತು ಬ್ರಹ್ಮಾಂಡವು ತತ್ತರಿಸಿತು 
ಹೀಗೆ ಶಿವನಿಗೇ ಬೆರಗನ್ನುಂಟುಮಾಡಿದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪರಾಕ್ರಮಂ ll ೨೧ ll

ಎಳೆಸೊಡರಿನ ಕುಡಿಯಂತೆ ನಿನ್ನ ಮೈಬಣ್ಣ
ನಿಡು ಜಡೆಯ ನಡುನೆತ್ತಿಯ ಲಿಂಗ ಫಣಿಕುಂಡಲ ಭಾಸುರ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಲಿಂಗತೇಜಮಂ ll ೨೨ ll

ಉರಿಗೆದರುವ ಪಂಚಮುಖನೆ, ನಿಡುದಾಡೆಗಳಿಂದೆಸವನೆ 
ಸಹಸ್ರ ಭುಜಬಲ, ಚಲ್ಲಣಧಾರಿ, ಶಿರೋಮಾಲಾಭರಣ ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಸದೆಮಗೆ ಶ್ರೀ ನಿಲವಂ ll ೨೩ ll

ತನ್ನಂದದ ಭಟ ಸಮೂಹ ಚಮೂಪ 
ಭೂತಗಣಾಧೀಶ, ಬ್ರಹ್ಮಾಂಡ ರಕ್ಷಕ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ರಕ್ಷಾಬಲಮಂ ll ೨೪ ll

ರುದ್ರನ ಬಾಳಕ್ಷದೊಳು ಜನಿಸಿದ ಸುರಸೈನ್ಯ
ಸಮುದ್ರ ವಡಬಾನಲ, ಭದ್ರಾಣಿವಲ್ಲಭ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಅಕ್ಷತ್ರಯಮಂ ll ೨೫ ll

ಶಿವನ ಹಣೆಗಣ್ ಕಿಚ್ಚು ಕಿಡಿಕೆದರುಕ್ಕಿತು 
ದಳ್ಳುರಿ ಗಗನವತೀವಿತು ಜಡೆಯೊಳು ಗಂಗೆ
ಚುಯ್ಯನೆ ಉಕ್ಕಿತು, ಶಿವ ಕೊಪವೇಮೈವೆತ್ತಂತೆ ಜನಿಸಿದ ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ನಿನ್ನ ವಿರಾಟ ಸ್ವರೂಪಮಂ ll ೨೬ ll

ಎಳೆ ಜ್ಯೋತಿಯ ಬೆಳಗಿನ ಮೈಬಣ್ಣನೂ
ನಿಡು ಜಡೆಮುಡಿಯನೂ, ನಡುನೆತ್ತಿಯೊಳ್ ಲಿಂಗ ಉಳ್ಳವನೂ,
ಫಣಿಕುಂಡಲ ಧರನೂ, ಉರಿಗೆದರುವ ಕುಣಿಗಣ್ಣ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ನಿನ್ನ ದಿವ್ಯಬೆಳಗಂ ll ೨೭ ll

ನೇಸರ ಕಡುಪುಳ್ಳವನೂ, ಕಾಲನಕಂಗಳ ಹುಬ್ಬುಳ್ಳವನೂ 
ಅಸುರರ ತಲೆಗಳ ಗೆಜ್ಜೆಹೊಂದಿದವನೂ; ಶೇಷನಬಂದಿಗೆ ಧರಿಸಿದವನೂ, 
ಮಾರಿಮಂಡೆಯ ನಡುಗಂಟೆಯಾಗಿರಿಸಿದವನೂ 
ಹಿಣಿಲಚರ್ಮದ ಹಲಗೆಯ ಕಡುಗಲಿ
ಶ್ರೀ ವೀರೇಂದ್ರ ರಕ್ಷಿಸೆಮ್ಮನು ll ೨೮ ll

ಪ್ರಳಯಗ್ನಿಯೊಳ್ ಕಾಯಿಸಿ, ವಜ್ರದ ಸಮ್ಮಟಿಗೆಯಿಂದ 
ನಿಗುಚಿ ಕುಳಿಕನ ವಿಷದಿಂ ನೀರೂಡಿಸಿ ನೇಸರ ಮಂಡಳದಿಂದ ಮಸೆದ ಎಳೆಮಿಂಚಿನ 
ಖಡ್ಗವಪಡೆದ ಶ್ರೀ ವೀರೇಂದ್ರ ಕಾಪುದೆಮ್ಮನು ll ೨೯ ll

ಜಲಧಿಯನೆಕುಡಿದ, ಹರಿಕಮಲಜರನೆ ಜಡಿದ, ಕುಲಗಿರಿಗಳನೇ ಹುಡಿಗೆಯ್ಯ ನಾನಾ ಭುವನಾವಳಿಯ ಕೀಲ್ಗಳನು ಕೆಡಹಬಲ್ಲ, ಶಶಿ, ರವಿ, ತಾರೆಗಳ, ಉಡುಗಿಸಬಲ್ಲ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ನಿನ್ನ ಸಾಮರ್ಥ್ಯಮಂ ll ೩೦ ll

ಮಲೆತೊಡೆ ಕೊಲುವ ಶರಣೆನೆ ಕಾಯ್ದ 
ಶಿವನಾಜ್ಞೆ ಮೀರದ ವೀರ ಕುಲಾಧೀಶ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸುವಿವೇಕಮಂ ll ೩೧ ll

ರುದ್ರಭಯಂಕರ ಅಗ್ನಿ ಮೊಗಕಾಲನ ಮೀರಿಪ ಕಿರುದಾಡೆಯ ನಿಲಾದ್ರಿಯಂದದ ಕಾರ್ಮೇಘ, ಮಿಂಚಿನ ಅಲಂಕಾರ - ದಶಾಯುಧಸಂಯುತೆ ಭದ್ರಾಣಿವಲ್ಲಭ ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಕುಲವಧುವಂ ll ೩೨ ll

ನಡುಗಣ್ಣಿಂಪುಟ್ಟಿದ ಚಂಡಾಂಶು ಶತಪ್ರಭ 
ಶ್ರೀ ವೀರೇಂದ್ರ ನೀಡಮಗೆ ಚಂಡಾಂಶು ಪ್ರಭೆಯಂ ll ೩೩ ll

ಶಿವನಂ ಬೀಳ್ಕೊಂಡು ಕರಂ ಕೈವೀಸುತ್ತಿರೆ 
ಸಾಗರ ವಾರಧಿಗಳುಕ್ಕಿದವು, ರಸೆ ಬಸವಳಿದುದು ಅಡಿಯಿಟ್ಟೊಡೆ ಬೆಟ್ಟಂ ಹಿಟ್ಟಾದವು ವಿಪಳಪರಾಕ್ರಮಿ; ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪರಾಕ್ರಮಂ ll ೩೪ ll

ಜವ ಜರಿವಂತೆ ಇಂದ್ರನೆದೆ ಬಿರಿವಂತೆ
ಫಣಿ ಕಮಠರುಮ್ಮಳಿಸುವಂತೆ ಹರಿ 
ಬೊಮ್ಮರು ಕಂಬನಿಗರೆವಂತೆ ವೀರಾಟೋಪವತಾಳ್ದ ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ಪುದೆಮಗೆ ನಿರ್ವಿಕಾರಮಂ ll ೩೫ ll

ರಿಪುವೈರಿ ಕೋಲಾಹಲ, ರಿಪುಕುಲಭೀಷಣ
ರಿಪುಶೋಷಣ ರಿಪಫಣಿ ಖಗಪತಿ 
ರಿಪು ಕರಿಮೃಗಪತಿ ರಿಪುಗಿರಿ ನಾಕಪತಿ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ಪುದೆಮಗೆ ಜಯಮಂ ll ೩೬ ll

ಶಿಖಿಸಂಭವ ಭಾಳಾಂಬಕ
ಶರಣಾಗತ ಜನರಕ್ಷಕ
ಶ್ರೀ ವೀರೇಂದ್ರ ರಕ್ಷಿಸೆಮ್ಮಂ ll ೩೭ ll

ಶಶಿಮೌಳಿಯ ಲಿಂಗಾರ್ಚನೆಗೆ, 
ಯಜ್ಞಕರ್ಮಗಳಿಗೆ, ಮೃಗರೂಪದ 
ಕೃಷ್ಣಾಜಿನವೆ ಮೊದಲೆನಿಸಿದ,
ಶ್ರೀ ವೀರೇಂದ್ರ ನೀಡೆಮಗೆ ಲಿಂಗಾರ್ಚನಾಭಾವಮಂ ll ೩೮ ll

ಅಪ್ರತಿಮ ಬಳಾಧಿಕ, ಉರುಪಟುಭಟ
ಶಾಕಿನಿ, ಡಾಕಿನಿ, ಬೇತಾಳರ ಆಟಗಾರ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಪರಿಹರಿಪುದೆಮ್ಮ ಪೈಶಾಚಿಕ ಕಾಟಮಂ ll ೩೯ ll

ಶಿವದೂಷಕ ಗಜ, ಕಂಠೀರವ, ಶಿವದೂಷಕ ಕುಲ
ಮದಮರ್ದನ, ಶಿವದೂಷಕ ವನಮಧ್ಯದ ಮಹಾಮಂದರ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ಪುದೆಮಗೆ ಶಿವಚಿಂತನೆಯಂ ll ೪೦ ll

ಶಿವದೂಷಕ ತಿಮಿರ ದಿವಾಕರ
ಆನತ ಜನರಘ ಸಂಹರ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ವುದೆಮಗೆ ಸಂತಸಮಂ ll ೪೧ ll

ಘನಯಜ್ಞನ ಶಿರವನ್ನು, ದಕ್ಷನತಲೆಯನ್ನು ಕಾಲನತೋಳನ್ನು ಪೂಷಾದಿತ್ಯನಹಲ್ಲನ್ನು ವಾಣಿಯಮೂಗನ್ನು ಹರಚರಣಕೆ ಒಪ್ಪಿಸಿದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಅತುಲ ಬಲಮಂ ll ೪೨ ll

ಮೃಗದೊಲವನ್ನು ಮೇಣ್ ಗದೆಯನ್ನು 
ವಿಷ್ಣು ಚಕ್ರವನ್ನು ಅನಲನ ನಾಲಗೆಯನ್ನು
ಸುರಪತಿಮುಖ್ಯರ ವಾಹನವನ್ನು, ಮಂಡನ ಶಸ್ತ್ರಾಸ್ತ್ರವನ್ನು ಶಿವಗಪ್ಪೈಸಿದ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ದಿವ್ಯತೇಜಮಂ ll ೪೩ ll

ಶಿವದೂಷಣೆಯಿಂದ ಕುರಿಮೊಗವ ಪಡೆದ 
ದಕ್ಷನ ಹಮ್ಮನ್ನುರಿದು, ಶರಣೆನೆ ಮಾಡಿದ
ಶತಯಜ್ಞಫಲಗಳನಿಂದುಧರನಿಂ ದಕ್ಷಂಗೆ ಕೊಡಿಸಿದ ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಶತಯಜ್ಞಫಲಗಳಂ ll ೪೪ ll

ದಕ್ಷಾಧ್ವರಮಂ ನಿರ್ಧೂಮಧಾಮಂಗೈದ
ಸುಧಾಕರ ವಿರುಪಾಕ್ಷನ ಚರಣಕ್ಕೆರಗಿದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ಪೆದೆಮ್ಮ ಧಾಮಮಂ ನಿರ್ಧೂಮಮಂ ll ೪೫ ll

ಗಗನದೊಳು ಸಿಡಿಲ್ಮೂರ್ತಿಯಂತೆ, ಶಿವನ ಭಾಳಲೋಚನವೆ 
ರೂಪಗೊಂಡಂತೆ ಕಾಳಕೂಟದೊಳೆಗೆದ ಕೇಸರಿಯಂತೆ,
ಕಾಲಾಗ್ನಿದಳ್ಳುರಿಯಂತೆ, ಆವಿರ್ಭವಿಸಿದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ನಿನ್ನ ಶೌರ್ಯಮಂ ll ೪೬ ll

ಏಕ ಜಡೆಲಿಂಗಂ ಶಿರೋಮಾಲೆಗಳ ಧರಿಸಿರ್ಪ
ಕೆಂಗಣ್ಣಿನ ಮೀಸೆಗಳಿಂದಂ, ಬೆಳಗುವ 
ರಜತಗಿರಿ ಸದೃಶ, ಅತುಳ ಕೋಪಾನ್ವಿತ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ನಿನ್ನನಿಲವಂ ll ೪೭ ll

ನೆನೆವರ ನಿಧಾನ, ಭಕ್ತಜನ ಸುರತರು, 
ವೀರಕುಲ ಜಗದ್ಗುರು, ಶರಣಜನಜನಕ,
ಶರಣಾಬ್ಧಚಂದ್ರ ಪರಮಾತ್ಮರೂಪ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ನಿಧಾನಮಂ ll ೪೮ ll

ದುಷ್ಟಜನ ಶಿಕ್ಷಕ, ಶಿಷ್ಟಜನ ರಕ್ಷಕ, 
ಸೃಷ್ಟಿಸ್ಥಿತಿ ಪ್ರಳಯಕರ್ತ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸೃಷ್ಟಿ ಸಂತಸಮಂ ll ೪೯ ll

ವೇದಾರ್ಥರೂಪನೂ, ವಾದತರ್ಕಗಳ ಪರಿಣತನೂ
ವೇದಾಂಗ ವೇದ್ಯನಾದಪ್ರಮೋದ,
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ವಾದತರ್ಕಗಳ ಪರಿಣತಮಂ ll ೫೦ ll

ಗರ್ವದಿಂ ಬೆಂದು ಶಶಿಧರಗೆ ಶರಣೆಂದ
ದಕ್ಷನಿಗೆ ಶತಯಜ್ಞಫಲಮಂ ಕರುಣಿಸಿದ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಶತಯಜ್ಞಫಲಮಂ ll ೫೧ ll

ಶಿವಪುತ್ರರತ್ನತ್ರಯರು ಗಣಪತಿ,
ಕುಮಾರ, ವೀರರೆಂಬುವರು, ಶಿವನ ಪಂಚವಿಂಶತಿ ಲೀಲೆಯೊಳ್ ದ್ವಾದಶಲೀಲೆಯ ಅವತಾರಪುರುಷ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ವುದೆಮಗೆ ಲೀಲಾವಿನೋದಮಂ ll ೫೨ ll

ವೇದವಾಚೀನ ಶೈವಧರ್ಮದ ಪ್ರಮುಖದೇವ, ವೀರಶೈವ ಧರ್ಮೋದ್ವಾರಕ, ಪಂಪಾಪವಾಸಿ, ತುಮಕೂರು ನಿಜಗಲ್ಲವಾಸಿ.
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ಪುದೆಮಗೆ ಸುವ್ಯವಸ್ಥಿತ ವಾಸ್ತವ್ಯಮಂ ll ೫೩ ll

ಪಂಚಗೋತ್ರಗಳಾದ ವೀರ, ನಂದಿ, ಭೃಂಗಿ, 
ವೃಷಭಮ ಸ್ಕಂದಗಳಲ್ಲೊಂದಾದ
ವೀರಗೋತ್ರಾಧಿಪತಿ ಶ್ರೀ ಭಗವತ್ಪಾದ ರೇಣುಕಾಚಾರ್ಯಮಠಾಧೀಶ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಆಶೀರ್ವದಿಸೆಮ್ಮನು ll ೫೪ ll

ಸಹಸ್ರಮುಖ, ದ್ವಿಸಹಸ್ರ ಹಸ್ತ ತಸಹಸ್ರನೇತ್ರ 
ಸಹಸ್ರ ಭುಜನಬಲವೀರ ಹಲಗೆಯಕಡುಗಲಿ, ನಡುನೆತ್ತಿಯಲಿಂಗ; 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಲಿಂಗಸಾಹಿತ್ಯಮಂ ll ೫೫ ll

ಶಿವಸಂಕಲ್ಪದಿಂ ಆವಿರ್ಭವಿಸಿದ ನೀಲಾದ್ರಿ ಸದೃಶ ಶರೀರೆ 
ವೀರಭದ್ರನ ಅತುಳಕೋಪಾಗ್ನಿಗೆ ಉಪಶಮನಮಂ ಮಾಡಿದ ಭದ್ರಾಣಿಯ ವಲ್ಲಭ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪ್ರಶಾಂತಮನಮಂ ll ೫೬ ll

ನವಬ್ರಹ್ಮ ಪ್ರಜಾಪತಿ ಎಂಬ ನಾಮದ, ದಕ್ಷಬ್ರಹ್ಮನ ಶಿವದ್ವೇಷಯಾಗವ ಧ್ವಂಸಗೈದು, ದಕ್ಷನತಲೆಗಡಿದು ದಕ್ಷಗೆ ಕುರಿದಲೆಯಂ ಕೊಟ್ಟು ರಕ್ಷಿಸಿದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಶಿವಭಕ್ತಿಯಂ ll ೫೭ ll

ಪರಶಿವನಪತ್ನಿ ದಕ್ಷಬ್ರಹ್ಮನ ಮಗಳು 
ಯೋಗಾಗ್ನಿಯಲ್ಲಿ ಸುಟ್ಟು ಪಾತಿವ್ರತ್ಯದಿ 
ಸತಿದೇವಿ ಎಂದೆನಿಸಿದ ದಾಕ್ಷಾಯಣಿಸುತ
ಶ್ರೀ ವೀರೇಂದ್ರ ನೀಡೆಮಗೆ ಯೋಗದೃಷ್ಟಿಯಂ ll ೫೮ ll

ಕೈಲಾಸವಾಸಿ ಸೃಷ್ಟಿಸ್ಥಿತಿ ಲಯಕರ್ತ 
ಪರಬ್ರಹ್ಮ ಪರಮಪುರುಷ
ಪರಮೇಶ್ವರನ ಹಣೆಗಣ್ಣೊಳುದ್ಭವಿಸಿದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳುದೆಮಗೆ ನಿಜಪದಮಂ ll ೫೯ ll

ಆರ್ಯ ದ್ರಾವಿಡ ಸಮನ್ವಯಾಚಾರ್ಯ ಅಸಮಾನಪರಾಕ್ರಮಿ ವೀರಶೈವಮನ
ಸ್ಥಾಪನಾಚಾರ್ಯ, ಮೇಣ್ ಅದರ ಅಭಿವರ್ಧಕ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ನೀಡೆಮಗೆ ಸಮನ್ವಯ ದೃಷ್ಟಿಯಂ ll ೬೦ ll

ಶ್ರೀ ರುದ್ರಸ್ವರೂಪಿ, ರುದ್ರಮತ್ರ, ರುದ್ರಾಣಿತನುಜ 
ಶ್ರೀ ರುಚಿರಮೂರ್ತಿ, ರುಜುಸ್ವಭಾವವ್ಯಕ್ತಿ
ಶ್ರೀ ವೀರೇಂದ್ರ ನೀಡೆಮಗೆ ರುದ್ರಸ್ವರೂಪಮಂ ll ೬೧ ll

ಶ್ರೀ ರುಂಡಮಾಲಾಧಾರ ವೀರಭದ್ರ
ವೀತರಾಗಾಯ ವೀರಕ್ರಾಂತಿಕಾರ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ವೀರಜ್ಯೋತಿಯಂ ll ೬೨ ll

ಶ್ರೀ ವೀರಕಂಕಣಧರ ವೀರಾಸನಾಸೀನ 
ವೀರ್ಯವಂತ ಶ್ರೀ ಭದ್ರ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ವೀರಾಸನಮಂ ll ೬೩ ll

ಶ್ರೀ ಭಸಿತಾಂಗ ಭವರೋಗಹರ
ಶ್ರೀ ಭಾಗ್ಯಪ್ರದ ಭವ್ಯರೂಪಿ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಭಾಗ್ಯಮಂ ll ೬೪ ll

ಕೀರ್ತಿಭರಿತನು ಭವಜನಭರಣನೂ, ಭಾರತೀಯ ಸಂಸ್ಕೃತಿ ಪೋಷಕನೂ, ಭವಿತವ್ಯ ಪ್ರದನೂ ಆದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಭವಿತವ್ಯಮಂ ll ೬೫ ll

ಭಾವಜ್ಜನೂ, ಭಾವಶುದ್ಧನೂ, ಭವ್ಯವೃದ್ಧನೂ ಭಾವಸಿದ್ಧನೂ, ಭಾವಿಕಪಾಲಕನೂ ಆದ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಭಾವಶುದ್ಧಮಂ ll ೬೬ ll

ಓಂ ಭಾಸುರನೇ, ಭಿನ್ನಭಾವ ಶೂನ್ಯವೇ 
ಭುವನ ರಕ್ಷಕನೇ ಭು ವಾಸಾಧಿಪನೇ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಭಾಸುರತ್ವಮಂ ll ೬೭ ll

ಹೇ ಭೂತಾತ್ಮ ನೃತ್ಯಭೃತಾಯ 
ಭೈರವ ಪೋಷಣ ಭೌಮಬಲ
ಶ್ರೀ ವೀರೇಂದ್ರ ನೆಲಸಿರ್ಪುದೆಮ್ಮ ಹೃತ್ಕಮಲದೊಳು ll ೬೮ ll

 ಓಂ ಮಣಿಮಂಟಪಾಧ್ಯಕ್ಷ, ಮಥನಹರಣ
ಮದನಹರ, ಮನಃ ಪ್ರಸಾದಾಯ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಮಣಿಮಂಟಪದಕ್ಷಪದವಿಯಂ ll ೬೯ ll

ಹೇ ಮನಃ ಕಷಾಯ ನಿವಾರಕ 
ಮನೋನಿಗ್ರಹಕ ಮಂದಸ್ಮಿತ ಮರಜ್ಞ 
ಶ್ರೀ ವೀರೇಮದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸಂಯಮಮಂ ll ೭೦ ll

ಓಂ ಮಲತ್ರಯ ಪ್ರಕ್ಷಾಲಯ, ಮಲ್ಲಿಕಾರ್ಜುನ ಮಹೋದಯ, ಹೃದಯ ಮಹಂತಚಿತ್ತ
ಶ್ರೀ ವೀರೇಂದ್ರ ಪ್ರಕ್ಷಾಲಿಪುದೆಮ್ಮ ಮಲತ್ರಯಮಂ ll ೭೧ ll

ಓಂ ಮಹಾತ್ಮ ಮಹವೀರ ಮಹಾಪ್ರತಾಪ
ಮಹಾರಥಿಕ ಮಹಿಳಾಮೌಲ್ಯಪ್ರದಾಯ
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಸೆಮ್ಮ ಮಹಿಳಾಮೌಲ್ಯಮಂ ll ೭೨ ll 

ಹೇ ಮಹೇಶ್ವರಾ ಮಹೋತ್ಸವಪೂರ್ಣ 
ಮಾನನಿಧಿ ಮಾನನೀಯ ಮಹಾಕಾಳಿಸುತ ಮಾಯಾವಹವಿಸರ್ಜಕ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಮಾನಧನಮಂ ll ೭೩ ll

ಮಿತಭಾಷಿತ, ಮಿಳಿತಜೀವಿತ, ಮುಕುಟಧರ,
ಮುಕ್ತಹಸ್ತ, ಮುಕ್ತಮಾಲಾ. ಭೂಷಣ, ಮಹಾಲಿಂಗಾರ್ಚಕ ಶಕ್ತ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಲಿಂಗಾರ್ಚಕ ಶಕ್ತಿಯಂ ll ೭೪ ll

ಮುಖಭಾವ ಇಂಗಿತವನರಿಯಬಲ್ಲ, 
ಮುಖಸ್ತುತಿಗೆಡೆಗೆ ಅವಕಾಶವೀಯದ 
ಮುದಿತಮುಖ ಮುನಿರಕ್ಷಕ
ಶ್ರೀ ವೀರೇಂದ್ರ ನೀಡೆಮಗೆ ಅಂತಃ ಸಾಕ್ಷಿಯಂ ll ೭೫ ll

ಮೂಲಾಧಾರ ಸ್ವರೂಪಿ, ಮೂಲ ವೀರಶೈವ ಮೂಲಧರ್ಮಾಚಾರ್ಯ, ಮನುಕುಲದ ಮೂಲನಿವಾಸಿ, ಮೇಳಪ್ರಿಯ,
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಸೆಮಗೆ ವೀರಶೈವತ್ವಮಂ ll ೭೬ ll

ಮೋದಕ ಕರ, ಮೋಸರಹಿತ ಸಮ್ಮೋಹನ
ವಿನಾಶಕ ಮೋಹಪಾಶ ನಿರ್ಮೂಲಕ, ಮೌನಿ ಮೌಲಿಕ, ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಬಾಳ ಮೌಲಿಕಮಂ ll ೭೭ ll

ಓಂ ಪಕ್ಷಪಕ್ಷಾಂತರ ಪರಿಹಾರಕ 
ಪಾಪಪಂಕ ಪ್ರಕ್ಷಾಲಕ, ಪಾದಪಂಕಜ 
ಶ್ರೀ ವೀರೇಂದ್ರ ರಕ್ಷಿಸಮಂ ಪಾಪ ಪಂಕದಿಂ ll ೭೮ ll

ಓಂ ಫಣಿಹಸ್ತ ಅಭಯ ಪ್ರದಾಯಕ, 
ಪತಿತ ಪಾವನ, ಪ್ರಪ್ರಥಮ ಪ್ರತಿಮಾನ್ವಿತ ಪಥದರ್ಶಕ ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ವುದೆಮಗೆ ಪಥದರ್ಶನಂ ll ೭೯ ll

ಓಂ ಪದ್ಮಲೋಚನ, ಪದ್ಮನಯನ, 
ಪರಂಜ್ಯೋತಿ ಸ್ವರೂಪ, ಪರಮಾನಂದ ಪ್ರದಾಯಕ, ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪರಂಜ್ಯೋತಿ ರೂಪಂ ll ೮೦ ll

ಓಂ ಪರಮಾನಂದ ಪ್ರದಾಯಕ, 
ಪರಮಾರ್ಥ ಪ್ರಮೋದಾಯ, 
ಪರಮಾವಧಿ ಪರಾಕ್ರಮ ಪಂಚಾಚಾರ್ಯ ಪ್ರಾಣಸ್ವರೂಪಿ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪರಮಾರ್ಥ ಬೋಧಮಂ ll ೮೧ ll

ಓಂ ಪರಮ ಪ್ರತಿಭಾನ್ವಿತ, ಪರಿಣಾಮಕಾರಿ ಪ್ರಕ್ರಿಯ ಪರಿಭ್ರಮನ ಪರಿಹಾರಕ, ಪರಿಶೋಧನ ಪ್ರಬುದ್ಧ ಪರಿವೃತ ಶಿವ ಸಮಸ್ಯ ಸಂಹಾರಕ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪರಮ ಪ್ರತಿಭೆಯಂ ll ೮೨ ll 

ಓಂ ಪರಿಸ್ಥಿತಿ ಸುಸ್ಥಿತಿಕರ್ತ, ಪರಿಶಿಷ್ಟವರ್ಗೋದ್ಧಾರಕ
ಪರೀಕ್ಷನ ಪ್ರವೀಣ, ಪರುಷಹಸ್ತ ಪ್ರಕೃತಿ ವಿಕೃತಿ ವಿಜಯವೀರ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸುಸ್ಥಿತಿಯಂ ll ೮೩ ll

ಓಂ ಪರಮಾರ್ಥಕರ ಸಿದ್ಧ ಪ್ರಬುದ್ಧ 
ಪವನಪುತ್ರ ಕಾರುಣ್ಯ ಪ್ರದಾಯಕ 
ಪಂಚೇಮದ್ರಿಯ ಲಿಂಗಸ್ವರೂಪಿ, ಪುರುಷಾರ್ಥ ಪ್ರದಾಯ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪರಮಾರ್ಥಮಂ ll ೮೪ ll

ಓಂ ಪುರುಷತ್ವ ಪ್ರದಾಯಕ, ಪೂಜಾಮಂಟಪ ಸ್ಥಾಪಕ, ಪೂಜಾವಿಧಿ ವಿಧಾನ ಪ್ರಬೋಧಕ, 
ಪೂರ್ಣಾಭಿಲಾಶ ಪ್ರದಾಯಕ ಪ್ರಗಲ್ಯ ಪ್ರತಿಭಾವಂತ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪುರುಷತ್ವಮಂ ll ೮೫ ll

ಓಂ ಸಮೃದ್ಧಿಕರಣ, ಸಂಭಾವ್ಯಪ್ರಿಯ, 
ಸಮ್ಯಕ್‌ಕರುಣ, ಸವ್ಯಸಾಚಿ ಸಂಪನ್ನ, 
ಸಾಂತ್ವನ ಶೀಲ, ಸಾರೋದ್ಧಾರ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸಮೃದ್ಧಿಯಂ ll ೮೬ ll

ಓಂ ಸುಭದ್ರವೀರ ಶಿವಗಣಾಚಾರ್ಯ, 
ಶ್ರೀಗುರು ಸಾರ್ವಭೌಮ ಸರ್ವಸಿದ್ದಹಸ್ತ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ವುದೆಮಗೆ ಸುಭದ್ರತೆಯಂ ll ೮೭ ll

ಓಂ ಚರ್ಮವಾಸ ಚಾರಹಸ್ಯ
ಗ್ರಹಭೇತಾಳ ಮಾರಿಗಣ ವಿಭಂಜಕ 
ಯೋಗೀಂದ್ರ ಸರ್ವವೇದ ಶಿರೋರತ್ನ. 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ಪುದೆಮಗೆ ನಿರ್ವಿಘ್ನಮಂ ll ೮೮ ll

ಓಂ ಸಹಸ್ರಬಾಹು ಸರ್ವಜ್ಞ 
ಸಚ್ಚಿದಾನಂದ ಭಕ್ತವಾಲೋಕನ
ಸರ್ವಾಭೀಷ್ಟ ಪ್ರದಾಯಕ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸಚ್ಚಿದಾನಂದಮಂ ll ೮೯ ll

ಓಂ ಬಂಧ ವಿಮೋಚಕ ಶಾಶ್ವತವೀರ 
ಗುಪ್ತನಿಧೀಶ್ವರ ಸರ್ವಸಿದ್ಧಿಕರ ಸಕಲಾಗಮ ಶೋಭಿತ
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ಪುದೆಮಗೆ ಸರ್ವಸಿದ್ಧಿಯಂ ll ೯೦ ll

ಸಮಸ್ತ ರೋಗನಿವಾರಕ ಮಂತ್ರನಾಯಕ
ವಿರಕ್ತರಿಗೆ ವಿರಾಗಮಂ ನೃಪರಿಗೆ ಜಯಂ, 
ವ್ರತಸ್ಥರಿಗೆ ಶುಭಫಲಮ ಕರುಣಿಸಬಲ್ಲ | 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ವುದೆಮಗೆ ಭೂತಪ್ರೇತ ವಿನಾಶಮಂ ll ೯೧ ll

ವೀರಾಗಮ ಪಂಡಿತ ವೀರವೃದ್ಧಿಪ್ರಿಯ ಮಮಸಾಯುಜ್ಯ ಪ್ರದಾಯಕ 
ಜನ್ಮಸಂಸಾರ ವರ್ಜಿತ ಭದ್ರಕವಚಕರ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಭದ್ರಕವಚಮಂ ll ೯೨ ll

ಓಂ ಭದ್ರಾವತಾರ, ಭಾರತದ ಭಾಗ್ಯಚೇತನ,
ಮಾನವತಾಪ್ರೇಮಿ, ವೀರಶ್ರೀವಿರಾಜಿತ, 
ಪ್ರಪ್ರಥಮ ಕ್ರಾಂತಿವೀರ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಭಾಗ್ಯಮಂ ll ೯೩ ll

ಓಂ ಸರ್ವಜೀವಿಸರ್ಶಿ, ಭುವನಜೀವ ಸಮದರ್ಶಿ, ವಿಶ್ವಬಂಧು, ವಿಶ್ವವಿಘ್ನ ನಿವಾರಕ,
ಸುಪ್ರಸನ್ನ ಸುಪ್ರಭಾತಕರ 
ಶ್ರೀ ವೀರೇಂದ್ರ ನೀಡಮಗೆ ಸುಪ್ರಸನ್ನಮಂ ll ೯೪ ll

ಓಂ ಆರ್ಯ ದ್ರಾವಿಡ ಸಮನ್ವಯಶೀಲ
ಅರ್ಯವರ್ತಾಧೀಶ, ಸ್ಥೈರ್ಯ ಧೀರಗುಣ ಗಾಂಭೀರ್ಯ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸಮನ್ವಯ ಶೀಲಮಂ ll ೯೫ ll

ಬಲಿ ಎಂದು ಹಸು ಎತ್ತು ಕುರಿ ಕೋಣಗಳ ಕೊಲುವ ಯಜ್ಞನಿರೋಧ ಕ್ರಾಂತಿಯನೆಸಗಿದ ಯಶೋವಂತ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸುಯಜ್ಞಫಲಮಂ ll ೯೬ ll

ಕುರುಬರಿಗೆ ಡೊಳ್ಳು ಡೋಲುಗಳ ಕಾಯಕವ ಕೊಟ್ಟೆ. ಶಿವನಿಗೆ ಡಮರುಗವನಿತ್ತು ಸಯ್ತಿಟ್ಟೆ 
ಲಿಂಗದ ವೀರರಿಗೆ ಕರಡೆಸವಾಳವನಿತ್ತು ಕರುಣಿಸಿದೆ ಆದಿಕನ್ನಡಿಗರಿಗೆ ಹಲಗೆಗಳನಿತ್ತು ಆದರಿಸಿದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ವುದೆಮಗೆ ಕಾಯಕ ಮನಮಂ ll ೯೭ ll

ಕಲೆಗಾರ ಶಿಲ್ಪಿ ನೀನು ಶಿಲ್ಪಿಗೆ ಗುರುವಾದೆ 
ಪಂಚಾಳರಿಗೆ ಪ್ರಾಣಪ್ರತಿಷ್ಠೆಯ ಬಣ್ಣಿಸಿದೆ 
ಪುರವಂತರು ಪುರರಕ್ಷಣೆಗೈವಂತೆ ಮಾಡಿದೆ ವೀರಗಾಸೆಯ ನುಡಿದ ವೀರರಿಗೆ ಒಲಿದುಬಂದೆ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಪ್ರಾಣಪ್ರತಿಷ್ಠೆಯಂ ll ೯೮ ll

ಲಿಂಗಜಾತಿ ಪಂಥಗಳ ಭೇದವಿಲ್ಲದ 
ಬಡವ ಬಲ್ಲಿದರೆಂಬ ಭಾವವಿಲ್ಲದ 
ಸಂಕುಚಿತ ಸ್ವಾರ್ಥವನರಿಯದ ವಿವಾದಕ್ಕಿಳಿಯದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಸಮತೋಲನಮಂ ll ೯೯ ll 

ಸಹಸ್ರ ತಾವರೆಯ ಪೂಜೆಯಲ್ಲಿ ನಿರತ ವಿಷ್ಣುವಿಗೆ
ಒಂದು ತಾವರೆಯ ಕೊರತೆಗೈದೆ 
ವಿಷ್ಣು ತನ್ನ ಕಣ್ಣನ್ನೇ ಕಿತ್ತು ನಿನ್ನಡಿಗಿಡೆ
“ಕಣ್ಣಡಿಗ"ನೆಂಬ ಬಿರುದುಪಡೆದ, 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಕನ್ನಡಭಾಷಾ ಪ್ರದೀಪಮಂ ll ೧೦೦ ll 

ಕನ್ನಡಿಗರ ಮೂಲಪುರುಷ ಕನ್ನಡನಾಡಿನ ಪುನೀತತಾಣಗಳಲ್ಲೆಲ್ಲ ಅಣುಶಕ್ತಿ ರೂಪದಲಿ ತೋರ್ಪ ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದು ಕನ್ನಡನಾಡಿಗೆ ಶ್ರೇಯೋಭಿವೃದ್ಧಿಯಂ ll ೧೦೧ ll

ಮೊರಬ ಕಾರ್ಕಳ ಕಲ್ಯಾಣ ಗದುಗು ತಿರುಪತಿ ಎಡೆಯೂರು ಗೊಡಚಿ ಉಳವಿ 
ಕೂಡಲಿಗೆ ಸಿರಿಗಿರಿ ಹುಮನಾಬಾದ ಗೂಳೂರು ನಿಡುಮಾವಿಡಿ ಬಾಳೆಹೊನ್ನೂರಲಿ ವಿರಾಜಿಪ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಸದಾನೆಲಸು ಎಮ್ಮೀ ಹೃದಯ ಪದ್ಮದಲಿ ll ೧೦೨ ll

ರುದ್ರ ಕಾಳವ್ವೆಯರ ಪುತ್ರ 
ಭದ್ರಕಾಳೀ ಭವಾನಿಪತಿ 
ಶಿವ ಪ್ರಭಾವಳಿಯ ನಿರ್ಮಿಸಿದ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಸೆಮಗೆ ಶಿವತತ್ವಂ ll ೧೦೩ ll

ವೀರಶೈವ ಸಂಸ್ಥಾಪಕ ವೀರಧ್ವಜ ನಿರ್ಮಾಪಕ
ವೀರಗಣಾಧಿನಾಯಕ 
ಮಾನವತಾ ಮೌಲ್ಯ ಸಂಸ್ಥಾಪಕ 
ವಿವಿಧ ವೃತ್ತಿ ಪ್ರದಾಯಕ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ವಿವಿಧ ವೃತ್ತಿಯಂ ll ೧೦೪ ll

ಶಿವರಾಜ್ಯದ ವೀರ ಶಿವಸಂಸ್ಕೃತಿ ಚಕ್ರವರ್ತಿ ವೀರಮುದ್ರಾಭರಣ, ವೀರಗಚ್ಚೆಯವೀರ, 
ವೀರ ಕಂಕಣಧರ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಶಿವ ಸಂಸ್ಕೃತಿಯಂ ll ೧೦೫ ll

ದ್ವಿಜಹೋಮ ವಿನಾಶಕ 
ದಕ್ಷಧ್ವರಹರ ಪಂಚಸೂತಕ ನಿರ್ಮುಕ್ತ
ಧರ್ಮಾರ್ಥ ಕಾಮಮೋಕ್ಷ ಪ್ರದಾಯಕ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಮಾಳ್ವುದೆಮಗೆ ಮೋಕ್ಷಮಂ ll ೧೦೬ ll

ಯೋಗ ನಿದ್ರಾವಿಲಾಸ, ಭೋಗಭಾಗ್ಯ ಪ್ರದಾಯಕ ಪಿತೃಕರ್ಮ ವಿನಾಶಕ, ಪ್ರಾಣಲಿಂಗ ಪೂಜಕ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕರುಣಿಪುದೆಮಗೆ ಯೋಗನಿದ್ರಾ ವಿಲಾಸಮಂ ll ೧೦೭ ll

ಭಸ್ಮದೂಳಿತ ದೇಹಾಯ ಅರಿಷಡ್ವರ್ಗದಗ್ದಾಯ
ಪಂಚಾಕೋಶದ ಭದ್ರಪೀಠಾಸೀನ 
ಚಿಚ್ಛಕ್ತಿ ಜ್ಞಾನಮೂರ್ತಿ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಸದಾ ನೆಲಸುಗೆ ಎಮ್ಮಾತ್ಮಪೀಠದಲಿ ll ೧೦೮ ll

*ಇತಿ ಶ್ರೀ ಸಿ. ಎಂ. ವೀರಭದ್ರಾರ್ಯ ವಿರಚಿತ 
ಶ್ರೀ ವೀರೇಂದ್ರ ಕಾವ್ಯಾಂಕಿತ ಶ್ರೀ ವೀರಭದ್ರ ಶತಕ ವಚನಕ್ಕೆ ಮಂಗಲಮಸ್ತು*

            </Text>
          </ScrollView>
        </View>
        <View style={styles.page} key="3">
          <Text style={styles.textalign}> Page 3 </Text>
          <Text style={styles.textalign}>
            *ಶ್ರೀವೀರಭದ್ರೇಶ್ವರ ವಡಪು* 
            {"\n"}{"\n"}
            ಆಹಾ ರುದ್ರಾ l ಆಹಾ ವೀರಾ l ನಿಲ್ಲಿಸಬಹುದಯ್ಯಾ ಒಂದೇ
            ಮಂತ್ರದಿಂದ ಕಾಳೋರಗನ | ನಿಲ್ಲಿಸ ಬಹುದಯ್ಯಾ ಒಂದೇ ಮಂತ್ರದಿಂದ ಹಾರುವ ಪಕ್ಷಿಯ |
            ನಿಲ್ಲಿಸಬಹುದಯ್ಯಾ ಒಂದೇ ಮಂತ್ರದಿಂದ ಹೆಬ್ಬುಲಿಯ | ನಿಲ್ಲಿಸಬಹುದಯ್ಯಾ ಒಂದೇ
            ಮಂತ್ರದಿಂದ ಈ ಹೆಮ್ಮಾರಿಯ ಲೋಭವೆಂಬ ಗ್ರಹಣಹಿಡಿದವರನ್ನು ಯಾತರಿಂದಲೂ ಬಿಡಿಸುಲಾಗದು
            l ಈ ಲೋಭಕ್ಕೆ ದರಿದ್ರವೇ ಔಷಧ | ಹೇಳಿದರೆ ಕೇಳರು | ತಾವೂ ತಿಳಿಯರು | ಶಾಸ್ತ್ರವ
            ಭಕ್ತಿಯ ಹಿಡಿಯರು l ಇಂಥ ಗೊಡ್ಡ ಮೂಳ ಹೊಲೆಯರಿಗೆ | ಕರ್ಮವೆಂಬ ಶರಧಿಯಲ್ಲಿ ಬಿದ್ದು
            | ಉರುಳಾಡುವುದೇ ಸತ್ಯವೇದಾಂತ ನಮ್ಮ ಅಂಬಿಗರ ಚೌಡಯ್ಯ ಕಡೆ ಕಡೆ....... *ಶ್ರೀ
            ವೀರಭದ್ರೇಶ್ವರ ಪ್ರಚಾರ ಸಮಿತಿ*
          </Text>
        </View>
      </PagerView>
    </View>
    );
  }
}
const styles = StyleSheet.create({
  MainContainer: {
    position: "absolute",
    top: 0,
    left: 0,
    width: "100%",
    height: "100%",
    paddingTop: Platform.OS === "ios" ? 20 : 0,
  },

  image: {
    flex: 1,
  },
   viewPager: {
    flex: 1,
    marginTop: 0,
    backgroundColor: '#fe724c',
    padding: 15,
  },
  page: {
    justifyContent: 'center',
    alignItems: 'center',
  },
  textalign: {
    textAlign: 'justify',
    fontSize: 20,
    color: '#ffffff',
    padding: 15,
  },
});

TypingText.propTypes = {
  text: PropTypes.string,
  color: PropTypes.string,
  marginTop: PropTypes.number,
  marginHorizontal: PropTypes.number,
  textSize: PropTypes.number,
  fontFamily: PropTypes.fontFamily,
  typingAnimationDuration: PropTypes.number,
  blinkingCursorAnimationDuration: PropTypes.number,
};

TypingText.defaultProps = {
  text: "Default Typing Animated Text.",
  color: "rgb(255,223,0)",
  marginTop: 30,
  marginHorizontal: 30,
  textSize: 18,
  fontFamily: "Courgette.Regular",
  typingAnimationDuration: 5,
  blinkingCursorAnimationDuration: 450,
};