import React from 'react';
import {StyleSheet, View, Text, ScrollView} from 'react-native';
import PagerView from 'react-native-pager-view';

const MyPager = () => {
  return (
    <View style={{flex: 1}}>
      <PagerView style={styles.viewPager} initialPage={0}>
        <View style={styles.page} key="1">
          <ScrollView>
            <Text style={styles.textalign}> Page 1 </Text>
            <Text style={styles.textalign}>
              *ಶ್ರೀ ವೀರಭದ್ರ ತಾರಾವಳಿ* {'\n'}
              {'\n'}
              (ಶಾರ್ದೂಲವಿಕ್ರೀಡಿತ) ಶ್ರೀ ವೀರಾಗ್ರಣಿ ವೀರಭದ್ರನತೆ ದಾರಿದ್ರಘವಿಚ್ಛೇದನಂ |
              ಶ್ರೀ ವಿಶ್ವೇಶಮನಶ್ಚ ಕೋರಶಶಿನಂ ದಕ್ಷಧ್ವರ ಧ್ವಂಸನಂ || ಶ್ರೀ ವಾಸ್ತೋವ್ಯತಿ
              ವಂದಿತಾಂಘ್ರಯುಗನಂ ಮೋಹಾಂಧಕಾರಘ್ನೆನಂ | ಶ್ರೀ ವೀರೇಶನ ಸೇವಿಪೇಂ ಸಲಹುಗೇ ಶ್ರೀ
              ಭದ್ರಕಾಳೀ ಪ್ರಿಯಂ || ೧ || ಕಂದ || ಶ್ರೀಗಜವದನಾನುಜನೆ | ಆಗಮವಂದಿತನೆ
              ಅಖಿಳಸುರಸೇವಿತನೇ || ಈಗೆಮಗಿಷ್ಟಾರ್ಥಂಗಳ | ಬೇಗದಿ ಶ್ರೀವೀರಭದ್ರಕರುಣ ಸಮುದ್ರಾ
              || ೨ || ದಾಕ್ಷಾಯಣಿ ವರಪುತ್ರನೆ l ದಕ್ಷಧ್ವರಹರನೆ ಉರಗಧರಶು ಭಕರನೇ |
              ದಕ್ಷೀಂದ್ರ ಗಮನವಿನುತನೆ | ರಕ್ಷಿಸು ಶ್ರೀವೀರಭದ್ರ ಕರುಣ ಸಮುದ್ರಾ || ೩ ||
              ಹರನುರಿಗಣ್ಣಿನಜ್ವಾಲೆಯೊ | ಳುರೆ ನೀನುದ್ಭವಿಸಿ ದುರಿತತರುಹರನೆನಿಸೀ || ಹರಿ
              ಅಜಸುರರೀಸೇವಿಸಿ | ಮೆರೆವೈ ಶ್ರೀ ವೀರಭದ್ರ ಕರುಣ ಸಮುದ್ರಾ || ೪ ||
              ದಕ್ಷನದಕ್ಷತೆಯನು ನೀಂ | ಸೀಕ್ಷಿಸಿರಕ್ಷಿಸಿದ ಮೋಕ್ಷದೀಕ್ಷಾಕರನೇ || ಇಕ್ಷುವರ
              ಹರನಪುತ್ರನೆ ಈಕ್ಷಿಸು ಶ್ರೀ ವೀರಭದ್ರ ಕರುಣ ಸಮುದ್ರಾ ll ೫ ll ಭದ್ರಕರರುದ್ರ
              ಸಂಭವ | ಕ್ಷುದ್ರೌಘವಿಚಿದ್ರದೂರಿಕೃತದಾರಿದ್ರಾ || ಭದ್ರಾಂ ಗನತಸುರದ್ರುಮ |
              ಚಿದ್ರೂಪನೇ ವೀರಭದ್ರ ಕರುಣಸಮುದ್ರಾ || ೬ || ಸುರರಂಪಾಲಿಸೆಮೋದದಿ |
              ಪುರಹರನಾಜ್ಞೆಯಲಿ ರಿಸಿಕರಭಾಕೃತಿಯಂ | ನರಹರಿಯತರಿದುಲೋಕವ ಪೊರೆದೈ ಶ್ರೀ
              ವೀರಭದ್ರ ಕರುಣ ಸಮುದ್ರಾ|| ೭ || ವೀರನೆ ಭಕ್ತಮನಸ್ಸಂ | ಚಾರನೆಭವಹರನೆಸಾರತ
              ರಸುಖಕರನೇ || ಧೀರಗುಣ ಪೂರನತಮಂ | ಧಾರನ ಶ್ರೀ ವೀರಭದ್ರ ಕರುಣ ಸಮುದ್ರಾ || ೮
              || ದಿನಕರದಂತವಿಭಗ್ನನೆ | ಅನಿಮಿಷವಂದಿತನೆ ಭಕ್ತರಘಸಂಹರನೆ l ಅನುದಿನತವದವದೈವ |
              ನೆನವನು ಶ್ರೀ ವೀರಭದ್ರ ಕರುಣ ಸಮುದ್ರಾ|| ೯ || ಹುಂಕಾರದಿ ದಕ್ಷನವರ |
              ಬಿಂಕವನಪಹರಿಸಿ ಶಿರವನುಪಸಂಹರಿಸೀ | ಅಂಕಿತಕಜಶಿರವಿನಿರಿಸಿದ | ಶಂಕರ ಶ್ರೀ
              ವೀರಭದ್ರ ಕರುಣ ಸಮುದ್ರಾ|| ೧೦ || ಕಂಕಾಳಧರನೆತವದದ | ಪಂಕಜಸ್ಮರಣೆಯಲ್ಲಿ
              ಭೂತಭೇತಾಳಗ್ರಹ || ಸಂಕುಲ ನಿಲುವವೆಭಕ್ತನು ಖಂಕರ ಶ್ರೀ ವೀರಭದ್ರ ಕರುಣಾ ಸಮುದ್ರ
              ll ೧೧ ll ನರಭದ್ರಕಾಳಿವದನಾಂ | ಬುರುಹಾರಡಿದೀನಜನಕೆ ನೀಂದಯಮಾಡೀ |
              ಕರುಣಿಸುಯಿಷ್ಟಾರ್ಥವ ಶುಭ | ಕರವರಶ್ರೀ ವೀರಭದ್ರ ಕರುಣ ಸಮುದ್ರಾ|| ೧೨ ||
              ಅಡಿಗಡಿಗೆನಿನ್ನ ಸ್ಮರಣೆಯ | ಬಿಡದಾಂನುತಿಗೈವತೆರದಿ ಕೊಡುಸನ್ಮತಿಯಂ || ಜಡಮತಿಯ
              ಬಿಡಿಸಿನಂತತ | ಮೃಡಸುತಶ್ರೀ ವೀರಭದ್ರ ಕರುಣ ಸಮುದ್ರಾ || ೧೩ ||
              ಮೃಡನಕಿಡಿಗಣ್ಣಿನೊಳು | ಘುಡಿಘುಡಿಸುತವೊರಮ ಡುತೆಜಡಿದುಖಡುಗನಪಿಡಿದಾ
              |ರ್ಭೇವಿಸಿಸದೆಬರಿದೆದಕ್ಷನ | ಕಡುಗರಿ ಶ್ರೀ ವೀರಭದ್ರ ಕರುಣ ಸಮುದ್ರಾ || ೧೪ ||
              ಇಂದುಮುಖಿ ಭದ್ರಕಾಳಿಯ | ಕಂದುಟಿಯಂ ಸವಿವಸುಖದಿಮರೆಯದಿರನ್ನಂ ||
              ಕಂದನತೆರದಿಂದಲಿಪೊರೆ | ಚಂದದಿ ಶ್ರೀ ವೀರಭದ್ರ ಕರುಣ ಸಮುದ್ರಾ|| ೧೫ ||
              ಚಂದಿರಮುಖಸುಂದರನಿ | ನ್ನೆಂದೆಂದಿಗು ಮರೆಯದಂತೆ ಸಂಧಿಸುಮತಿಯಂ ।।
              ಬಂಧುರರೂಪನೆಸದ್ಗುಣ | ಬೃಂದನೆ ಶ್ರೀ ವೀರಭದ್ರಕರುಣ ಸಮುದ್ರಾ || ೧೬ ||
              ಚಲದಂಕಫಲಕರಶ್ರೀ | ಲಲನಾಮಣಿಭದ್ರಕಾಳಿ ಪ್ರಿಯಕೃಪೆತಾಳೀ | ಸಲಹೆಮ್ಮ ಸುಗುಣಪಾಳೀ
              | ಸುಲಲಿತಶ್ರೀ ವೀರಭದ್ರಕರುಣ ಸಮುದ್ರಾ || ೧೭ || ರುಂಡಾವಳಿಧಾರಣಭವ |
              ಖಂಡನಮಂಡಿತಸುರಾಳಿ ಮಕುಟಸುಚರಣಾ | ಖಂಡೆಂದುಧರನಸುತಗುಣ | ಮಂಡನ ಶ್ರೀ ವೀರಭದ್ರ
              ಕರುಣಸಮುದ್ರಾ || ೧೮ || ಶಾಕಿನಿಢಾಕಿನಿಮುಖನರ | ಭೀಕರಗ್ರಹವಿತಿಯ
              ಮೈಸೋಕದತೆರದಿಂ || ನೀಕೃಪೆಗೈಯುತವೊರೆನತ || ಶ್ರೀ ಕರಶ್ರೀವೀರಭದ್ರ ಕರುಣ
              ಸಮುದ್ರಾ || ೧೯ || ಅಂಬುಜಮುಖಿತನಪ್ರೀಯಳ | ಬಿಂಬಾದರವನ್ನು
              ಸವಿದುಚುಂಬಿಪನೆವದಿಂ ನಂಬಿದರನುರೆವರೇಪಿ | ವ್ಯಾಂಬರಶ್ರೀವೀರಭದ್ರ ಕರುಣ
              ಸಮುದ್ರಾ|| ೨೦ || ಅಂಗಜಮದಂಗನನುತ | ಸಂಘಟಿಸೈಸುಖವತುಂ ಗಬಲನೀನೆನ್ನೋಳ || ಮಂಗಳ
              ಮೂರುತಿವೃಷಭತು | ರಂಗನ ಶ್ರೀ ವೀರಭದ್ರ ಕರುಣಸಮುದ್ರಾ || ೨೧ ||
              ತ್ರಿಣಯನಪ್ರಣುತಾಂಗನೆಸುರ | ಗಣವಂದಿತಚರ ಣಅಣುಗನನ್ನಂಸಲಹೈ
              ಮಣಿಮಣಿದುನುತಿವೆನ್ನಿನು | ಗುಣನಿಧಿಶ್ರೀ ವೀರಭದ್ರ ಕರುಣ ಸಮುದ್ರಾ || ೨೨ ||
              ಅರುಣಕಿರಣಾಂಬರಾವೃತೆ | ತರುಣೀಮಣಿಭದ್ರ ಕೌಳಿಕರವಿಡಿದುದರಿಂ ||
              ಧರಣಿಯಲಿಪೂರ್ಣನಾದೈ | ವರ ಗುಣಶ್ರೀ ವೀರಭದ್ರ ಕರುಣಸಮುದ್ರಾ|| ೨೩ ||
              ರಶಿವದನಿವಿರುಮರ್ಲೋಚನ | ಬಸಜಾನನೆಭದ್ರಕಾಳಿಮಖಬಂಟರನೀಂ || ಝಸವೆತ್ತು
              ವಾಲಿಸಮ್ಮನು | ಕುಶಲದಿಶ್ರೀ ವೀರಭದ್ರ ಕರುಣಸಮುದ್ರಾ || ೨೪ || ನೂತನವಲ್ಲಿ
              ನಿವಾಸನೆ | ಕಾತೋದರಿಭದ್ರಕಾಳಿಸು ಖದಾಯಕನೆ | ಭೂತಗಣ ನಾಥಸದ್ಗುಣ | ವೊತನೆ ಶ್ರೀ
              ವೀರಭದ್ರ ಕರುಣ ಸಮುದ್ರ ll ೨೫ ll ಮಂಗಳವಾಗಲಿನಿನಗೆಕು | ರಂಗಾಂಬಕಿ ಭದ್ರಕಾಳಿ
              ಪ್ರೀಯನವೃಪಭತು ರಂಗನೆನರಶಿಂಗನಭವ || ಭಂಗನೆ ಶ್ರೀ ವೀರಭದ್ರಕರುಣ ಸಮುದ್ರ|| ೨೬
              || ಮಂಗಳದೀನದಯಾಳುವೆ ಮಂಗಳಣಭಜಕಾಳಿಗನಿಶವರಸುರತರುವೆ || ಮಂಗಳಜಯಮಂಗಳ ಶುಭಮಂಗಳ
              ಶ್ರೀ ವೀರಭದ್ರಕರುಣಸಮುದ್ರ || ೨೭ || ಶ್ರೀ ವೀರಭದ್ರವರದಾ | ಜೀವಸ್ತುತಿಯನ್ನ
              ಮತಿಗೆ ಮಂಗಳವೀಯಲೆ ಈವರತಾರಾವಳಿಯಂ | ಕೋವಿದರಾಮೋದಿನಲ್ಕೆರಚಿಸಿದೆನೊಲವಿಂ || ೨೮
              || ಮಂಜುಳ ಹೊಸಹಳ್ಳಿಯೊಳಿಹ | ಕಂಜಾನನವೀರ ಭದ್ರ ಭಕ್ತಾಗ್ರಣಿತಾಂ |
              ರಂಜಿಪಮಳೂರುವಾಸಿಪ | ನಂಜಪ್ಪಾಚಾರ್ಯರಿದನುರಚಿಸೆಂದೊರೆಯಲೇ || ೨೯ ||
              ಭುವಿಯೊಳಿದಪರಿವಭಕ್ತರಿ | ಗವಿರಳಮೋದವನು ಭದ್ರಕಾಳೀಧವತಾಂ ||
              ನವಿನಯದೊಳೀಯಲೆನ್ನುತೆ | ತವೆಹರುಷದಿರಚಿಸಿಹಂ ಪ್ರಸನ್ನಾಚಾರಂ || ೩೦ || ಗದ್ಯ
              || ಇದುವರಸುಧಾಂಶುಧನ ಪ್ರಮುಖಾ ಮರಾರ್ಚಿತ ವದಾಂಭೋಜಾತ ನಿಖಿಲಲೋಕವ್ರಣೀತ
              ಲೋಕೈಕನಾಥ ಶ್ರೀಗುರು ವಿಶ್ವಕರ್ಮ ನಿಜವದನಾಬ್ಜ ಸಂಜಾತಮ ಸುವರ್ನಸಗೋತ್ರ ವೊತರಸಿಕ
              ಜನನಿಚಯ ಮಾನಿತ ಶ್ರೀ ಪ್ರಸನ್ನಾಚಾರ್ಯ ವಿರಚಿತ ಶ್ರೀ ವೀರಭದ್ರ ತಾರಾವಳಿ ಸಮಾಪಂ
              || ೩೧ ||
            </Text>
          </ScrollView>
        </View>
        <View style={styles.page} key="2">
          <ScrollView>
            <Text style={styles.textalign}> Page 2 </Text>
            <Text style={styles.textalign}>
              *ಯಡೂರು ವೀರಭದ್ರಾಷ್ಟಕಂ*
              {'\n'}
              {'\n'}
              ಶ್ರೀ ವೀರಭದ್ರಗೆ ನಮಿಸುವೆ ನಾನು ಕಾಳಿಕಾ ಮಾತೆಗೆ ಕರವನು ಮುಗಿದು | ಜಗವೆ
              ಪೂಜಿಸುವ ಶಿವರೂಪಿ ನೀನು ಭಕ್ತರ ಪಾಲಿಗೆ ವರ ಕಾಮಧೇನು //೧// ಶಿವನ ಜಡೆಯಲೀ
              ಉದಿಸಿದೆ ನೀನು ಹರನ ಕೋಪಾಗ್ನಿಯ ಜ್ವಾಲೆಯು ನೀನು || ರುದ್ರಾವತಾರದಿ ಖಡೆ ಖಡೆ
              ಎನುತಲಿ ದಕ್ಷನ ಯಜ್ಞದ ಕಡೆಗೇ ನಡೆದೆ //೨// ಶಿವ ನಿಂದೆಯನು ಸಹಿಸದೆ ಸತಿಯು
              ಯಜ್ಞ ಕುಂಡದೀ ದಹಿಸುತ್ತಿರಲು || ತಾಯಿಯ ದಹನದ ದೃಶ್ಯವ ಕಂಡು ವೀರಗೆ ಹರಿದವು
              ಕಣ್ಣೀರ ಹೊಳೆಯು ||೩// ಶಿವನ ಆಜ್ಞೆಯನು ಪಾಲಿಸಲು ನೀ ದಕ್ಷನ ಸೈನ್ಯದ ದರ್ಪವ
              ಮುರಿದು || ದಕ್ಷ ಬ್ರಹ್ಮನಾ ಶಿರವನು ಹರಿದು ದಹಿಸದೆ ಅವನಾ ತಲೆಯನು ನೀನು //೪//
              ಭದ್ರನ ಕಾಯಕ ಭಕ್ತಿಗೆ ಮೆಚ್ಚಿ ಪರ ಶಿವ ತಾನು ವರವನು ನೀಡಿ || ಕೃಷ್ಣಾ ನದಿಯ ಎಡ
              ದಂಡೆಯ ಮೇಲೆ ನೆಲೆಸೀಗ ನೀನು ವಿರೂಪಾಕ್ಷ ನಾಗಿ //೫// ಶಿವನ ಆಜ್ಞೆಯಂತೆ ಯಡೂರ
              ಕ್ಷೇತ್ರದಿ ಲಿಂಗ ರೂಪದಿ ಕಂಗೊಳಿಸುತಲೀ || ಕಾಡಸಿದ್ಧರಾ ಕರುಣೆಯ ಕಣ್ಣಿಗೆ
              ಕಾಣುವೆ ನೀನು ಬೂದಿಯ ಒಳಗೆ //೬// ಕಾಡ ಸಿದ್ಧರೂ ಯಡೂರ ಜನರು ಅಗಿದರು ಅಲ್ಲಿಯ
              ಬೂದಿಯ ನೆಲ್ಲವ || ಅಲ್ಲಿ ಕಾಣುವನು ವಿರೂಪಾಕ್ಷ ಲಿಂಗಾ ಕಂಡ ಭಕ್ತರಿಗೆ ಅತಿ
              ಆನಂದ //೭// ವೀರಭದ್ರಗೆ ಒಡಪನು ಹೇಳಲು ಭದ್ರಕಾಳಿಗೆ ಭಕ್ತಿಯಿಂದ ನಮಿಸಲು ||
              ವಿಶಾಳಿ ಜಾತ್ರೆಗೆ ತೇರನು ಎಳಯಲು ಸಾವಿರ ಸಾವಿರ ಭಕ್ತರು ಬರುವರು //೮//
              ಲಿಂಗರೂಪದಲಿ ವೀರಭದ್ರನಾ ಮಹಾ ದರುಶಣಾಂ || ಯಡೂರ ವೀರಭದ್ರೇಶ ತವ ಪಾದ ಶರಣು ||
              *ರಚನೆ*:- ಶ್ರೀಶೈಲ ಶಾಸ್ತ್ರಿಗಳು, ಯಡೂರು ಪಾಠಶಾಲೆ. *ಶ್ರೀ ವೀರಭದ್ರೇಶ್ವರ
              ಪ್ರಚಾರ ಸಮಿತಿ*
            </Text>
          </ScrollView>
        </View>
        <View style={styles.page} key="3">
          <Text style={styles.textalign}> Page 3 </Text>
          <Text style={styles.textalign}>
            *ಶ್ರೀವೀರಭದ್ರೇಶ್ವರ ವಡಪು*
            {'\n'}
            {'\n'}
            ಆಹಾ ರುದ್ರಾ l ಆಹಾ ವೀರಾ l ನಿಲ್ಲಿಸಬಹುದಯ್ಯಾ ಒಂದೇ ಮಂತ್ರದಿಂದ ಕಾಳೋರಗನ |
            ನಿಲ್ಲಿಸ ಬಹುದಯ್ಯಾ ಒಂದೇ ಮಂತ್ರದಿಂದ ಹಾರುವ ಪಕ್ಷಿಯ | ನಿಲ್ಲಿಸಬಹುದಯ್ಯಾ ಒಂದೇ
            ಮಂತ್ರದಿಂದ ಹೆಬ್ಬುಲಿಯ | ನಿಲ್ಲಿಸಬಹುದಯ್ಯಾ ಒಂದೇ ಮಂತ್ರದಿಂದ ಈ ಹೆಮ್ಮಾರಿಯ
            ಲೋಭವೆಂಬ ಗ್ರಹಣಹಿಡಿದವರನ್ನು ಯಾತರಿಂದಲೂ ಬಿಡಿಸುಲಾಗದು l ಈ ಲೋಭಕ್ಕೆ ದರಿದ್ರವೇ
            ಔಷಧ | ಹೇಳಿದರೆ ಕೇಳರು | ತಾವೂ ತಿಳಿಯರು | ಶಾಸ್ತ್ರವ ಭಕ್ತಿಯ ಹಿಡಿಯರು l ಇಂಥ
            ಗೊಡ್ಡ ಮೂಳ ಹೊಲೆಯರಿಗೆ | ಕರ್ಮವೆಂಬ ಶರಧಿಯಲ್ಲಿ ಬಿದ್ದು | ಉರುಳಾಡುವುದೇ
            ಸತ್ಯವೇದಾಂತ ನಮ್ಮ ಅಂಬಿಗರ ಚೌಡಯ್ಯ ಕಡೆ ಕಡೆ....... *ಶ್ರೀ ವೀರಭದ್ರೇಶ್ವರ
            ಪ್ರಚಾರ ಸಮಿತಿ*
          </Text>
        </View>
      </PagerView>
    </View>
  );
};

const styles = StyleSheet.create({
  viewPager: {
    flex: 1,
    marginTop: 0,
    backgroundColor: '#fe724c',
    padding: 15,
  },
  page: {
    justifyContent: 'center',
    alignItems: 'center',
  },
  textalign: {
    textAlign: 'justify',
    fontSize: 20,
    color: '#ffffff',
    padding: 15,
  },
});

export default MyPager;
