import React from "react";
import { StyleSheet, View, Text, ScrollView } from "react-native";
import PagerView from "react-native-pager-view";

const MyPager = () => {
  return (
    <View style={{ flex: 1 }}>
      <PagerView style={styles.viewPager} initialPage={0}>
        <View style={styles.page} key="1">
          <ScrollView>
            <Text style={styles.textalign}> Page 1 </Text>
            <Text style={styles.textalign}>
              *ಶ್ರೀ ವೀರಭದ್ರೇಶ್ವರ ಸುಪ್ರಭಾತ* {"\n"}{"\n"}

ರುದ್ರಸ್ಯ ತನಯೋ ವೀರ ಶೂಲಾಸಕ್ತ ಮಹಾಕರ: 
ಭದ್ರಂತ ನೋತುವೋ ಭದ್ರೋ ಹಿಮಕುಂದೇಂದು ಸನ್ನಿಭ: | ಪ | 

ಉತ್ತಿಷ್ಠೋತ್ತಿಷ್ಠ ವೀರೇಶ ಉತ್ತಿಷ್ಠ ಕರುಣಾನಿಧೆ
ಉತ್ತಿಷ್ಠ ಶಿವತೇಜಸ್ಯ ಉತ್ತಿಷ್ಠ ಭವನಾಶಕ 
ಉತ್ತಿಷ್ಠ ಭದ್ರಕಾಳೀಶ ಉತ್ತಿಷ್ಠಾದಿ ವಿಮರ್ಧನ
ಉತ್ತಿಷ್ಠ ಲೋಕ ರಕ್ಷಾರ್ಥ ತ್ರಿವಿಕ್ರಮ ನಮೋಸ್ತುತೇ 1

ಪರಿಮಳವನೊತ್ತ ಮಂದಾನಿಲನಲ್ಲಿ ನಿಂದಿಹನು
ಮೂಡಣದ ರವಿರಶ್ಮಿ ನಿಶೆಯ ಮೂಡುತ್ತಿರಲು 
ಶುಕ ಪಿಕಾದಿ ಪಕ್ಷಿ ಸಂಕುಲವೆದ್ದು ಸಂಭ್ರಮದಿ
ತವ ಸುಪ್ರಭಾತವ ಪಾಡುತಿಹ ವೇಳು ಶ್ರೀ ವೀರಭದ್ರ 2

ಪರಮ ಪರತರ ಪರಂಜ್ಯೋತಿ ಪ್ರತಿಭಾನ್ವಿತನೆ
ಇಳೆಯ ಭಕ್ತರ ವರಕಲ್ಪ ತರುವೆ
ಧರೆಯೊಳೆಲ್ಲೆಲ್ಲ ನಶಿಸಿರ್ಪ ಶಿವಧರ್ಮವಂ 
ಮರಳಿ ಚೇತನಗೊಳಿಸಲೇಳು ಶ್ರೀವೀರಭದ್ರ  3 

ದುಷ್ಟ ಶಿಕ್ಷಕ ನೀನು ಶಿಷ್ಟ ಜನ ಪರಿಪಾಲಕನು
ಧರ್ಮೋದ್ಧಾರ ಸತ್ಯ ಪ್ರಕಾಶಕ ತವಕೃತಿಯೂ ಭವರೋಗ ವೈದ್ಯ ಚೈತನ್ಯ ರೂಪನೆ
ಶಾಂತಿಧೂತನೇ ನೀನೇಳು ಸದ್ಗುರು ಶ್ರೀವೀರೇಶ  4 

ಧರ್ಮ ಪ್ರವರ್ತಕನೆ ಪರತತ್ವ ಬೋಧಕನೆ
ಶಿವಾದ್ವೈತ ಪ್ರಸಾರದಲ್ಲಿ ಶಿವನ ನೆಚ್ಚಿನ ದೂತ 
ಆರ್ಯ ದ್ರಾವಿಡ ಸಂಸ್ಕೃತಿಯ ಭಾವೈಕ್ಯ ಸಾಧಕನೆ
ಧರೆಯನ್ನುದ್ಧರಿಸಲೇಳಯ್ಯ ಶ್ರೀ ವೀರಭದ್ರ  5 

ಅಂಗದೋಳು ಲಿಂಗಮಂ ಭಸಿತ ರುದ್ರಾಕ್ಷಿ ಮಾಲೆಗಳಂ
ಕಟೆಯೊಳು ನೃಸಿಂಹಾದಿಗಳ ರುಂಡ ಮಾಲೆಗಳಂ ಹಸ್ತದೊಳು ವೀರ ಖಡ್ಗಮಂ ಫಾಲದೊಳಗ್ನಿ ನೇತ್ರಮಂ ಧರಿಸಿರ್ಪ ಶಿವರೂಪಿನಿ ಬೇಗೇಳು ಶ್ರೀ ವೀರಭದ್ರೇಶ  6 

ಸಕಲವರ ಮುನಿ ಸ್ತೋಮ ದೇವ ದೈತ್ಯ ಸಂತತಿಯ ಭುವಿಯ ಭಕ್ತ ಜನರ ಸಮುದಾಯ
ಹಗಲಿರುಳು ನಿನ್ನ ನಿಷ್ಠೆಯಿಂದಾರಾಧಿಸುತಿಹುದು ತಪದರುಶನವ ನೀಡಿ ಸಲುಹಲೇಳು ಶ್ರೀವೀರಭದ್ರ  7

 

ಭಕ್ತಜನ ಕೋಟಿ ನಿನಗಾಗಿ ಭವ್ಯದೇಗುಲಗಳ ನಿರ್ಮಿಸಿ
ಸತತ ನಿನ್ನ ಲೀಲಾವಳಿಗಳಂ ನಿಷ್ಠೆಯಿಂದಾಲಿಸುತ | ಭಕ್ತ ಪರಪರತೆಯಿಂ ಮೈಮರೆತು ನಿಂದಿಹುದು
ಕೃಪೆಗೈದು ಸಲಹಲೇಳು ಶ್ರೀ ವೀರಭದ್ರ 8 

ಶಿವನ ಪಂಚ ಮುಖೋದ್ಭವ ಶ್ರೀಪಂಚಾಚಾರ್ಯರು ನಂದಿ  ಸ್ಕಂದ ಭೃಂಗಿ ಇಂದ್ರ - ಯಮ-ದಧೀಚಿ-ಗೌತಮ
ದೂರ್ವಾಸ – ವಶಿಷ್ಟ ಮೊದಲಪ್ಪ ಭಕ್ತ ಸಮುದಾಯ ತವದರುಶನವ ಬಯಿಸಿ ಬಂದಿಹುದೇಳಯ್ಯಾ ಶ್ರೀವೀರಭದ್ರ 9 

ನೀ ವೀರಶ್ರೀಯಾಗಿ ವಿಶ್ವಕ್ಕೆ ಗುರುವಾಗಿ 
ಸತ್ಯ ಸಂಕಲ್ಪನಾಗಿ ಭಕ್ತ ವತ್ಸಲನಾಗಿ ಶಿವನ
ನೆಚ್ಚಿನ ಕಡುಗಲಿಯಾಗಿ ವೀರ ಮಣಿಯಾಗಿ
ಜಗವಶೂರ್ಯರದಿಂ ಸಲುಹಲೇಳು ಶ್ರೀ ವೀರಭದ್ರ 10

ಮಾಯಾ ಪರವಶತೆಯಿಂ ಇಂದ್ರಿಯಗಳಿಗೆ ಆಳಾಗಿ
ಕ್ಷಣಿಕವಹಕಾಯ ಸುಖಂಗಳಲಿ ಮೈ ಮರೆತು
ಜನನ ಮರಣಗಳಿಗೆ ತುತ್ತಾಗಿ ಬಳಲು ತೀರ್ಪ 
ಭಕ್ತರಂ ಕರುಣೆಯಿಂ ಸಲುಹಲೇಳು ಶ್ರೀ ವೀರಭದ್ರ 11

ವೀರಾಧಿವೀರನೆ ವೀರ ಮಾಹೇಶ್ವರನೇ
ಆದಿಶೈವ ಸಿದ್ಧಾಂತ ಪ್ರತಿ ಪಾದಕನೆ
ನಂಬಿರ್ಪ ಮುನಿಜನಂಗಳಿಗೆ ಅಭಯ ಪ್ರಾದಾತಾನೆ
ಧರೆಯ ಪಾವನಗೊಳಿಸಲೇಳಯ್ಯ ಶ್ರೀವೀರಭದ್ರ 12

ಶಿವದ್ರೋಹಿ ದಕ್ಷನಾಚರಿಸಿದ ಧ್ವರಕೆ ಕರೆಯದಲೇ
ಸತಿಪೋಗೆ ಗರ್ವದಿ ಶಿವನಿಂದೆ ಗೈದ ದಕ್ಷನಂಶಪಿಸಿ
ಸತಿಯಗ್ನಿಯೋಳ ತನುವಿಗೆ ಶಿವನ ಫಲನೇತ್ರದಿಂ ದವತರಿಸಿದಾ ಶಿವನ ಮಾನಸ ಪುತ್ರ ತವ ಸುಪ್ರಭಾತಂ 13

ಶಿವ ತೇಜೋ ವಿಲಾಸದಿಂ ರುದ್ರಗಣರು ಸೃಜಿಸಿ
ಹರನಾಣತಿಯಂತೆ ಭದ್ರಕಾಳಿಯ ಕೈ ಹಿಡಿದು 
ಗಣ ಸೇನೆಯೋಡನೆ ದಕ್ಷನ ದ್ವಾರವ ಮುತ್ತಿದಾ
ಕಡುಗಲಿ ಶ್ರೀ ವೀರೇಶ ತವ ಸುಪ್ರಭಾತಂ 14 

ದಕ್ಷ ನಿನ್ನಂ ತೆಗಳಿ ಶಿವನಿಂದೆಗೈಯಲಾಕ್ಷಣದಿಂ
ಸಿಡಿಲಿನಾರ್ಭಟ ದೊಳನಲ್ಲಿರ್ಧ ಹರಿ ವಿಧೇಂದ್ರಂ
ನಿಗ್ರಹಿಸಿ ಶಿವದ್ರೋಹಿ ದಕ್ಷನ ಶಿರವ ತೆಗೆದು ಯೋಗಾಗ್ನಿಗಾಹುತಿಯಿತ್ತಾ ಕಡುಗಲಿ ವೀರೇಶ ತವಸುಪ್ರಭಾತಂ 15 

ಶರಣಾದವರೆಲ್ಲರಂ ಮನ್ನಿಸುತ ಪೊರೆದು 
ದಕ್ಷನಿಗೆ ಕುರಿತಲೆಯಿಟ್ಟು ಸಲುಹಲ್ ಮೊಳಗ್ದ
ವಿಜಯೋದ್ದಾರ ಪುಷ್ವವೃಷ್ಠಿ ವೇದ ಘೋಷಾಗಳಿಂ ಮುದವಾಂತ ಶಾಂತಮೂರ್ತಿ ಶ್ರೀ ವೀರೇಶ ತವ ಸುಪ್ರಭಾತಂ 16 

ಹರಿ ನರಸಿಂಹ ಮೌರದಿಂ ಹಿರಣ್ಯಕಶ್ಯಪನ ಕೊಂದು ಲೋಕಂಗಳು ಪೀಡಿಸುತಿರೆ ಶೂಲಪಾಣಿಯ ಆಜ್ಞೆಯಂತೆ 
ಶರಭಾವತಾರದಿಂ ನರಹರಿಯ ಶಿರತೆಗೆದು ಲೋಕಂಗಳಂ 
ಪೊರೆದ ಕರುಣಾಳು ಕಲಿ ವೀರೇಶ ತವ ಸುಪ್ರಭಾತಂ  17 

ರುದ್ರಾಂಶ ಪವನಸುತ ಹೇಮಕೂಟಾದ್ರಿಯೊಳು ಗೈದ ವರ ತಪಕೊಲಿದು ನೀ ಮೈದೋರಿ ಗುರುರೂಪದಿಂ
ಶಿವಾದ್ವೈತದುಪದೇಶ ಪೂರ್ವಕವಾಗಿ ಶಿವ 
ದೀಕ್ಷೆಯಂ ಕರುಣಿಸಿದಾ ಗುರು ವೀರೇಶ ತವ ಸುಪಭಾತಂ 18 

ಮಾರುತಿಯ ಲಿಂಗ ಶಿವಮಾಯಿಯಿಂದ ನಿರ್ಗಮಿಸಲು 
ವಿಧಿ ನಿಯಮದಂತೆ ಅಸುನೀಗಲೆಗಳ ಮಾರುತಿಗೆ ಮೈದೋರಿ ಲಿಂಗ ರೊಂಮಾಂಗ ನಂದನಿಸಿ
ಗುರುವೀರ ಮೂರುತಿಯ ಪೊರೆವ ವೀರೇಶ ತವ ಸುಪ್ರಭಾತಂ  19 

ವರಬಲದಿ ಗರ್ಜಿಸಿ ಲೋಕಂಗಳಂ
ಪೀಡಿಸುತ್ತಿರ್ದ ಕದಂಬಾಸುರ ನಂದೇವರ್ಕಳ
ಪ್ರಾರ್ಥನೆಯಂತೆ ನೀ ಘೋರ ರೂಪವಂ ಧರಿಸಿ
ಭವನಂಗಳಂ ಸಲಹಿದಾ ವೀರೇಶ ತವ ಸುಪ್ರಭಾತಂ 20

ಪಾರಿ ಚಾತಾದ್ರಿಯಲಿ ಯೋಗ ಸಮಾಧಿಯೊಳಿದ್ದ ನಿನ್ನ ದರುಶನಕ್ಕೆ ಬರುತಿರ್ದ ಜಮದಗ್ನಿ ದಧೀಚಿಗಳಂ
ಜ್ವಾಲಾಳಾಸುರ ಭಕ್ತಿಸಲವರ ಮೊರೆ ಕೇಳ್ದು 
ಅಸುರನಂ ಮರ್ದಿಸಿ ಮುನಿಗಳಂ ಸಲುಹಿದಾ ವೀರೇಶ ತವ ಸುಪ್ರಭಾತಂ 21 

ಶಿವದರ್ಶನಕ್ಕಾಗಿ ನಡೆದಿರ್ದವ್ಯಾಸ ದೂರ್ವಾಸರಂ ಪಂಚ ಮೇಡ್ರಾಸುರನು ಭಕ್ಷಿಸಲವರ ಮೊರೆ ಕೇಳ್ದು
ನೀ ಘೋರ ರೂಪಾಂತಂ ದೈತ್ಯನಂ ಸಂಹರಿಸಿ
ಮುನಿ ಕುಲವ ಸಲಹಿದಾ ವೀರೇಶ ತವ ಸುಪ್ರಭಾತಂ 22 

ಶರಣು ವರ ಕಲಿ ವೀರೇಶ ಶರಣು ಶತರವಿತೇಜ
ಶರಣು ಹರಿ ವಿಧಿ ವಂಧ್ಯ ಶರಣು ವಿಶ್ವಾಧಿಕ 
ಶರಣು ಶಿವಗಣಾಧ್ಯಕ್ಷ ಶರಣು ಮಂಗಳಾಂಗ
ಶರಣು ಶಿವಧೂತ ಶ್ರೀ ವೀರೇಶ ತವ ಸುಪ್ರಭಾತಂ 23

ನಮಸ್ತೆ ಶಿವರೂಪಯ ತ್ರಿಲೋಕ ವಂದ್ಯನೆ
ನಮಸ್ತೆ ವೀರಮಣಿ ವೀರಗೋತ್ರಾಧಿಪನೆ
ನಮಸ್ತ ಸರ್ವ ಸಮನ್ವಯಾಚಾರ್ಯನೆ 
ನಮಸ್ತೆ ಜ್ಞಾನಗಮ್ಯಾಯ ಶ್ರೀಗುರು ವೀರೇಶನೆ 24

ನಮಸ್ತೆ ವೀರ ಕಾಸಿಯನುಟ್ಟ ವೀರಖಣೀಯೇ 
ನಮಸ್ತೆ ಮಹಾ ಮಾಯಾ ತಿಮಿರಭಾಸ್ಕರನೇ
ನಮಸ್ತೆ ಶಿವನಿಂದಕರ ಮೃತ್ಯು ದೇವತೆಯೇ 
ನಮಸ್ತೆ ಭವ-ಭಯ ವಿದೂರ ಶ್ರೀ ವೀರ ನಿಧಿಯೇ 25

ವೀರೇಶ ಎಲ್ಲೆಡೆಯು ನಾಸ್ತಿಕತೆ ಹಬ್ಬಿದುದು
ಮತ್ತೆ ನೀನವತರಿಸಿ ವೀರ ಕಹಳೆಯನೂದಿ 
ನುತಿಸಿರ್ಪ ಶಿವಾದ್ವೈತ ಸಿದ್ಧಾಂತವನ್ನುದ್ಧರಿಸಿ
ಮಾನವ ಕೋಟಿಯ ಸಲುಹಲೇಳು ಶ್ರೀವೀರೇಶ ಪ್ರಭುವೇ 26

ರವಿ ಕೋಟಿ ತೇಜನೆ ಶಿವ ಲಾಂಛನ ಭೂಷಣನೇ
ಸಚ್ಚಿದಾನಂದ ಸ್ವರೂಪನೆ ವರದೋಕ್ಷದಾಯಕನೆ ಶಿವತತ್ವ ಚಿಂತಾಮಣಿಯೇ ತ್ರಿಜಗಪೂಜ್ಯನೆ
ಮುನಿ ಕುಲ ವಂದ್ಯ ಭವನಾಶ ವೀರೇಶನೆ 27

ಸದ್ಗುರು ಶ್ರೀ ವೀರೇಶನಂಘ್ರಯಂ ಭಜಿಸುತ್ತ
ಕುಂದ ಗೊರಳನ ಭಕ್ತ ಕಡು ನಿಷ್ಠೆಯಂ ರಚಿಸಿ 
ಭಕ್ತಿ ಜ್ಞಾನ-ವಿರತಿಗಳ ಬಯಸಿ ಅರ್ಪಿಸಿಹರು ಸುಪ್ರಭಾತವನಿದನು ಚಂದ್ರಶೇಖರನು 28

ಮಂಗಲವು ರೇಣುಕಗೆ ಮಂಗಲವುದಾರುಕಗೆ ಮಂಗಲವು ಏಕೋರಾಮಗೆ ಮಂಗಲವು ಪಂಡಿತರಾಧ್ಯಗೆ
ಮಂಗಲವು ವಿಶ್ವಾರಾಧ್ಯನಿಗೆ ಮಂಗಲವು ಶ್ರೀ ವೀರೇಶನಿಗೆ ಶುಭ ಮಂಗಲವು – 29

ಉದಯಾಸ್ತ ಕಾಲದೊಳು ಸುಪ್ರಭಾತವನಿದನು 
ದೃಢ ಭಕ್ತಿ ಭಾವದಿಂ ಬಿಡದೆ ಪಠಿಸಲ್ಕೆ
ಭಕ್ತಿ-ಮುಕ್ತಿಗಳನ್ನು ಸಂತಸದಿ ಕರುಣಿಪನು
ಭಕ್ತವತ್ಸಲ ಗುರು ಶ್ರೀಗುರು ವೀರೇಶನು 30 

ಮಂಗಲವು ನಿನಗೆ ಮಂಗಲವು ಗುರುವಿಗೆ
ಮಂಗಲವು ವೀರನಿಗೆ ಮಂಗಲವು ಭದ್ರನಿಗೆ
ಮಂಗಲವು ಭದ್ರಾಣೆ ಭದ್ರ ಕಾಳೀಶಗೆ 
ಮಂಗಲವು ಮಾಯಾತಿಮಿರ ಭಾಸ್ಕರ ಶ್ರೀ ವೀರೇಶನಿಗೆ ॥ 31 | 

ಮಂಗಲ ಲೋಕಪೂಜ್ಯಾಯ ಮೇದ ಸ್ತುತ್ಯಾಯ ಮಂಗಳಂ 
ಮಂಗಲಂ ರೌದ್ರರೂಪಾಯ ಶೈವ್ಯ ತೇಜಾಯ ಮಂಗಳಂ
ಶುಭವರದ ಹಸ್ತಾಯ ಸತ್ಯ ರೂಪಾಯ ಮಂಗಳಂ
ಮಂಗಳಂ ನಿರ್ವಿಕಲ್ಪಾಯ ಭವ್ಯರೂಪಾಯ ಮಂಗಳಂ 32

ಮಂಗಲಂ ಗುರು ರೂಪಾಯ ಸರ್ವವಂದ್ಯಾಯ ಮಂಗಲಂ
ಮಂಗಲಂ ಅಗ್ನಿನೇತ್ರಾಯ ಜ್ಞಾನಗಮ್ಯಾಯ ಮಂಗಲಂ
ಮಂಗಲಂ ತತ್ವವೇತ್ತಾಯ ವೈರಾಗ್ಯ ನಿಧಿಯೇತಥಾ:
ಮಂಗಲಂ ದೇವ ದೇವಾಯ ಶ್ರೀ ವೀರೇಶಾಯ ಮಂಗಲಂ ॥33
            </Text>
          </ScrollView>
        </View>
        <View style={styles.page} key="2">
          <ScrollView>
            <Text style={styles.textalign}> Page 2 </Text>
            <Text style={styles.textalign}>
              *ಯಡೂರು ವೀರಭದ್ರಾಷ್ಟಕಂ* 
              {"\n"}{"\n"}
              ಶ್ರೀ ವೀರಭದ್ರಗೆ ನಮಿಸುವೆ ನಾನು ಕಾಳಿಕಾ ಮಾತೆಗೆ
              ಕರವನು ಮುಗಿದು | ಜಗವೆ ಪೂಜಿಸುವ ಶಿವರೂಪಿ ನೀನು ಭಕ್ತರ ಪಾಲಿಗೆ ವರ ಕಾಮಧೇನು
              //೧// ಶಿವನ ಜಡೆಯಲೀ ಉದಿಸಿದೆ ನೀನು ಹರನ ಕೋಪಾಗ್ನಿಯ ಜ್ವಾಲೆಯು ನೀನು ||
              ರುದ್ರಾವತಾರದಿ ಖಡೆ ಖಡೆ ಎನುತಲಿ ದಕ್ಷನ ಯಜ್ಞದ ಕಡೆಗೇ ನಡೆದೆ //೨// ಶಿವ
              ನಿಂದೆಯನು ಸಹಿಸದೆ ಸತಿಯು ಯಜ್ಞ ಕುಂಡದೀ ದಹಿಸುತ್ತಿರಲು || ತಾಯಿಯ ದಹನದ
              ದೃಶ್ಯವ ಕಂಡು ವೀರಗೆ ಹರಿದವು ಕಣ್ಣೀರ ಹೊಳೆಯು ||೩// ಶಿವನ ಆಜ್ಞೆಯನು ಪಾಲಿಸಲು
              ನೀ ದಕ್ಷನ ಸೈನ್ಯದ ದರ್ಪವ ಮುರಿದು || ದಕ್ಷ ಬ್ರಹ್ಮನಾ ಶಿರವನು ಹರಿದು ದಹಿಸದೆ
              ಅವನಾ ತಲೆಯನು ನೀನು //೪// ಭದ್ರನ ಕಾಯಕ ಭಕ್ತಿಗೆ ಮೆಚ್ಚಿ ಪರ ಶಿವ ತಾನು ವರವನು
              ನೀಡಿ || ಕೃಷ್ಣಾ ನದಿಯ ಎಡ ದಂಡೆಯ ಮೇಲೆ ನೆಲೆಸೀಗ ನೀನು ವಿರೂಪಾಕ್ಷ ನಾಗಿ
              //೫// ಶಿವನ ಆಜ್ಞೆಯಂತೆ ಯಡೂರ ಕ್ಷೇತ್ರದಿ ಲಿಂಗ ರೂಪದಿ ಕಂಗೊಳಿಸುತಲೀ ||
              ಕಾಡಸಿದ್ಧರಾ ಕರುಣೆಯ ಕಣ್ಣಿಗೆ ಕಾಣುವೆ ನೀನು ಬೂದಿಯ ಒಳಗೆ //೬// ಕಾಡ ಸಿದ್ಧರೂ
              ಯಡೂರ ಜನರು ಅಗಿದರು ಅಲ್ಲಿಯ ಬೂದಿಯ ನೆಲ್ಲವ || ಅಲ್ಲಿ ಕಾಣುವನು ವಿರೂಪಾಕ್ಷ
              ಲಿಂಗಾ ಕಂಡ ಭಕ್ತರಿಗೆ ಅತಿ ಆನಂದ //೭// ವೀರಭದ್ರಗೆ ಒಡಪನು ಹೇಳಲು ಭದ್ರಕಾಳಿಗೆ
              ಭಕ್ತಿಯಿಂದ ನಮಿಸಲು || ವಿಶಾಳಿ ಜಾತ್ರೆಗೆ ತೇರನು ಎಳಯಲು ಸಾವಿರ ಸಾವಿರ ಭಕ್ತರು
              ಬರುವರು //೮// ಲಿಂಗರೂಪದಲಿ ವೀರಭದ್ರನಾ ಮಹಾ ದರುಶಣಾಂ || ಯಡೂರ ವೀರಭದ್ರೇಶ ತವ
              ಪಾದ ಶರಣು || *ರಚನೆ*:- ಶ್ರೀಶೈಲ ಶಾಸ್ತ್ರಿಗಳು, ಯಡೂರು ಪಾಠಶಾಲೆ. *ಶ್ರೀ
              ವೀರಭದ್ರೇಶ್ವರ ಪ್ರಚಾರ ಸಮಿತಿ*
            </Text>
          </ScrollView>
        </View>
        <View style={styles.page} key="3">
          <Text style={styles.textalign}> Page 3 </Text>
          <Text style={styles.textalign}>
            *ಶ್ರೀವೀರಭದ್ರೇಶ್ವರ ವಡಪು* 
            {"\n"}{"\n"}
            ಆಹಾ ರುದ್ರಾ l ಆಹಾ ವೀರಾ l ನಿಲ್ಲಿಸಬಹುದಯ್ಯಾ ಒಂದೇ
            ಮಂತ್ರದಿಂದ ಕಾಳೋರಗನ | ನಿಲ್ಲಿಸ ಬಹುದಯ್ಯಾ ಒಂದೇ ಮಂತ್ರದಿಂದ ಹಾರುವ ಪಕ್ಷಿಯ |
            ನಿಲ್ಲಿಸಬಹುದಯ್ಯಾ ಒಂದೇ ಮಂತ್ರದಿಂದ ಹೆಬ್ಬುಲಿಯ | ನಿಲ್ಲಿಸಬಹುದಯ್ಯಾ ಒಂದೇ
            ಮಂತ್ರದಿಂದ ಈ ಹೆಮ್ಮಾರಿಯ ಲೋಭವೆಂಬ ಗ್ರಹಣಹಿಡಿದವರನ್ನು ಯಾತರಿಂದಲೂ ಬಿಡಿಸುಲಾಗದು
            l ಈ ಲೋಭಕ್ಕೆ ದರಿದ್ರವೇ ಔಷಧ | ಹೇಳಿದರೆ ಕೇಳರು | ತಾವೂ ತಿಳಿಯರು | ಶಾಸ್ತ್ರವ
            ಭಕ್ತಿಯ ಹಿಡಿಯರು l ಇಂಥ ಗೊಡ್ಡ ಮೂಳ ಹೊಲೆಯರಿಗೆ | ಕರ್ಮವೆಂಬ ಶರಧಿಯಲ್ಲಿ ಬಿದ್ದು
            | ಉರುಳಾಡುವುದೇ ಸತ್ಯವೇದಾಂತ ನಮ್ಮ ಅಂಬಿಗರ ಚೌಡಯ್ಯ ಕಡೆ ಕಡೆ....... *ಶ್ರೀ
            ವೀರಭದ್ರೇಶ್ವರ ಪ್ರಚಾರ ಸಮಿತಿ*
          </Text>
        </View>
      </PagerView>
    </View>
  );
};

const styles = StyleSheet.create({
  viewPager: {
    flex: 1,
    marginTop: 0,
    backgroundColor: "#fe724c",
    padding: 15,
  },
  page: {
    justifyContent: "center",
    alignItems: "center",
  },
  textalign: {
    textAlign: "justify",
    fontSize: 20,
    color: "#ffffff",
    padding: 15,
  },
});

export default MyPager;
